{
  "id": "25nabi-muhammad",
  "slug": "25nabi-muhammad",
  "title": "Nabi Muhammad SAW | Kisah Penuh Hikmah",
  "category": "📚 Sejarah & Religi",
  "published_at": "2025-09-30T11:09:00.000+00:00",
  "url": "https://dalam.web.id/artikel/25nabi-muhammad.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjmqa2HJAT2ZoNDiVraOryoJPhDKm52fbnNpvBT9F4hUF1HUR_YBx8WUpaLEhwZwKR0PR25YZ5FulrLy7b7OZj8zfwm3OQY81MpZE9fKuVJOD-dl3LlO3r2tZOMrx0z1zD2jM6V6_1esyKyneZPmUGxU0F9ls0ic8i_55fUiY43ie56cs3dr8t84psczRM/s1600/Muhammad.jpg",
  "content": {
    "text": "Narasi dengan sentuhan penjelasan ringan agar alurnya semakin jernih dan nyaman diikuti. 1) Kelahiran pada Tahun Gajah Baginda diputerakan di Makkah pada Isnin, 12 Rabiuawal (20 April 571M) pada Tahun Gajah (kerana berlakunya serangan tentera bergajah yang dipimpin oleh Abrahah dr Habsyah terhadap Kota Makkah). 2) Orang tua mulia Ibu baginda bernama Aminah manakala ayah baginda bernama Abdullah. 3) Nasab tersambung ke Nabi Ismail Keturunan baginda berasal dari susur galur dari Nabi Ismail kira-kira dalam keturunan yang ke-40. 4) Yatim sejak kecil Ayah baginda meninggal dunia sebelum kelahiran baginda manakala ibu baginda meninggal dunia ketika baginda berusia enam tahun. 5) Ibu susuan yang amanah Ibu angkat atau ibu susuan baginda bernama Halimatus Sa'adiah atau Halimah binti Abu Dhuayb Abdullah. Beliau bersama suami, Al Harith berasal daripada Kabilah Arab Sa'd. 6) Tradisi bayi diasuh di pedalaman Tradisi Arab ketika itu adalah menghantar bayi yang baru lahir untuk disusukan di persekitaran padang pasir berbanding di Kota Mekah. Malangnya, kebanyakan ibu susuan Badwi lebih gemark akan bayi yang masih berbapa. Begitu juga Halimah, namun disebabkan gagal mendapatkan bayi lain, Halimah mengambil juga Nabi Muhammad SAW, lapan hari selepas baginda diputerakan. Beliau menyusukan baginda sehingga usia baginda 2 tahun lebih. 7) Asuhan datuk dan paman Setelah ibu baginda meninggal dunia, baginda dijaga oleh datuknya, Abdul Mutalib kemudian oleh bapa saudaranya, Abu Talib. 8) Menggembala dan perjalanan dagang Abu Talib seorang yang boleh dikatakan berkemampuan. Dari sini baginda belajar untuk mengembala kambing-kambing Abu Talib dan kerap menemani bapa saudaranya berniaga di Syam (Syria). Ketika ini, kerasulan Nabi Muhammad SAW telah diramal oleh pendeta Nasrani bernama Buhaira ketika rombongan perniagaan singgah di Basrah. Buhaira meminta Abu Talib membawa baginda pulang kerana khuatir akan dibunuh oleh kaum Yahudi. 9) Menjauh dari budaya jahiliyah Nabi Muhammad SAW sejak kecil tidak pernah terlibat dalam kehidupan sosial Arab Jahiliyyah. Ibaratnya, baginda tidak terlibat dengan pergaulan bebas dan sebarang perkara yang tidak berfaedah. Namun bukanlah bermakna tidak mempunyai kawan langsung. Jika tiba waktu riadah, baginda masih lagi beriadah bersama rakan-rakan yang lain. 10) Tauhid dan kasih pada dhuafa Sewaktu remaja, baginda percaya sepenuhnya dengan keesaan Allah SWT. Baginda sangat merendah diri dan menyayangi orang miskin. 11) Amanah dalam bisnis Khadijah Pada usia 25 tahun, baginda berkhidmat bersama Khadijah dalam menjalankan perniagaan atas nasihat pakciknya, Abu Talib. Sifat amanah yang dimiliki oleh baginda terutama ketika Khadijah menyerahkan wang modal perniagaan yang besar kepada baginda dan diuruskan dengan sempurna. Ini menyebabkan Khadijah tertarik dengan baginda dan melamar baginda untuk dijadikan suami. 12) Putra-putri Rasulullah Setelah berkahwin, baginda dikurniakan 6 orang anak (2 lelaki, 4 perempuan). Anak-anak lelaki baginda Qasim dan Abdullah telah meninggal dunia semasa kecil. Manakala anak perempuan baginda Ruqayyah, Zainab, Ummu Kalsum & Fatimah AzZahra. Saidatina Khadijah adalah satu-satunya isteri baginda sehinggalah saidatina Khadijah meninggal dunia pada umur 64 tahun. 13) Al-Amin dan Hajar al-Aswad Baginda turut digelar Al Amin. Pada usia 35 tahun, kewibawaan baginda terserlah apabila baginda berjaya menyelesaikan masalah perletakan semula Hajar al-Aswad ke tempat asalnya di penjuru Timur Kaabah yang jatuh ketika banjir. 14) Gua Hira dan kegelisahan sosial Baginda sedih dengan perkembangan Arab Jahiliyah. Semakin teruk dan menyedihkan sehingga baginda kerap kali ke Gua Hira yang kemudian dikenali sebagai Jabal an Nur untuk memikirkan cara bagi mengatasi gejala yang dihadapi masyarakatnya. Nada besar kisah ini: amanah, kasih, dan kepekaan sosial. Semua menjadi landasan sebelum turunnya wahyu, menyiapkan hati, akhlak, dan visi perubahan. Ilustrasi kisah Nabi Muhammad SAW ✕ Tutup ⟵ ⟶",
    "html": "<p>\n          Narasi dengan sentuhan penjelasan ringan agar alurnya semakin jernih dan nyaman diikuti.\n        </p>\n        <h2 class=\"sec\">1) Kelahiran pada Tahun Gajah</h2>\n        <p>Baginda diputerakan di Makkah pada Isnin, 12 Rabiuawal (20 April 571M) pada Tahun Gajah (kerana berlakunya serangan tentera bergajah yang dipimpin oleh Abrahah dr Habsyah terhadap Kota Makkah).</p>\n        <h2 class=\"sec\">2) Orang tua mulia</h2>\n        <p>Ibu baginda bernama Aminah manakala ayah baginda bernama Abdullah.</p>\n        <h2 class=\"sec\">3) Nasab tersambung ke Nabi Ismail</h2>\n        <p>Keturunan baginda berasal dari susur galur dari Nabi Ismail kira-kira dalam keturunan yang ke-40.</p>\n        <h2 class=\"sec\">4) Yatim sejak kecil</h2>\n        <p>Ayah baginda meninggal dunia sebelum kelahiran baginda manakala ibu baginda meninggal dunia ketika baginda berusia enam tahun.</p>\n        <h2 class=\"sec\">5) Ibu susuan yang amanah</h2>\n        <p>Ibu angkat atau ibu susuan baginda bernama Halimatus Sa'adiah atau Halimah binti Abu Dhuayb Abdullah. Beliau bersama suami, Al Harith berasal daripada Kabilah Arab Sa'd.</p>\n        <h2 class=\"sec\">6) Tradisi bayi diasuh di pedalaman</h2>\n        <p>Tradisi Arab ketika itu adalah menghantar bayi yang baru lahir untuk disusukan di persekitaran padang pasir berbanding di Kota Mekah. Malangnya, kebanyakan ibu susuan Badwi lebih gemark akan bayi yang masih berbapa. Begitu juga Halimah, namun disebabkan gagal mendapatkan bayi lain, Halimah mengambil juga Nabi Muhammad SAW, lapan hari selepas baginda diputerakan. Beliau menyusukan baginda sehingga usia baginda 2 tahun lebih.</p>\n        <h2 class=\"sec\">7) Asuhan datuk dan paman</h2>\n        <p>Setelah ibu baginda meninggal dunia, baginda dijaga oleh datuknya, Abdul Mutalib kemudian oleh bapa saudaranya, Abu Talib.</p>\n        <h2 class=\"sec\">8) Menggembala dan perjalanan dagang</h2>\n        <p>Abu Talib seorang yang boleh dikatakan berkemampuan. Dari sini baginda belajar untuk mengembala kambing-kambing Abu Talib dan kerap menemani bapa saudaranya berniaga di Syam (Syria). Ketika ini, kerasulan Nabi Muhammad SAW telah diramal oleh pendeta Nasrani bernama Buhaira ketika rombongan perniagaan singgah di Basrah. Buhaira meminta Abu Talib membawa baginda pulang kerana khuatir akan dibunuh oleh kaum Yahudi.</p>\n        <h2 class=\"sec\">9) Menjauh dari budaya jahiliyah</h2>\n        <p>Nabi Muhammad SAW sejak kecil tidak pernah terlibat dalam kehidupan sosial Arab Jahiliyyah. Ibaratnya, baginda tidak terlibat dengan pergaulan bebas dan sebarang perkara yang tidak berfaedah. Namun bukanlah bermakna tidak mempunyai kawan langsung. Jika tiba waktu riadah, baginda masih lagi beriadah bersama rakan-rakan yang lain.</p>\n        <h2 class=\"sec\">10) Tauhid dan kasih pada dhuafa</h2>\n        <p>Sewaktu remaja, baginda percaya sepenuhnya dengan keesaan Allah SWT. Baginda sangat merendah diri dan menyayangi orang miskin.</p>\n        <h2 class=\"sec\">11) Amanah dalam bisnis Khadijah</h2>\n        <p>Pada usia 25 tahun, baginda berkhidmat bersama Khadijah dalam menjalankan perniagaan atas nasihat pakciknya, Abu Talib. Sifat amanah yang dimiliki oleh baginda terutama ketika Khadijah menyerahkan wang modal perniagaan yang besar kepada baginda dan diuruskan dengan sempurna. Ini menyebabkan Khadijah tertarik dengan baginda dan melamar baginda untuk dijadikan suami.</p>\n        <h2 class=\"sec\">12) Putra-putri Rasulullah</h2>\n        <p>Setelah berkahwin, baginda dikurniakan 6 orang anak (2 lelaki, 4 perempuan). Anak-anak lelaki baginda Qasim dan Abdullah telah meninggal dunia semasa kecil. Manakala anak perempuan baginda Ruqayyah, Zainab, Ummu Kalsum &amp; Fatimah AzZahra. Saidatina Khadijah adalah satu-satunya isteri baginda sehinggalah saidatina Khadijah meninggal dunia pada umur 64 tahun.</p>\n        <h2 class=\"sec\">13) Al-Amin dan Hajar al-Aswad</h2>\n        <p>Baginda turut digelar Al Amin. Pada usia 35 tahun, kewibawaan baginda terserlah apabila baginda berjaya menyelesaikan masalah perletakan semula Hajar al-Aswad ke tempat asalnya di penjuru Timur Kaabah yang jatuh ketika banjir.</p>\n        <h2 class=\"sec\">14) Gua Hira dan kegelisahan sosial</h2>\n        <p>Baginda sedih dengan perkembangan Arab Jahiliyah. Semakin teruk dan menyedihkan sehingga baginda kerap kali ke Gua Hira yang kemudian dikenali sebagai Jabal an Nur untuk memikirkan cara bagi mengatasi gejala yang dihadapi masyarakatnya.</p>\n        <div class=\"highlight\">\n          Nada besar kisah ini: amanah, kasih, dan kepekaan sosial. Semua menjadi landasan sebelum turunnya wahyu, menyiapkan hati, akhlak, dan visi perubahan.\n        </div>\n        <!-- Galeri Foto -->\n        <section aria-label=\"Galeri foto\" class=\"gallery\" id=\"gallery\">\n          <figure data-index=\"0\">\n            <img loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjmqa2HJAT2ZoNDiVraOryoJPhDKm52fbnNpvBT9F4hUF1HUR_YBx8WUpaLEhwZwKR0PR25YZ5FulrLy7b7OZj8zfwm3OQY81MpZE9fKuVJOD-dl3LlO3r2tZOMrx0z1zD2jM6V6_1esyKyneZPmUGxU0F9ls0ic8i_55fUiY43ie56cs3dr8t84psczRM/s1600/Muhammad.jpg\" alt=\"Ilustrasi Nabi Muhammad SAW\">\n            <figcaption>Ilustrasi kisah Nabi Muhammad SAW</figcaption>\n          </figure>\n        </section>\n        <!-- Lightbox -->\n        <div class=\"lightbox\" id=\"lightbox\" aria-modal=\"true\" role=\"dialog\" aria-label=\"Pratinjau gambar\">\n          <button class=\"close\" aria-label=\"Tutup lightbox\">✕ Tutup</button>\n          <img id=\"lightbox-img\" alt=\"\">\n          <div class=\"nav\">\n            <button class=\"prev\" aria-label=\"Gambar sebelumnya\">⟵</button>\n            <button class=\"next\" aria-label=\"Gambar berikutnya\">⟶</button>\n          </div>\n        </div>\n        <!-- Share -->"
  },
  "meta": {
    "summary": "Kisah Nabi Muhammad SAW dari kelahiran hingga masa muda: Tahun Gajah, Halimah as-Sa‘diyah, Khadijah, Hajar al-Aswad, dan Gua Hira. Disajikan santai, interaktif, dan ramah mobile.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Kisah Nabi Muhammad SAW dari kelahiran hingga masa muda: Tahun Gajah, Halimah as-Sa‘diyah, Khadijah, Hajar al-Aswad, dan Gua Hira. Disajikan santai, interaktif, dan ramah mobile."
  }
}