{
  "id": "abu-thalhah",
  "slug": "abu-thalhah",
  "title": "Abu Thalhah, Muslim Sang Pengawal Rasulullah",
  "category": "📚 Sejarah & Religi",
  "published_at": "2025-04-16T08:24:29.837+00:00",
  "url": "https://dalam.web.id/artikel/abu-thalhah.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiXvtw0KsgOzkUWsV9TFGglW4JoLkariKc-vAQFnzPgicxYpsoCpk5vFUOv70E6vjbIr0ZD2eaDhxFPw-DAHVIpGh0lPv7Sgc5EaLlUhTq_wHcQ94TfcExr-0RGaz_n0sOCfB5TypscbRDCD_x_BSNuukGsTeJdiWm-ZIdVa6TAtY8_rjw_85zWLYjm_ds/s1600/Abu-Thalhah.jpg",
  "content": {
    "text": "Keteguhan tidak selalu berisik; kadang ia hadir sebagai kesetiaan yang tenang. Pengawal yang tegas, puasa yang lembut Abu Thalhah adalah sahabat dan pengawal Rasulullah SAW. Setelah Rasulullah SAW wafat, Abu Thalhah fokus pada amal-amal seperti jihad dan puasa. Ia terus-menerus melakukan puasa Dahr, yaitu puasa yang tidak pernah berhenti, hingga ada orang yang mengatakan, \"Setelah wafatnya Rasulullah SAW, Abu Thalhah tidak pernah berbuka, kecuali saat sakit atau sedang dalam perjalanan.\" Ia terus berpuasa seperti itu hingga ajal menjemputnya. Padahal setelah Rasulullah wafat, Abu Thalhah masih hidup selama 40 tahun lagi. Akhir hayat di lautan perjuangan Selama masa kekhalifahan Utsman bin ‘Affan, dibuatlah armada laut Islam untuk melakukan penyerangan terhadap sebuah pulau yang berada di bawah kekuasaan Romawi. Abu Thalhah ikut serta dalam perjalanan tersebut meskipun usianya sudah tidak muda lagi. Namun ia meninggal dunia saat masih dalam perjalanan di dalam kapal. Pada masa itu, pasukan Islam tidak menemukan pulau untuk mengubur jenazahnya. Karenanya, jenazah Abu Thalhah terus berada di kapal selama tujuh hari, tetapi tetap utuh dan tidak berubah sepeserak. Hingga akhirnya mereka menemukan sebuah tempat yang digunakan untuk mengubur jasad Abu Thalhah. Jejak keteladanan: Pengawal Rasulullah dengan keberanian dan hormat. Puasa Dahr sebagai simbol komitmen ibadah yang konsisten. Akhir hayat yang mulia dalam barisan armada Islam.",
    "html": "<div class=\"hook\">Keteguhan tidak selalu berisik; kadang ia hadir sebagai kesetiaan yang tenang.</div>\n\n        <h3>Pengawal yang tegas, puasa yang lembut</h3>\n        <p>Abu Thalhah adalah sahabat dan pengawal Rasulullah SAW. Setelah Rasulullah SAW wafat, Abu Thalhah fokus pada amal-amal seperti jihad dan puasa. Ia terus-menerus melakukan puasa Dahr, yaitu puasa yang tidak pernah berhenti, hingga ada orang yang mengatakan, \"Setelah wafatnya Rasulullah SAW, Abu Thalhah tidak pernah berbuka, kecuali saat sakit atau sedang dalam perjalanan.\"</p>\n        <p>Ia terus berpuasa seperti itu hingga ajal menjemputnya. Padahal setelah Rasulullah wafat, Abu Thalhah masih hidup selama 40 tahun lagi.</p>\n\n        <figure class=\"gallery\" id=\"gallery\">\n          <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiXvtw0KsgOzkUWsV9TFGglW4JoLkariKc-vAQFnzPgicxYpsoCpk5vFUOv70E6vjbIr0ZD2eaDhxFPw-DAHVIpGh0lPv7Sgc5EaLlUhTq_wHcQ94TfcExr-0RGaz_n0sOCfB5TypscbRDCD_x_BSNuukGsTeJdiWm-ZIdVa6TAtY8_rjw_85zWLYjm_ds/s1600/Abu-Thalhah.jpg\" alt=\"Abu Thalhah — pengawal Rasulullah\" loading=\"lazy\" data-caption=\"Abu Thalhah — sahabat setia, pengawal Rasulullah, teladan keteguhan.\">\n          <img src=\"https://images.unsplash.com/photo-1548013146-72479768bada?q=80&amp;w=1200&amp;auto=format&amp;fit=crop\" alt=\"Masjid tua — jejak teladan\" loading=\"lazy\" data-caption=\"Jejak teladan yang tumbuh dari kesetiaan dan ibadah.\">\n          <img src=\"https://images.unsplash.com/photo-1561484936-6599d0adb3fd?q=80&amp;w=1200&amp;auto=format&amp;fit=crop\" alt=\"Lautan — perjalanan armada\" loading=\"lazy\" data-caption=\"Lautan perjalanan armada Islam pada masa Utsman bin ‘Affan.\">\n        </figure>\n\n        <h3>Akhir hayat di lautan perjuangan</h3>\n        <p>Selama masa kekhalifahan Utsman bin ‘Affan, dibuatlah armada laut Islam untuk melakukan penyerangan terhadap sebuah pulau yang berada di bawah kekuasaan Romawi. Abu Thalhah ikut serta dalam perjalanan tersebut meskipun usianya sudah tidak muda lagi. Namun ia meninggal dunia saat masih dalam perjalanan di dalam kapal.</p>\n        <p>Pada masa itu, pasukan Islam tidak menemukan pulau untuk mengubur jenazahnya. Karenanya, jenazah Abu Thalhah terus berada di kapal selama tujuh hari, tetapi tetap utuh dan tidak berubah sepeserak. Hingga akhirnya mereka menemukan sebuah tempat yang digunakan untuk mengubur jasad Abu Thalhah.</p>\n\n        <div class=\"aside\">\n          <strong>Jejak keteladanan:</strong>\n          <ul>\n            <li>Pengawal Rasulullah dengan keberanian dan hormat.</li>\n            <li>Puasa Dahr sebagai simbol komitmen ibadah yang konsisten.</li>\n            <li>Akhir hayat yang mulia dalam barisan armada Islam.</li>\n          </ul>\n        </div>"
  },
  "meta": {
    "summary": "Kisah Abu Thalhah—sahabat dan pengawal Rasulullah SAW. Puasa tanpa henti, jihad, dan wafat mulia di perjalanan armada Islam.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Kisah Abu Thalhah—sahabat dan pengawal Rasulullah SAW. Puasa tanpa henti, jihad, dan wafat mulia di perjalanan armada Islam."
  }
}