{
  "id": "aku-cinta-indonesia",
  "slug": "aku-cinta-indonesia",
  "title": "Aku Cinta Indonesia - Warisan Nilai dari Film Anak 'ACI' (1985)",
  "category": "🔆 Lainnya",
  "published_at": "2025-07-16T03:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/aku-cinta-indonesia.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhqsGvA6h5GpXtlRm-xO3oNtemgYUU1_vnoBApmWIlok4aMkzOVMuRxCiyflHZdTfvrd9TAvXD2Xm0rIE98VrWMh_Y-9l_tMgfXO6lgH8doZSmPfrbpwmgJd25GqTpcMH909_GXRrGY7dCj/s800/aci.jpg",
  "content": {
    "text": "Diperbarui: — Penulis: ArsipBudaya.id Sekilas tentang Film Serial \"ACI\" (Aku Cinta Indonesia) Pada sekitar tahun 1985, PUSTEKKOM merilis sebuah serial pendidikan anak yang menonjolkan nilai-nilai karakter: tanggung jawab, disiplin, kerja keras, kerjasama, toleransi, saling menghargai, persaingan sehat, dan persahabatan. Serial ini populer di kalangan anak-anak dan keluarga sebagai media pembelajaran moral dan sosial. Pemeran & Produksi Film itu menampilkan Amir (Agyl Syahriar), Cici (Dyah Ekowati Utomo), dan Ito (Ario Sagiantoro). Lagu latar bertajuk ACI melibatkan Tonnie Danoe dan Arswendo Atmowiloto sebagai komposer, serta sejumlah musisi dan vokalis yang berkontribusi - diproduksi oleh Insan Record. Lirik Lagu ACI Hanya ada satu cinta dengan bumbu rindu selalu Cinta kita, cinta bersama Da... Da... Da... Da... Da... Hanya ada satu rindu tanpa ragu, tanpa cemburu Rindu kita, rindu bersama Da... Da... Da... Da... Da... Hanya ada, satu cinta Bukan tujuh, bukan seribu Cinta kita, cinta bersama Da... Da... Da... Da... Da... A - C - I... AKU CINTA INDONESIA! A bisa Amir C bisa Cici I bisa Ito... Tapi A - C - I... AKU CINTA... INDONESIA!! Nilai-Nilai yang Diwariskan Tanggung jawab - tokoh-tokoh muda dalam ACI menunjukkan bahwa tugas harus diselesaikan dengan baik. Disiplin & kerja keras - kebiasaan baik dipupuk sejak dini melalui cerita dan contoh. Kerjasama & persahabatan - konflik diselesaikan lewat dialog dan gotong-royong. Toleransi & saling menghargai - perbedaan diposisikan sebagai kekayaan sosial. Sikap kompetitif sehat - menekankan usaha bukan kemenangan semata. Relevansi untuk Generasi Kini Di era digital, nilai-nilai ACI tetap relevan. Pendidikan karakter lewat media—film, lagu, atau kartun—masih efektif untuk menanamkan kebiasaan positif pada anak. Tantangannya adalah menyajikan konten yang menarik sekaligus mendidik, sesuai perkembangan teknologi dan kultur anak masa kini. Semoga warisan nilai dari serial ACI terus hidup dan diterapkan oleh generasi baru Indonesia.",
    "html": "<div class=\"meta\">\n  <div class=\"small\">\nDiperbarui: <time id=\"updated-time\">—</time>\n  </div>\n  <div class=\"small\">Penulis: ArsipBudaya.id</div>\n</div>\n<h2 id=\"main-title\">\n  Sekilas tentang Film Serial \"ACI\" (Aku Cinta Indonesia)\n</h2>\n<p>\n  Pada sekitar tahun 1985, PUSTEKKOM merilis sebuah serial\n  pendidikan anak yang menonjolkan nilai-nilai karakter: tanggung\n  jawab, disiplin, kerja keras, kerjasama, toleransi, saling\n  menghargai, persaingan sehat, dan persahabatan. Serial ini populer\n  di kalangan anak-anak dan keluarga sebagai media pembelajaran\n  moral dan sosial.\n</p>\n<div class=\"illustration\">\n  <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhqsGvA6h5GpXtlRm-xO3oNtemgYUU1_vnoBApmWIlok4aMkzOVMuRxCiyflHZdTfvrd9TAvXD2Xm0rIE98VrWMh_Y-9l_tMgfXO6lgH8doZSmPfrbpwmgJd25GqTpcMH909_GXRrGY7dCj/s800/aci.jpg\" alt=\"Poster ACI - Aku Cinta Indonesia\">\n</div>\n<h3 class=\"section-title\">Pemeran &amp; Produksi</h3>\n<p>\n  Film itu menampilkan Amir (Agyl Syahriar), Cici (Dyah Ekowati\n  Utomo), dan Ito (Ario Sagiantoro). Lagu latar bertajuk\n  <em>ACI</em> melibatkan Tonnie Danoe dan Arswendo Atmowiloto\n  sebagai komposer, serta sejumlah musisi dan vokalis yang\n  berkontribusi - diproduksi oleh Insan Record.\n</p>\n<h3 class=\"section-title\">Lirik Lagu ACI</h3>\n<pre class=\"lyrics\">Hanya ada satu cinta\ndengan bumbu rindu selalu\nCinta kita, cinta bersama\nDa... Da... Da... Da... Da...\n\nHanya ada satu rindu\ntanpa ragu, tanpa cemburu\nRindu kita, rindu bersama\nDa... Da... Da... Da... Da...\n\nHanya ada, satu cinta\nBukan tujuh, bukan seribu\nCinta kita, cinta bersama\nDa... Da... Da... Da... Da...\n\nA - C - I...\nAKU CINTA INDONESIA!\nA bisa Amir\nC bisa Cici\nI bisa Ito...\n\nTapi A - C - I...\nAKU CINTA...\n\nINDONESIA!!</pre>\n<h3 class=\"section-title\">Nilai-Nilai yang Diwariskan</h3>\n<ul>\n  <li>\n<strong>Tanggung jawab</strong> - tokoh-tokoh muda dalam ACI\nmenunjukkan bahwa tugas harus diselesaikan dengan baik.\n  </li>\n  <li>\n<strong>Disiplin &amp; kerja keras</strong> - kebiasaan baik dipupuk\nsejak dini melalui cerita dan contoh.\n  </li>\n  <li>\n<strong>Kerjasama &amp; persahabatan</strong> - konflik diselesaikan\nlewat dialog dan gotong-royong.\n  </li>\n  <li>\n<strong>Toleransi &amp; saling menghargai</strong> - perbedaan\ndiposisikan sebagai kekayaan sosial.\n  </li>\n  <li>\n<strong>Sikap kompetitif sehat</strong> - menekankan usaha bukan\nkemenangan semata.\n  </li>\n</ul>\n<h3 class=\"section-title\">Relevansi untuk Generasi Kini</h3>\n<p>\n  Di era digital, nilai-nilai ACI tetap relevan. Pendidikan karakter\n  lewat media—film, lagu, atau kartun—masih efektif untuk menanamkan\n  kebiasaan positif pada anak. Tantangannya adalah menyajikan konten\n  yang menarik sekaligus mendidik, sesuai perkembangan teknologi dan\n  kultur anak masa kini.\n</p>\n<p class=\"muted\">\n  Semoga warisan nilai dari serial ACI terus hidup dan diterapkan\n  oleh generasi baru Indonesia.\n</p>\n  \n<div style=\"margin-top: 18px; color: var(--muted); font-size: 10px\">\n  <span id=\"current-url\" class=\"small-muted\"></span>\n</div>"
  },
  "meta": {
    "summary": "Sejarah singkat film serial anak ACI (Aku Cinta Indonesia), nilai karakter yang diajarkan, lirik lagu, dan relevansinya untuk generasi masa kini.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Sejarah singkat film serial anak ACI (Aku Cinta Indonesia), nilai karakter yang diajarkan, lirik lagu, dan relevansinya untuk generasi masa kini."
  }
}