{
  "id": "bacaan-dalam-shalat",
  "title": "Panduan Bacaan dan Doa dalam Gerakan Shalat",
  "slug": "bacaan-dalam-shalat.html",
  "url": "https://dalam.web.id/artikel/bacaan-dalam-shalat.html",
  "datePublished": "2025-04-16T08:24:29.839+00:00",
  "summary": "Belajar bersama mengenai terjemahan dan makna bacaan doa dalam setiap gerakan shalat, mulai dari Takbiratul Ihram hingga Salam, agar lebih khusyuk.",
  "category": "📚 Sejarah & Religi",
  "promptHint": "Belajar bersama mengenai terjemahan dan makna bacaan doa dalam setiap gerakan shalat, mulai dari Takbiratul Ihram hingga Salam, agar lebih khusyuk.",
  "customPromptHintManuallySet": false,
  "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjzdWmJ82HCmZBW_Y6oGJ9bBHxKKeCzwstKWyB-Y5wBcS3HDbhechFrPEktrlnW1zdflW2QT91Y-ej-PdZBIQpBUvwFOmun_SJAIg1Z96lPt4K4q6sbxP99OTnJAFLxpQE42B58MeI0Y-VS/s800/kaligrafitasyahud2.png",
  "content_plain": "Bacaan dan Doa dalam Gerakan Shalat Alhamdulillah, saat waktu luang kali ini saya mengajak untuk belajar bersama tentang Bacaan dan Doa pada setiap Fase dalam Gerakan Shalat. Berikut ini adalah terjemahan dari Bacaan dan Doanya: 1. Takbiratul Ihram Allaahu' Akbar(Allah Maha Besar) Doa Iftitah: Allaahu akbar kabiira, walhamdulillaahi katsiira, wa subhanallaahi bukrataw, waashiila(Allah Maha Besar, dan Segala Puji yang sangat banyak bagi Allah, dan Maha Suci Allah sepanjang pagi dan petang) Innii wajjahtu wajhiya, lillazii fatharassamaawaati walardha, haniifam, muslimaa, wamaa ana minal musrykiin(Sungguh aku hadapkan wajahku kepada wajah-Mu, yang telah menciptakan langit dan bumi, dengan penuh kelurusan dan penyerahan diriku, dan aku tidak termasuk orang-orang yang mempersekutuan Engkau/Musryik) Innasshalaatii, wa nusukii, wa mahyaaya, wa mamaati, lillaahi rabbil 'aalamiin(Sesungguhnya shalatku dan ibadah qurbanku, hidupku dan matiku, hanya untuk Allaah Rabb Semesta Alam) Laa syariikalahu, wabidzaalika umirtu, wa ana minal muslimiin(Tidak akan aku menduakan Engkau, dan memang aku diperintahkan seperti itu, dan aku termasuk golongan hamba yang berserah diri kepada-Mu) Surah Al-Fatihah (tentunya sangat jelas arti dan maknanya) Surah lainnya dalam Al-Quran. 2. Ruku' Allaahu' Akbar(Allah Maha Besar) Subhaana, rabbiyal, 'adzhiimi(Maha Suci, Tuhanku Yang Maha Agung) minimal di ulangi 3 kali dan dibolehkan untuk melebihkannya. 3. I'tidal Sami'allaahu, li, man, hamidahu(Mudah-mudahan Allah mendengar, kepada sesiapa yang memuji-Nya) Rabbanaa, lakal, hamdu(Yaa Tuhan kami, bagi- Mu segala Puji) Wa mil assamaawaati, wa mil al ardhi, wa mil a maa shikta, min shai in, ba'du(Sepenuh langit dan sepenuh bumi, dan sepenuh apa yang Engkau kehendaki, dari sesuatu dan sesudahnya) 4. Sujud Allaahu' Akbar(Allah Maha Besar) Subhaana, rabbiyal, a'laa, wa, bihamdihi(Maha Suci Tuhanku Yang Maha Luhur, dan aku memuji-Nya) minimal di ulangi 3 kali dan dibolehkan untuk melebihkannya. 5. Duduk antara 2 Sujud Allaahu' Akbar(Allah Maha Besar) Allaahummaghfirlii, warhamnii, wajburnii, warfa'nii, warzuqnii, wahdinii, wa 'aafuanii...(Ya Allah ampunilah aku, sayangilah aku, Tutuplah aib-aibku, Angkatlah derajatku, Berilah aku rezeki, Berilah aku petunjuk, Maafkanlah aku...) 6. Duduk Tasyahud Awal Allaahu' Akbar(Allah Maha Besar) Attahiyyaatul mubaarakaatus shalawaatut thayyibaatulillaah(Segala ucapan selamat adalah bagi Allah, dan kebahagiaan serta kebaikan) Assalaamu' alayka ayyuhannabiyyu warahmatullaahi wa barakaatuh(Semoga kesejahteraan dilimpahkan kepadamu wahai Nabi, dan beserta Rahmat Allah, dan berkat-Nya) Assalaamu 'alayna wa 'alaa 'ibaadillaahis shaalihiin(Semoga kesejahteraan dilimpahkan kepada kami pula, dan kepada sekalian hamba-hambanya yang soleh) Asyhadu allaa ilaaha illallaah(Aku bersaksi, bahwa tiada Tuhan kecuali Allah) Wa asyhadu annaa muhammadar rasuulullaah(Dan aku bersaksi, bahwa Nabi Muhammad adalah hamba-Nya, dan Rasul-Nya) 7. Duduk Tasyahud Akhir Allaahu' Akbar(Allah Maha Besar) Mengulang kembali bacaan dari Duduk Tasyahud Awal lalu diteruskan dengan: Allaahumma, shalli 'alaa muhammad, wa 'alaa, aali muhammad(Ya Allah, berikanlah kebahagiaan kepada Muhammad dan kepada keluarga Muhammad) Kamaa, shallayta, 'alaa ibrahiim, wa 'alaa, aali ibraahiim(Sebagaimana telah Engkau berikan kebahagiaan kepada Ibrahim, dan kepada keluarga Ibrahim) Allaahumma, baarik, 'alaa muhammad, wa 'alaa aali muhammad(Ya Allah, berikanlah berkah kepada Muhammad, dan kepada keluarga Muhammad) Kamaa, baarakta, 'ala ibraahiim, wa 'alaa, aali ibraahiiim(Sebagaimana Engkau telah memberikan berkah kepada Ibrahim, dan kepada keluarga Ibrahim) Fil 'aalamiina Innaka, hamiidummajiid(Sesungguhnya Engkau, Maha Terpuji lagi Maha Mulia) 8. Ucapan Salam Assalaamu' alaikum warahmatullaahi wa barakaatuh(Salam sejahtera untukmu, Rahmat Allah dan berkat-Nya) Semoga artikel ini dapat selalu mengingatkan saya agar lebih memaknai apa itu arti Shalat, selain juga yang utama adalah memenuhi Kewajiban dalam Rukun Islam yang Kedua. Dan sejujurnya saya tidak mau termasuk Pelaku Shalat yang hanya Menunaikan Kewajiban tanpa mengetahui tentang arti dan makna dari Bacaan serta Doa yang terucap dalam Shalat. Wassalamu' alaikum warahmatullaahi wa barakaatuh..."
}