{
  "id": "bekerja-dalam-islam",
  "slug": "bekerja-dalam-islam",
  "title": "Bekerja dalam Islam - Hadits dan Penjelasan Lengkap",
  "category": "📚 Sejarah & Religi",
  "published_at": "2025-08-01T03:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/bekerja-dalam-islam.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjRYTAfZbqQ4YSoUTBjqRGYZt8p_WKaGUm2VHyvjjv8oDCBPEkBuld-tofxzdLnvOoue3tnepQMRCEqtBUlz7HcLRpouBaoY0DFtA8lk4o1txpHROc7IaLtzMkd2ReGMJYZ5fw7yT99BKYC/s1600/bekerja-2.jpg",
  "content": {
    "text": "Hadits-Hadits tentang Bekerja Dari Miqdan r.a. dari Nabi Muhammad Saw, bersabda: Tidaklah seseorang makan lebih baik dari hasil usahanya sendiri. Sesungguhnya Nabi Daud a.s., makan dari hasil usahanya sendiri. (HR. Bukhari) Dari Abu Hurairah r.a.: Sesungguhnya Nabi Daud a.s. tidak makan kecuali dari hasil usahanya sendiri. (HR. Bukhari) Rasulullah Saw bersabda: Sungguh, seandainya salah seorang di antara kalian mencari kayu bakar dan memikul ikatan kayu itu, maka itu lebih baik daripada meminta-minta kepada seseorang, baik diberi ataupun tidak. (HR. Bukhari dan Muslim) Rasulullah Saw bersabda: Sungguh seandainya salah seorang mengambil tali, pergi ke gunung, memikul seikat kayu bakar, lalu menjualnya untuk kebutuhan hidupnya, itu lebih baik daripada meminta-minta. (HR. Bukhari) Rasul Saw bersabda: Barang siapa pada malam hari merasakan kelelahan karena bekerja pada siang hari, maka pada malam itu ia diampuni Allah. (HR. Ahmad & Ibnu Asakir) Rasulullah Saw bersabda ketika ditanya pekerjaan terbaik: Usaha seseorang dengan tangannya sendiri dan perniagaan yang baik. (HR. Ahmad dan Baihaqi) Makna dan Penjelasan Hadits-hadits di atas menunjukkan bahwa bekerja adalah mulia dalam Islam. Bekerja bukan hanya untuk kebutuhan perut, tetapi menjaga harga diri, martabat, dan bagian dari ibadah. Bahkan disebut sebagai jihad fi sabilillah ketika seorang muslim berusaha keras menafkahi diri dan keluarganya. Rasulullah Saw menegaskan bahwa lebih baik mencari kayu bakar untuk dijual daripada meminta-minta. Mengemis adalah kehinaan, baik di sisi manusia maupun Allah SWT. Sebaliknya, bekerja menjadikan manusia mulia. Para sahabat pun adalah pekerja keras. Ada yang menjadi pedagang sukses dan menyumbangkan hartanya untuk Islam. Umar bin Khaththab bahkan pernah menghalau orang yang hanya duduk di masjid tanpa bekerja di siang hari. Kewajiban Bekerja Bekerja dalam Islam adalah kewajiban (fardhu). Rasulullah Saw bersabda: Mencari rezeki yang halal itu wajib sesudah menunaikan kewajiban fardhu. (HR. Thabrani dan Baihaqi) Maka seorang muslim tidak boleh meninggalkan kerja halal. Hasil usaha itu membawa keberkahan, sementara pekerjaan haram dilarang keras dalam Islam. Contoh Script (Highlight + Tombol Copy) Copy // Contoh kode sederhana function bekerjaHalal() { return \"Bekerja dengan tangan sendiri lebih mulia daripada meminta-minta.\"; } console.log(bekerjaHalal());",
    "html": "<img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjRYTAfZbqQ4YSoUTBjqRGYZt8p_WKaGUm2VHyvjjv8oDCBPEkBuld-tofxzdLnvOoue3tnepQMRCEqtBUlz7HcLRpouBaoY0DFtA8lk4o1txpHROc7IaLtzMkd2ReGMJYZ5fw7yT99BKYC/s300/bekerja-2.jpg\" alt=\"Ilustrasi bekerja\" class=\"float-right\">\n\n<h2>Hadits-Hadits tentang Bekerja</h2>\n<p><i>Dari Miqdan r.a. dari Nabi Muhammad Saw, bersabda: Tidaklah seseorang makan lebih baik dari hasil usahanya sendiri. Sesungguhnya Nabi Daud a.s., makan dari hasil usahanya sendiri.</i> (HR. Bukhari)</p>\n<p><i>Dari Abu Hurairah r.a.: Sesungguhnya Nabi Daud a.s. tidak makan kecuali dari hasil usahanya sendiri.</i> (HR. Bukhari)</p>\n<p><i>Rasulullah Saw bersabda: Sungguh, seandainya salah seorang di antara kalian mencari kayu bakar dan memikul ikatan kayu itu, maka itu lebih baik daripada meminta-minta kepada seseorang, baik diberi ataupun tidak.</i> (HR. Bukhari dan Muslim)</p>\n<p><i>Rasulullah Saw bersabda: Sungguh seandainya salah seorang mengambil tali, pergi ke gunung, memikul seikat kayu bakar, lalu menjualnya untuk kebutuhan hidupnya, itu lebih baik daripada meminta-minta.</i> (HR. Bukhari)</p>\n<p><i>Rasul Saw bersabda: Barang siapa pada malam hari merasakan kelelahan karena bekerja pada siang hari, maka pada malam itu ia diampuni Allah.</i> (HR. Ahmad &amp; Ibnu Asakir)</p>\n<p><i>Rasulullah Saw bersabda ketika ditanya pekerjaan terbaik: Usaha seseorang dengan tangannya sendiri dan perniagaan yang baik.</i> (HR. Ahmad dan Baihaqi)</p>\n\n<h2>Makna dan Penjelasan</h2>\n<p>Hadits-hadits di atas menunjukkan bahwa <b>bekerja adalah mulia dalam Islam</b>. Bekerja bukan hanya untuk kebutuhan perut, tetapi menjaga harga diri, martabat, dan bagian dari ibadah. Bahkan disebut sebagai <i>jihad fi sabilillah</i> ketika seorang muslim berusaha keras menafkahi diri dan keluarganya.</p>\n<p>Rasulullah Saw menegaskan bahwa lebih baik mencari kayu bakar untuk dijual daripada meminta-minta. Mengemis adalah kehinaan, baik di sisi manusia maupun Allah SWT. Sebaliknya, bekerja menjadikan manusia mulia.</p>\n<p>Para sahabat pun adalah pekerja keras. Ada yang menjadi pedagang sukses dan menyumbangkan hartanya untuk Islam. Umar bin Khaththab bahkan pernah menghalau orang yang hanya duduk di masjid tanpa bekerja di siang hari.</p>\n\n<h2>Kewajiban Bekerja</h2>\n<p>Bekerja dalam Islam adalah <b>kewajiban (fardhu)</b>. Rasulullah Saw bersabda: <i>Mencari rezeki yang halal itu wajib sesudah menunaikan kewajiban fardhu.</i> (HR. Thabrani dan Baihaqi)</p>\n<p>Maka seorang muslim tidak boleh meninggalkan kerja halal. Hasil usaha itu membawa keberkahan, sementara pekerjaan haram dilarang keras dalam Islam.</p>\n\n<h2>Contoh Script (Highlight + Tombol Copy)</h2>\n<pre><button class=\"copy-btn\" onclick=\"copyCode(this)\">Copy</button><code class=\"language-javascript\">\n// Contoh kode sederhana\nfunction bekerjaHalal() {\n  return \"Bekerja dengan tangan sendiri lebih mulia daripada meminta-minta.\";\n}\nconsole.log(bekerjaHalal());\n</code></pre>\n\n<div style=\"margin-top:18px\">\n\n\n</div>"
  },
  "meta": {
    "summary": "Kumpulan hadits tentang bekerja dalam Islam, keutamaan mencari nafkah halal, menjaga martabat, dan penjelasan lengkap bahwa bekerja adalah bagian dari ibadah.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Kumpulan hadits tentang bekerja dalam Islam, keutamaan mencari nafkah halal, menjaga martabat, dan penjelasan lengkap bahwa bekerja adalah bagian dari ibadah."
  }
}