{
  "id": "blankon-9-suroboyo",
  "slug": "blankon-9-suroboyo",
  "title": "BlankOn 9.0 Suroboyo Telah Rilis!",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-11-03T18:45:34.323+00:00",
  "url": "https://dalam.web.id/artikel/blankon-9-suroboyo.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiucNZVgeR7UvetlbsOUWbUheJ7EXrAIzej0VM6i5T2_R6Sfqn3X7fg6a8B_yPz9rLJ7DUimfPyADvR95cpUkIXHUhZ4d7mM5jdtgfDG37BCWQP8vv09uc-J-usC7dUq8j4Sq6reAiNee_rF1lMtKVJXRRRUOavaE654PrQvCBKHJV8dZc5uWc2NUODU7k/s1600/1manokwari.png",
  "content_plain": "BlankOn 9.0 Suroboyo (Catatan: Ini adalah arsip pengumuman rilis BlankOn 9.0 \"Suroboyo\". Sebuah nostalgia untuk salah satu rilis distro Linux kebanggaan Indonesia!) Proyek BlankOn dengan bangga mempersembahkan rilis ke-9 dengan nama kode Suroboyo. Rilis kali ini dengan dukungan perangkat keras lebih banyak dan terbaru sehingga pengguna tidak perlu repot memasang penggerak (driver) untuk perangkat kerasnya. Rilis ini juga terdapat penambahan fitur serta aplikasi baru di dalamnya dengan harapan para pengguna bisa lebih mudah dalam menggunakannya. Manokwari Manokwari adalah destop yang dikembangkan oleh pengembang BlankOn dengan teknologi HTML5 dan CSS3. Hal ini membuat destop manokwari menjadi destop cantik, modern, ringan dan mudah untuk dimodifikasi. Inilah dia, desktop Manokwari yang modern dan ringan. Destop Kontekstual Destop dinamis yang sesuai dengan perubahan waktu menjadikan tampilan BlankOn Suroboyo lebih segar dan tidak membosankan. Tampilan desktop yang berubah sesuai waktu. Aplikasi Perkantoran Terbaru BlankOn sudah menyediakan aplikasi perkantoran terbaru yang lengkap dan handal, mendukung berbagai format berkas perkantoran populer. Mempunyai format dokumen terbuka yang dengan ukuran berkas jauh lebih kecil serta lebih aman sesuai standar dokumen nasional maupun internasional. Aplikasi perkantoran (LibreOffice) sudah tersedia lengkap. Dukungan Multimedia Anda bisa segera memainkan musik, memutar video dan berkas multimedia sesaat setelah BlankOn terpasang tanpa harus memasang aplikasi lanjutan. Semua sudah tersedia. Pemutar musik dan video, langsung siap pakai! Aplikasi Grafis BlankOn hadir dengan aplikasi bawaan yang mendukung pengolahan grafis, mulai dengan membuka gambar(gthumb), editor gambar berbasis bitmap (gimp) hingga editor grafis berbasis vektor (inkscape). Anda akan dengan mudah membuat logo ataupun membuat desain undangan pernikahan keluarga atau rekan. Warung Aplikasi - Warsi Ingin memasang aplikasi di BlankOn? Kini lebih cepat, mudah dan lengkap dengan menggunakan Warung Aplikasi (Warsi) Warsi, pusat aplikasi untuk BlankOn. Geo.BlankOn geo.BlankOn adalah merupakan kegiatan gotong royong digital untuk mengembangkan gugus perangkat lunak dan data geospasial yang dibuat untuk mendukung beragam platform komputer. Dalam pengembangannya, aplikasi ini bisa menyediakan berbagai macam data berbasis lokasi seperti titik wisata, titik pelayanan publik, titik banjir, titik kemacetan di jalan raya serta informasi publik lainnya. Informasi lebih lanjut geo.blankon.in Geo.BlankOn untuk pemetaan dan data geospasial. Maleo Maleo membuat BlankOn bisa menjalankan aplikasi berbasis HTML5 di destop. Maleo juga bisa digunakan untuk mengembangkan aplikasi-aplikasi berbasis HTML5 agar bisa berjalan baik di destop maupun di perangkat bergerak. Maleo, untuk menjalankan aplikasi HTML5 di desktop. Unduh BlankOn Rilis BlankOn versi terakhir saat ini adalah BlankOn 9.0 Suroboyo. Konfigurasi perangkat keras minimal untuk dapat menjalankan BlankOn 9.0 Suroboyo dengan nyaman adalah: CPU 1 GHz, tersedia dalam i386 dan amd64 RAM 1 GB Ruang hard disk 15 GB VGA 256 MB Bila Anda lebih banyak melakukan kegiatan meramban web dan aplikasi perkantoran yang intensif, lebih baik lagi untuk meningkatkan perangkat keras Anda. Cermin (Mirror) Unduhan Anda juga dapat mengunduh BlankOn pada cermin-cermin berikut: buaya.klas.or.id/iso/blankon/rilis/ dl2.foss-id.web.id/iso/blankon/rilis/ kambing.ui.ac.id/iso/blankon/rilis/ mirror.unej.ac.id/iso/blankon/rilis/ repo.ugm.ac.id/iso/blankon/rilis/",
  "meta": {
    "summary": "Arsip rilis BlankOn 9.0 Suroboyo, distro Linux Indonesia dengan desktop Manokwari (HTML5), Warsi, Geo.BlankOn, dan fitur-fitur keren lainnya.",
    "prompt_hint": "Arsip rilis BlankOn 9.0 Suroboyo, distro Linux Indonesia dengan desktop Manokwari (HTML5), Warsi, Geo.BlankOn, dan fitur-fitur keren lainnya.",
    "keywords": [],
    "topics": []
  }
}