{
  "id": "branches-di-github",
  "slug": "branches-di-github",
  "title": "Branches di GitHub — Penjelasan Santai, Lengkap, dan Praktis",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-05-01T23:20:38.175+00:00",
  "url": "https://dalam.web.id/artikel/branches-di-github.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJgagKhVJjhVG-p99nyUUn-lSLqSNgjtVJZCQhKUAZRCOCZmRco0VhftpQKeBT_O08in5iw-EQICCvp5oBu8-8-iPQf_om9Qluf3VcdlLdexS_gn9ATl9anRzd58Xp6RWP6vLHGofKCo76K0FtyhGK8Aiw1Ng7KCc74SLcDDdAfFwik7vuRfpv1ZN4YIo/s1600/SHGShgSH.png",
  "content": {
    "text": "Branches di GitHub: Penjelasan Santai, Lengkap, dan Praktis Branch (cabang) adalah jalur pengembangan terpisah di dalam sebuah repositori Git. Ibaratnya, Anda punya pohon kode: batang utamanya adalah branch `main`, dan Anda bisa membuat cabang baru untuk mengerjakan fitur atau memperbaiki bug tanpa mengganggu batang utama. Fungsi dan Manfaat Branch Isolasi Pekerjaan: Anda bisa mengerjakan fitur baru tanpa merusak kode utama yang stabil. Kolaborasi Aman: Setiap developer bisa bekerja di branch masing-masing, lalu menggabungkannya melalui Pull Request. Eksperimen Bebas Risiko: Jika sebuah ide gagal, Anda cukup menghapus branch tersebut tanpa ada dampak ke kode utama. Alur Kerja Umum Buat branch baru dari `main`: git checkout -b fitur-loginSalin Kerjakan perubahan di branch tersebut, lalu commit pekerjaan Anda. Push branch baru ke GitHub: git push -u origin fitur-loginSalin Buat Pull Request di GitHub untuk menggabungkan perubahan Anda ke `main`. Analogi Sederhana Bayangkan Anda sedang menulis buku 📖. Branch `main` adalah naskah utama yang sudah rapi dan siap cetak. Setiap `branch` baru adalah draf alternatif untuk menambahkan bab baru atau merevisi paragraf. Jika draf itu bagus, Anda gabungkan ke naskah utama. Jika tidak, Anda bisa membuangnya tanpa merusak naskah yang sudah ada."
  },
  "meta": {
    "summary": "Penjelasan santai dan lengkap tentang Branches di GitHub: konsep, fungsi, alur kerja, analogi, serta praktik terbaik.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Penjelasan santai dan lengkap tentang Branches di GitHub: konsep, fungsi, alur kerja, analogi, serta praktik terbaik."
  }
}