{
  "id": "broadcom-wireless-fedora",
  "slug": "broadcom-wireless-fedora",
  "title": "Solusi Broadcom Wireless di Fedora",
  "category": "ðŸ§ Linux & Open Source",
  "published_at": "2025-05-01T23:20:38.176+00:00",
  "url": "https://dalam.web.id/artikel/broadcom-wireless-fedora.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj_2V202CIKxIMvkPVWaUWTje6nvsynBctApvHIPFRRGcozz25Y2SwLnu8DwgVZ3w255aEJPi27xzg43WbMDA7TxKRNqHF0s0oQo3RAWGm2R5ek8nY24JqPyP2Yom0yEKjhxiUPF_8C2kW-/s320/broadcom.gif",
  "content": {
    "text": "Solusi Broadcom Wireless di Fedora Setelah melakukan pembaruan kernel di Fedora, beberapa perangkat wireless Broadcom mungkin berhenti berfungsi. Hal ini biasanya terjadi karena konflik antara modul kernel `bcma` bawaan dengan driver Broadcom yang sebenarnya dibutuhkan. Untungnya, solusinya sangat mudah dan hanya memerlukan satu baris perintah di terminal. Langkah Perbaikan Buka terminal, lalu masuk sebagai root (misalnya dengan perintah sudo -i). Setelah itu, salin dan jalankan perintah di bawah ini untuk memasukkan modul `bcma` ke dalam daftar hitam (blacklist), sehingga tidak akan dimuat saat boot. echo \"blacklist bcma\" >> /etc/modprobe.d/broadcom-wl-blacklist.confSalin Setelah menjalankan perintah tersebut, reboot komputer Anda. Perangkat wireless Broadcom Anda seharusnya sudah dapat berfungsi kembali dengan normal.",
    "html": "<h1>Solusi Broadcom Wireless di Fedora</h1>\n\n                    <p class=\"lead\">Setelah melakukan pembaruan kernel di Fedora, beberapa perangkat wireless Broadcom mungkin berhenti berfungsi. Hal ini biasanya terjadi karena konflik antara modul kernel `bcma` bawaan dengan driver Broadcom yang sebenarnya dibutuhkan.</p>\n                    <p>Untungnya, solusinya sangat mudah dan hanya memerlukan satu baris perintah di terminal.</p>\n                    <figure>\n                        <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj_2V202CIKxIMvkPVWaUWTje6nvsynBctApvHIPFRRGcozz25Y2SwLnu8DwgVZ3w255aEJPi27xzg43WbMDA7TxKRNqHF0s0oQo3RAWGm2R5ek8nY24JqPyP2Yom0yEKjhxiUPF_8C2kW-/s320/broadcom.gif\" alt=\"Logo Broadcom Wireless\">\n                    </figure>\n                    <h2>Langkah Perbaikan</h2>\n                    <p>Buka terminal, lalu masuk sebagai <strong>root</strong> (misalnya dengan perintah <code>sudo -i</code>). Setelah itu, salin dan jalankan perintah di bawah ini untuk memasukkan modul `bcma` ke dalam daftar hitam (blacklist), sehingga tidak akan dimuat saat boot.</p>\n                    <pre><code id=\"code1\">echo \"blacklist bcma\" &gt;&gt; /etc/modprobe.d/broadcom-wl-blacklist.conf</code><button class=\"copy-btn\" data-target=\"code1\">Salin</button></pre>\n                    <p>Setelah menjalankan perintah tersebut, <strong>reboot</strong> komputer Anda. Perangkat wireless Broadcom Anda seharusnya sudah dapat berfungsi kembali dengan normal.</p>"
  },
  "meta": {
    "summary": "Panduan memperbaiki Broadcom Wireless di Fedora setelah update kernel. Tutorial lengkap dengan snippet perintah, mudah diikuti oleh pemula.",
    "prompt_hint": "Panduan memperbaiki Broadcom Wireless di Fedora setelah update kernel. Tutorial lengkap dengan snippet perintah, mudah diikuti oleh pemula.",
    "keywords": [],
    "topics": []
  }
}