{
  "id": "bumbu-pecel-kacang",
  "slug": "bumbu-pecel-kacang",
  "title": "Bumbu Pecel Kacang - Pengertian, Bahan & Cara Membuat",
  "category": "🍜 Kuliner, Gaya Hidup & Kesehatan",
  "published_at": "2025-02-26T00:31:19.932+00:00",
  "url": "https://dalam.web.id/artikel/bumbu-pecel-kacang.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhqBhQtbv1A3W1wzkw3pOE15P8XKWMq_niShyphenhyphenwy687lsd-Jt0glqJLpRCKJVtClGC586Sli2ywjLVmQI03MHuuTfvB2LWSqondit9OD75fkj1A0WPscGDDKSM122IeEzOca5BhKFaPLz72Xi3RqKRtBl4kY4NnmqTOb1kcktCkA7euB9UbJbeavXDtXhm8/s1600/Pecel_Hariadhi.webp",
  "content": {
    "text": "Apa itu Bumbu Pecel Kacang? Bumbu pecel kacang adalah saus berbasis kacang tanah yang ditumbuk atau dihaluskan, dicampur dengan bumbu lain seperti cabai, bawang putih, gula merah, garam, dan air asam. Biasanya digunakan untuk menyajikan sayuran rebus sebagai hidangan pecel yang terkenal di berbagai daerah di Indonesia (Jawa Timur, Jawa Tengah, Yogyakarta). Bahan-bahan (untuk ±4 porsi) 200 gram kacang tanah, sangrai 5–8 buah cabai rawit (sesuaikan tingkat pedas) 3 siung bawang putih 2 sdm gula merah (serut) 1 sdt garam 2–3 sdm air asam jawa Opsional: 1 sdt terasi bakar Cara Membuat Sangrai kacang tanah hingga harum, lalu cincang atau haluskan menggunakan cobek/blender (jangan terlalu halus jika ingin tekstur). Tumis sebentar bawang putih dan cabai jika ingin rasa lebih matang; atau haluskan mentah untuk rasa segar. Campurkan kacang yang dihaluskan dengan gula merah, garam, air asam jawa, dan terasi. Tambahkan sedikit air hangat hingga mencapai kekentalan yang diinginkan. Rasakan dan sesuaikan: tambahkan garam, gula atau asam sesuai selera. Sajikan bersama sayuran rebus seperti taoge, kacang panjang, kangkung, dan kentang. Tips & Variasi Untuk pecel lebih wangi, sangrai kacang sedikit lebih lama hingga kecokelatan tapi jangan gosong. Tambahkan irisan jeruk nipis saat menyajikan untuk sentuhan segar. Gunakan kacang goreng tanpa kulit untuk rasa lebih halus. Tanya Jawab Seputar Pecel"
  },
  "meta": {
    "summary": "Bumbu pecel kacang: resep, bahan, cara membuat dan tips menyajikan pecel yang enak. Panduan praktis dalam bahasa Indonesia.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Bumbu pecel kacang: resep, bahan, cara membuat dan tips menyajikan pecel yang enak. Panduan praktis dalam bahasa Indonesia."
  }
}