{
  "id": "cachyos-paru-upgrade-cepat",
  "slug": "cachyos-paru-upgrade-cepat",
  "title": "Mempercepat Upgrade PARU di CachyOS dengan Mirror Terdekat",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-08-17T06:06:53.230+00:00",
  "url": "https://dalam.web.id/artikel/cachyos-paru-upgrade-cepat.html",
  "image": "https://dalam.web.id/img/cachyos-paru-upgrade-cepat.webp",
  "content": {
    "text": "Betul sekali! Kecepatan proses upgrade Paru (`paru -Syu`) di CachyOS itu sangat bisa dipercepat, dan kunci utamanya adalah memilih repository (mirror) yang terdekat dari lokasi Anda. Karena Paru menggunakan Pacman untuk repositori resminya, Pacman-lah yang harus kita optimalkan. Kenapa Upgrade Paru Terkadang Lambat? Proses upgrade Paru melibatkan dua tahapan yang berbeda kecepatannya: Pacman (Repositori Resmi): Ini adalah bagian yang paling terpengaruh oleh jarak. Jika sistem Anda menggunakan mirror di Amerika atau Eropa, paket harus menempuh jarak yang jauh, menyebabkan latensi (keterlambatan respons) dan kecepatan unduh yang rendah. AUR (Kompilasi Paru): Kecepatan di tahap ini lebih bergantung pada kekuatan CPU Anda, karena paket dari AUR (Arch User Repository) perlu diunduh, di-compile, dan dipasang secara lokal. Fokus kita untuk mempercepat unduhan paket adalah di bagian Pacman, dengan merapikan daftar Mirrorlist. 1. Optimasi Mirrorlist dengan Reflector Ini adalah jurus pamungkas untuk memastikan CachyOS (Pacman) selalu mengambil paket dari server tercepat yang ada di dekat Anda. Kita akan menggunakan tool keren bernama Reflector untuk mencari, mengurutkan, dan menyimpan daftar mirror terbaik. A. Pastikan Reflector Sudah Terinstal # Instal Reflector jika belum ada di sistem Andasudo pacman -S reflector B. Jalankan Reflector untuk Mengurutkan Mirror Perintah ini akan mencari 5 mirror terbaru dari Indonesia (atau negara terdekat lainnya), mengurutkannya berdasarkan kecepatan unduh (rate), dan menulis hasilnya langsung ke file konfigurasi Pacman. # Ganti /etc/pacman.d/mirrorlist dengan mirror Indonesia tercepatsudo reflector --verbose --latest 5 --sort rate --country Indonesia --save /etc/pacman.d/mirrorlist Tips Santai: Jika Anda merasa server luar negeri (misalnya Singapura/SG) lebih cepat, Anda bisa mencoba menambahkan negara tersebut: sudo reflector --verbose --latest 5 --sort rate --country Indonesia,Singapore --save /etc/pacman.d/mirrorlist C. Sinkronisasi Ulang Pacman Setelah file mirrorlist diubah, Anda harus memaksa Pacman untuk membaca dan menggunakan daftar server yang baru: sudo pacman -Syy 2. Optimasi Paralel Download di Pacman Secara bawaan, Pacman hanya mengunduh satu paket dalam satu waktu. Kita bisa mengubahnya agar dapat mengunduh banyak paket secara bersamaan, sehingga total waktu *upgrade* terpangkas. A. Edit File Konfigurasi Pacman Buka file konfigurasi utama Pacman: sudo nano /etc/pacman.conf B. Aktifkan Max Parallel Downloads Cari baris yang ada tulisan #MaxParallelDownloads. Hapus tanda pagar (#) di depannya dan set nilainya, misalnya, 8: # Di bagian [options], cari dan ubah menjadi:MaxParallelDownloads = 8 Angka 8 adalah nilai yang cukup aman untuk koneksi internet rumahan yang baik. Simpan dan tutup file. 3. Maksimalkan CPU untuk Kompilasi AUR Jika proses terasa lambat saat Paru sedang di tahap \"Building\" (kompilasi), artinya CPU Anda sedang bekerja. Kita bisa memintanya bekerja lebih keras dengan memanfaatkan semua *core* yang tersedia. A. Edit File Konfigurasi makepkg Perintah ini mengontrol bagaimana paket AUR dikompilasi: sudo nano /etc/makepkg.conf B. Aktifkan Semua Core CPU Cari baris yang dimulai dengan #MAKEFLAGS. Ubah baris tersebut menjadi: # Ubah baris ini menjadi:MAKEFLAGS=\"-j$(nproc)\" Fungsi $(nproc) secara otomatis mendeteksi jumlah *thread* CPU Anda dan menggunakannya untuk kompilasi. Ini bisa mempercepat proses kompilasi AUR secara signifikan!",
    "html": "<p>\n                Betul sekali! Kecepatan proses upgrade Paru (`paru -Syu`) di CachyOS itu sangat bisa dipercepat, dan kunci utamanya adalah memilih <b>repository (mirror) yang terdekat</b> dari lokasi Anda. Karena Paru menggunakan Pacman untuk repositori resminya, Pacman-lah yang harus kita optimalkan.\n            </p>\n            <section>\n                <h2><i class=\"fas fa-cogs\"></i> Kenapa Upgrade Paru Terkadang Lambat?</h2>\n                <p>\n                    Proses upgrade Paru melibatkan dua tahapan yang berbeda kecepatannya:\n                    </p><ol>\n                        <li><b>Pacman (Repositori Resmi):</b> Ini adalah bagian yang paling terpengaruh oleh jarak. Jika sistem Anda menggunakan mirror di Amerika atau Eropa, paket harus menempuh jarak yang jauh, menyebabkan <b>latensi</b> (keterlambatan respons) dan kecepatan unduh yang rendah.</li>\n                        <li><b>AUR (Kompilasi Paru):</b> Kecepatan di tahap ini lebih bergantung pada kekuatan <b>CPU</b> Anda, karena paket dari AUR (Arch User Repository) perlu diunduh, di-<code>compile</code>, dan dipasang secara lokal.</li>\n                    </ol>\n                <p></p>\n                <p>\n                    Fokus kita untuk mempercepat unduhan paket adalah di bagian Pacman, dengan merapikan daftar <b>Mirrorlist</b>.\n                </p>\n            </section>\n\n            <hr>\n\n            <section>\n                <h2><i class=\"fas fa-location-arrow\"></i> 1. Optimasi Mirrorlist dengan Reflector</h2>\n                <p>\n                    Ini adalah jurus pamungkas untuk memastikan CachyOS (Pacman) selalu mengambil paket dari server tercepat yang ada di dekat Anda. Kita akan menggunakan <code>tool</code> keren bernama <b>Reflector</b> untuk mencari, mengurutkan, dan menyimpan daftar <code>mirror</code> terbaik.\n                </p>\n                <h3>A. Pastikan Reflector Sudah Terinstal</h3>\n                <pre><code># Instal Reflector jika belum ada di sistem Andasudo pacman -S reflector</code></pre>\n\n                <h3>B. Jalankan Reflector untuk Mengurutkan Mirror</h3>\n                <p>\n                    Perintah ini akan mencari 5 <code>mirror</code> terbaru dari Indonesia (atau negara terdekat lainnya), mengurutkannya berdasarkan kecepatan unduh (rate), dan menulis hasilnya langsung ke file konfigurasi Pacman.\n                </p>\n                <pre><code># Ganti /etc/pacman.d/mirrorlist dengan mirror Indonesia tercepatsudo reflector --verbose --latest 5 --sort rate --country Indonesia --save /etc/pacman.d/mirrorlist</code></pre>\n                <p>\n                    <b>Tips Santai:</b> Jika Anda merasa server luar negeri (misalnya Singapura/SG) lebih cepat, Anda bisa mencoba menambahkan negara tersebut:\n                    </p><pre><code>sudo reflector --verbose --latest 5 --sort rate --country Indonesia,Singapore --save /etc/pacman.d/mirrorlist</code></pre>\n                <p></p>\n\n                <h3>C. Sinkronisasi Ulang Pacman</h3>\n                <p>Setelah file mirrorlist diubah, Anda harus memaksa Pacman untuk membaca dan menggunakan daftar server yang baru:</p>\n                <pre><code>sudo pacman -Syy</code></pre>\n            </section>\n\n            <hr>\n\n            <section>\n                <h2><i class=\"fas fa-tasks\"></i> 2. Optimasi Paralel Download di Pacman</h2>\n                <p>\n                    Secara bawaan, Pacman hanya mengunduh satu paket dalam satu waktu. Kita bisa mengubahnya agar dapat mengunduh banyak paket secara bersamaan, sehingga total waktu *upgrade* terpangkas.\n                </p>\n\n                <h3>A. Edit File Konfigurasi Pacman</h3>\n                <p>Buka file konfigurasi utama Pacman:</p>\n                <pre><code>sudo nano /etc/pacman.conf</code></pre>\n\n                <h3>B. Aktifkan Max Parallel Downloads</h3>\n                <p>Cari baris yang ada tulisan <code>#MaxParallelDownloads</code>. Hapus tanda pagar (<code>#</code>) di depannya dan set nilainya, misalnya, 8:</p>\n                <pre><code># Di bagian [options], cari dan ubah menjadi:MaxParallelDownloads = 8</code></pre>\n                <p>Angka 8 adalah nilai yang cukup aman untuk koneksi internet rumahan yang baik. Simpan dan tutup file.</p>\n            </section>\n\n            <hr>\n\n            <section>\n                <h2><i class=\"fas fa-microchip\"></i> 3. Maksimalkan CPU untuk Kompilasi AUR</h2>\n                <p>\n                    Jika proses terasa lambat saat Paru sedang di tahap \"Building\" (kompilasi), artinya CPU Anda sedang bekerja. Kita bisa memintanya bekerja lebih keras dengan memanfaatkan semua *core* yang tersedia.\n                </p>\n\n                <h3>A. Edit File Konfigurasi makepkg</h3>\n                <p>Perintah ini mengontrol bagaimana paket AUR dikompilasi:</p>\n                <pre><code>sudo nano /etc/makepkg.conf</code></pre>\n\n                <h3>B. Aktifkan Semua Core CPU</h3>\n                <p>Cari baris yang dimulai dengan <code>#MAKEFLAGS</code>. Ubah baris tersebut menjadi:</p>\n                <pre><code># Ubah baris ini menjadi:MAKEFLAGS=\"-j$(nproc)\"</code></pre>\n                <p>Fungsi <code>$(nproc)</code> secara otomatis mendeteksi jumlah *thread* CPU Anda dan menggunakannya untuk kompilasi. Ini bisa mempercepat proses kompilasi AUR secara signifikan!</p>\n            </section>\n\n            <section>\n            </section>"
  },
  "meta": {
    "summary": "Panduan lengkap dan santai cara mempercepat proses update dan upgrade PARU/Pacman di CachyOS dengan memilih mirror tercepat menggunakan reflector dan optimasi konfigurasi.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Panduan lengkap dan santai cara mempercepat proses update dan upgrade PARU/Pacman di CachyOS dengan memilih mirror tercepat menggunakan reflector dan optimasi konfigurasi."
  }
}