{
  "id": "cara-autostart-skrip-di-ubuntu",
  "slug": "cara-autostart-skrip-di-ubuntu",
  "title": "Cara Autostart Skrip di Ubuntu",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-10-05T23:28:00.000+00:00",
  "url": "https://dalam.web.id/artikel/cara-autostart-skrip-di-ubuntu.html",
  "image": "https://dalam.web.id/img/cara-autostart-skrip-di-ubuntu.webp",
  "content": {
    "text": "Narasi asli, santai, dan lengkap Pengen skrip kamu otomatis jalan setiap kali login ke Ubuntu? Bisa banget. Walau GUI Startup Applications di Ubuntu 25.10 sudah dihapus, kemampuan autostart tetap ada dan fleksibel. Caranya: pakai file .desktop di folder ~/.config/autostart/. Format .desktop ini dibaca oleh GNOME saat sesi dimulai. Kamu bisa jalankan apa saja: skrip shell, Python, aplikasi GUI dengan argumen, atau daemon ringan. Di bawah ini ada contoh, tips, dan langkah-langkah yang bikin semuanya mulus. Langkah cepat autostart skrip Buat atau pilih skrip Pastikan skrip kamu bisa dieksekusi: chmod +x ~/scripts/startup.sh Buat file .desktop Simpan di ~/.config/autostart/ dengan nama bebas, misalnya jalankan-skrip.desktop. Isi kontennya Lihat contoh di bawah. Login ulang atau Restart GNOME Shell supaya efeknya terlihat. Contoh file .desktop untuk skrip [Desktop Entry] Type=Application Version=1.0 Name=Jalankan Skrip Login Comment=Menjalankan skrip kustom saat masuk Exec=/home/<user>/scripts/startup.sh --verbose StartupNotify=false Terminal=false X-GNOME-Autostart-enabled=true Tips penting: pakai path absolut, berikan izin eksekusi ke skrip, dan kalau butuh delay tambahkan sleep di dalam skrip atau bungkus dengan bash -lc. Butuh argumen? Tinggal tambahkan di akhir Exec, misalnya: Exec=/usr/local/bin/netwatch --ping google.com --interval 30. Kalau mau tampilkan output di terminal, set Terminal=true. Contoh variasi lainnya Kebutuhan Contoh Exec Keterangan Delay sebelum jalan bash -lc \"sleep 10 && /path/to/script.sh\" Memberi jeda 10 detik sebelum eksekusi Profil aplikasi firefox --profile \"/home/user/.mozilla/firefox/dev-profile\" Menjalankan aplikasi GUI dengan profil khusus Environment khusus bash -lc \"source ~/.profile && /path/to/app\" Memastikan variabel lingkungan ter-load Daemon ringan /usr/local/bin/netwatch --quiet Menjalankan proses latar tanpa jendela Generator cepat (opsional) Kalau mau bikin file .desktop tanpa pusing format, pakai generator di bawah ini lalu salin hasilnya ke ~/.config/autostart/. Nama Aplikasi Jaga Data Pribadi Tetap Aman. (opsional) Perintah / Path Skrip Jalankan di Terminal? Tidak Ya Autostart Aktif? Ya Tidak 🔧 Buat File .desktop"
  },
  "meta": {
    "summary": "Panduan lengkap dan santai: cara menjalankan skrip otomatis saat login di Ubuntu. Gunakan .desktop di ~/.config/autostart, contoh lengkap, tips delay, environment, dan troubleshooting.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Panduan lengkap dan santai: cara menjalankan skrip otomatis saat login di Ubuntu. Gunakan .desktop di ~/.config/autostart, contoh lengkap, tips delay, environment, dan troubleshooting."
  }
}