{
  "id": "cara-aktifkan-branch-protection",
  "slug": "cara-aktifkan-branch-protection",
  "title": "Cara Mengaktifkan Branch Protection di GitHub",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-05-01T23:20:38.177+00:00",
  "url": "https://dalam.web.id/artikel/cara-aktifkan-branch-protection.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiQ370qCptJsD7-fxr6zLl_xT9VpZhvoN8Z-thmLcNfCK-s2VIhdivD7hcTYRVGZwGJPXwkwDGn-1t9OucGSDFdHYUVPI2T7jcEoLwBPjNcvFwl3MURH3N_5ln473zIFTzfLESXX9lDsmxQ7UCrAIUyupi6RVFBGEzwFf8ylVV6s4OaxLqNYhHyYb_w6uk/s1600/maxresdefault.jpg",
  "content": {
    "text": "Cara Mengaktifkan Branch Protection di GitHub Panduan ini akan menunjukkan cara mengaktifkan branch protection di GitHub. Fitur ini sangat penting untuk memastikan semua perubahan pada branch utama (seperti main atau master) melalui proses review via Pull Request (PR). 1. Masuk ke Pengaturan Repositori Buka repositori Anda di GitHub, lalu klik tab Settings. 2. Pilih Menu Branches Di menu navigasi sebelah kiri, pilih Branches. Kemudian, klik tombol Add branch protection rule. 3. Tentukan Branch yang Akan Dilindungi Pada kolom Branch name pattern, ketik nama branch yang ingin Anda lindungi, misalnya main. Anda juga bisa menggunakan wildcard seperti release/* untuk melindungi semua branch yang diawali dengan \"release/\". 4. Aktifkan Aturan Proteksi Centang opsi-opsi yang Anda butuhkan. Beberapa yang paling umum adalah: Require a pull request before merging: Ini adalah aturan inti. Semua perubahan wajib melalui PR. Require status checks to pass before merging: Berguna jika Anda memiliki workflow CI/CD. PR tidak bisa di-merge jika ada tes yang gagal. Include administrators: Menerapkan aturan ini bahkan untuk admin repositori. 5. Simpan Aturan Klik tombol Create atau Save changes di bagian bawah halaman. Setelah ini, setiap upaya untuk melakukan `push` langsung ke branch `main` akan diblokir, dan semua perubahan harus diajukan melalui Pull Request.",
    "html": "<h1>Cara Mengaktifkan Branch Protection di GitHub</h1>\n\n                    <p class=\"lead\">Panduan ini akan menunjukkan cara mengaktifkan <strong>branch protection</strong> di GitHub. Fitur ini sangat penting untuk memastikan semua perubahan pada branch utama (seperti <code>main</code> atau <code>master</code>) melalui proses review via <strong>Pull Request (PR)</strong>.</p>\n                    <h2>1. Masuk ke Pengaturan Repositori</h2>\n                    <p>Buka repositori Anda di GitHub, lalu klik tab <strong>Settings</strong>.</p>\n                    <figure><img src=\"https://dalam.web.id/artikel/repo-settings-tab.png\" alt=\"Akses Settings\"></figure>\n                    <h2>2. Pilih Menu Branches</h2>\n                    <p>Di menu navigasi sebelah kiri, pilih <strong>Branches</strong>. Kemudian, klik tombol <strong>Add branch protection rule</strong>.</p>\n                    <figure><img src=\"https://dalam.web.id/artikel/repo-settings-branches.png\" alt=\"Menu Branches\"></figure>\n                    <h2>3. Tentukan Branch yang Akan Dilindungi</h2>\n                    <p>Pada kolom <code>Branch name pattern</code>, ketik nama branch yang ingin Anda lindungi, misalnya <code>main</code>. Anda juga bisa menggunakan wildcard seperti <code>release/*</code> untuk melindungi semua branch yang diawali dengan \"release/\".</p>\n                    <h2>4. Aktifkan Aturan Proteksi</h2>\n                    <p>Centang opsi-opsi yang Anda butuhkan. Beberapa yang paling umum adalah:</p>\n                    <ul>\n                        <li><strong>Require a pull request before merging:</strong> Ini adalah aturan inti. Semua perubahan wajib melalui PR.</li>\n                        <li><strong>Require status checks to pass before merging:</strong> Berguna jika Anda memiliki workflow CI/CD. PR tidak bisa di-merge jika ada tes yang gagal.</li>\n                        <li><strong>Include administrators:</strong> Menerapkan aturan ini bahkan untuk admin repositori.</li>\n                    </ul>\n                    <figure><img src=\"https://dalam.web.id/artikel/repo-settings-branches-pr-rule.png\" alt=\"Aktifkan aturan Pull Request\"></figure>\n                    <h2>5. Simpan Aturan</h2>\n                    <p>Klik tombol <strong>Create</strong> atau <strong>Save changes</strong> di bagian bawah halaman. Setelah ini, setiap upaya untuk melakukan `push` langsung ke branch `main` akan diblokir, dan semua perubahan harus diajukan melalui Pull Request.</p>"
  },
  "meta": {
    "summary": "Panduan lengkap cara mengaktifkan branch protection di GitHub agar semua perubahan wajib melalui Pull Request (PR) dan tidak bisa langsung di-push ke branch utama.",
    "prompt_hint": "Panduan lengkap cara mengaktifkan branch protection di GitHub agar semua perubahan wajib melalui Pull Request (PR) dan tidak bisa langsung di-push ke branch utama.",
    "keywords": [],
    "topics": []
  }
}