{
  "id": "Cara-Memotong-Gambar-dengan-ImageMagick",
  "slug": "Cara-Memotong-Gambar-dengan-ImageMagick",
  "title": "Cara Memotong Gambar dengan ImageMagick di Command Line ✂️",
  "category": "📸 Multimedia & Editing",
  "published_at": "2025-07-16T03:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/Cara-Memotong-Gambar-dengan-ImageMagick.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhNbvbpS1z6xOAxFh2AGopParJoSDH2ey4e28C8gsynCbDO9Uq4WbGF31m-iCr-ugNPIQ5lpapr_Y5n1r1r_4BJh83Oj0_rcp-f_OtSEwDBOhdUDvV-EWCfUlSkAsLNfEXANm7dqluL4D_Vj8e7p2G3JI6frVuGb7XwQXhZZ8uyJAmD9H83vb6rbjgBE-0/s1600/pemandangan.jpg",
  "content": "Memotong Gambar dengan ImageMagick Artikel ini menjelaskan langkah-langkah untuk memotong gambar secara horizontal dan vertikal menggunakan ImageMagick dengan bahasa yang sederhana. ImageMagick adalah perangkat lunak open-source yang mudah digunakan untuk membuat, mengedit, dan mengubah gambar melalui baris perintah (command line). Artikel ini akan memandu Anda cara memotong (crop) gambar menjadi beberapa bagian, baik secara horizontal maupun vertikal, sangat efisien untuk tugas otomatisasi. 1. Memotong Gambar Secara Horizontal (Atas & Bawah) Misalkan kita ingin memotong sebuah gambar menjadi dua bagian yang sama besar dari atas ke bawah. Kita akan membaginya menjadi 50% bagian atas dan 50% bagian bawah. Gambar Asli: pemandangan.jpg Gunakan perintah berikut di terminal Anda: convert pemandangan.jpg -crop 100%x50% +repage hasil_horizontal_%d.jpg atau magick pemandangan.jpg -crop 100%x50% +repage hasil_horizontal_%d.jpg Penjelasan Perintah: convert: Perintah utama dari ImageMagick. pemandangan.jpg: Nama file gambar yang ingin Anda potong. -crop 100%x50%: Memotong lebar penuh dan setengah tinggi. +repage: Menghapus informasi kanvas virtual agar hasil pas. hasil_horizontal_%d.jpg: Output otomatis bernomor. Hasil Potongan Horizontal: hasil_horizontal_0.jpg (Bagian Atas) hasil_horizontal_1.jpg (Bagian Bawah) 2. Memotong Gambar Secara Vertikal (Kiri & Kanan) Sekarang, bagaimana jika kita ingin memotong gambar menjadi dua bagian dari kiri ke kanan? Kita akan membaginya menjadi 50% bagian kiri dan 50% bagian kanan. Gambar Asli: pemandangan.jpg Gunakan perintah berikut: convert pemandangan.jpg -crop 50%x100% +repage hasil_vertikal_%d.jpg atau magick pemandangan.jpg -crop 50%x100% +repage hasil_vertikal_%d.jpg Penjelasan Perintah: -crop 50%x100%: Memotong setengah lebar dan tinggi penuh. Hasil Potongan Vertikal: hasil_vertikal_0.jpg (Bagian Kiri) hasil_vertikal_1.jpg (Bagian Kanan) Kesimpulan Dengan perintah sederhana, ImageMagick memungkinkan Anda memotong gambar dengan sangat fleksibel. Anda dapat mengubah persentase sesuai kebutuhan, misalnya memotong menjadi tiga atau empat bagian dengan mengubah nilai 50% menjadi 33.3% atau 25%. Selamat mencoba!",
  "meta": {
    "summary": "Panduan langkah demi langkah memotong (crop) gambar secara horizontal dan vertikal menggunakan ImageMagick di command line. Lengkap dengan contoh perintah convert dan visualisasi hasil.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Panduan langkah demi langkah memotong (crop) gambar secara horizontal dan vertikal menggunakan ImageMagick di command line. Lengkap dengan contoh perintah convert dan visualisasi hasil."
  }
}