{
  "id": "du-linux-panduan",
  "slug": "du-linux-panduan",
  "title": "Panduan Lengkap du di Linux: Cek Pemakaian Ruang Disk ðŸ“‚",
  "category": "ðŸ§ Linux & Open Source",
  "published_at": "2025-05-09T23:20:38.179+00:00",
  "url": "https://dalam.web.id/artikel/du-linux-panduan.html",
  "image": "https://upload.wikimedia.org/wikipedia/commons/3/35/Tux.svg",
  "content_plain": "Pernah merasa hardisk tiba-tiba penuh padahal merasa nggak download apa-apa? Di Linux, kita punya teman setia bernama du (Disk Usage) untuk melacak siapa \"pelaku\" utamanya. Halo sobat tech! Kalau kamu sering berkutat di terminal, pasti pernah ngalamin momen panik pas dapet notifikasi \"Disk Space Low\". Berbeda dengan Windows atau Mac yang tinggal klik kanan \"Properties\", di terminal Linux kita harus sedikit lebih elegan pakai perintah du. Tool ini fungsinya sederhana: menghitung berapa besar ruang yang dimakan oleh file atau folder kamu sampai ke akar-akarnya. Opsi Paling Populer yang Wajib Kamu Tahu Jujur aja, kalau cuma ngetik du doang, terminal bakal muntah angka-angka aneh yang susah dibaca (itu hitungannya per block, lho). Biar lebih manusiawi, kita perlu bantuan beberapa opsi sakti ini: -h (Human-readable): Ini opsi paling wajib. Ukuran folder bakal muncul dalam format KB, MB, atau GB. Jauh lebih enak dilihat mata daripada deretan angka jutaan. -s (Summarize): Kalau kamu cuma pengen tahu total ukuran folder \"Foto\" tanpa mau lihat rincian ribuan file di dalamnya, pakai opsi ini. -a (All): Kebalikan dari summarize, ini bakal nampilin ukuran setiap file satu per satu. -c (Total): Menambahkan baris paling bawah yang berisi total keseluruhan dari semua folder yang dicek. Contoh Penggunaan Praktis 1. Cek Ukuran Total Folder Saat Ini Misalnya kamu lagi di dalam folder proyek dan pengen tahu berapa total ukurannya secara keseluruhan: du -sh .SALIN 2. Intip Ukuran Tiap Sub-folder Nah, kalau mau cari tahu folder mana yang paling rakus makan tempat di direktori saat ini, gunakan bintang (asterisk): du -sh *SALIN Tux selalu siap nemenin kamu ngoprek di Balikpapan! Masalah Klasik: Jebakan Hard Link Tahu nggak? Ternyata du itu bisa \"ketipu\". Kalau di sistem file kamu banyak terdapat hard link (satu file yang punya banyak nama/lokasi tapi sebenernya cuma satu data di disk), du standar kemungkinan besar bakal ngitung file itu berkali-kali. Hasilnya? Laporan penggunaan disk jadi bengkak dan nggak akurat. Ini sering terjadi kalau kamu pakai tool backup kayak Rsnapshot atau sistem snapshot lainnya. Solusi Akurat dengan Skrip Perl Biar nggak ketipu sama hard link, kita bisa pakai skrip cerdas yang melacak nomor inode. Skrip ini bakal mastiin kalau satu file fisik cuma dihitung satu kali aja, seberapa banyak pun nama panggilannya di terminal. #!/usr/bin/perl -w # Skrip Cek Disk Akurat - Layar Kosong use strict; my %hash; my $total_blocks = 0; my @todo = @ARGV; push(@todo, '.') unless @todo; foreach my $fn (@todo) { my($inode,$nlinks,$blocks) = (lstat($fn))[1,3,12]; if (-d _) { opendir(DP, $fn) or die $!; push(@todo, map(\"$fn/$_\", grep(!/^\\.\\.?$/, readdir(DP)))); closedir DP; } elsif ($nlinks > 1) { if (!defined($hash{$inode})) { $hash{$inode} = $nlinks - 1; next; } next if --$hash{$inode}; } $total_blocks += $blocks; } print \"Hasil Perhitungan:\\n\"; print \"$total_blocks blocks\\n\"; print int($total_blocks / 2 + .5), \" KB (Estimasi Presisi)\\n\";SALIN Cara pakainya simpel: simpan kodenya jadi cek_disk.pl, kasih izin jalan dengan chmod +x cek_disk.pl, terus tinggal panggil deh di folder yang mau dicek. Hasilnya bakal jauh lebih jujur daripada perasaan mantan! Punya tips terminal Linux lainnya? Atau ada perintah favorit yang sering kamu pakai di Balikpapan?",
  "meta": {
    "summary": "Panduan santai dan interaktif seputar perintah du di Linux. Cek penggunaan disk, tips opsi -h -s -a, dan script untuk menangani hardlink.",
    "prompt_hint": "Panduan santai dan interaktif seputar perintah du di Linux. Cek penggunaan disk, tips opsi -h -s -a, dan script untuk menangani hardlink.",
    "keywords": [],
    "topics": []
  }
}