{
  "id": "editor-artikel-json-pro",
  "slug": "editor-artikel-json-pro",
  "title": "Editor Artikel JSON Pro - Layar Kosong",
  "category": "🔆 Lainnya",
  "published_at": "2025-12-20T15:44:15.366+00:00",
  "url": "https://dalam.web.id/artikel/editor-artikel-json-pro.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgcuCwcUXOGMh1PyxfkJYMHi1Ql7TgTu6cmbaitB3qbAhbpoTvrDe5whfsbou_yn3xomjGodI61vudn5MzW57g9fIwslKs03pIuvuhoXJbDcBkAPoR-17TfohSQlLSbt_pcCITzJLu5SUh-7G1jPn9XkWysfsIRlGongesoYqwsrQaZ4sSAvMIZ5VH-8KA/s1600/editorjson.webp",
  "content": {
    "text": "JSON Checklist Exporter Panduan Penggunaan Editor Editor ini dirancang untuk mengelola database artikel berbasis file .json secara offline/online. Anda bisa mendapatkan nama file, dari entri artikel menggunakan visualisasi yang mudah. Import: Gunakan tombol Load URL atau Buka File Lokal untuk memuat file .json Anda. Export: Setelah selesai mengedit, tekan tombol Simpan *.txt untuk mendapatkan daftar urutan yang berisi nama file dari pilihan yang udah di contreng. Struktur: Script ini mengelola JSON dengan format Object of Arrays, di mana tiap key adalah nama kategori, dan isinya adalah array yang menampung data dari file .json tersebut. Data Artikel: Setiap data diwakili oleh array flat dengan urutan: [Judul, Nama File, Link Gambar, Tanggal Jam, Deskripsi]. Contoh Format JSON yang bisa dibaca oleh halaman ini: { \"🖥️ Teknologi\": [ [ \"Judul Artikel\", \"slug-artikel.html\", \"https://link-gambar.com/foto.webp\", \"2025-12-20T10:00:00+00:00\", \"Ringkasan deskripsi artikel yang akan tampil di halaman depan.\" ] ] } Load URL pakai aja file .json ini https://dalam.web.id/artikel.json atau Buka File Lokal 🌗 Dark / Light Tampilkan Elemen: Gambar Thumbnail Judul Nama File Slug Tanggal Deskripsi Tanggal Terbaru Tanggal Terlama 0 dipilih Batal Memilih Pilih Semua Kategori Simpan *.txt"
  },
  "meta": {
    "summary": "Editor Artikel JSON Pro untuk mengelola, mengedit, mencari, dan mengekspor data artikel berbasis JSON. Dibuat untuk workflow modern, cepat, dan efisien oleh Layar Kosong.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Editor Artikel JSON Pro untuk mengelola, mengedit, mencari, dan mengekspor data artikel berbasis JSON. Dibuat untuk workflow modern, cepat, dan efisien oleh Layar Kosong."
  }
}