{
  "id": "fedora-multimedia",
  "slug": "fedora-multimedia",
  "title": "Memutar Berkas Multimedia di Fedora Linux",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-05-09T23:20:38.180+00:00",
  "url": "https://dalam.web.id/artikel/fedora-multimedia.html",
  "image": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Fedora_logo.svg",
  "content_plain": "Memutar Berkas Multimedia di Fedora Linux Secara default, Fedora tidak menyertakan beberapa codec multimedia karena alasan lisensi. Namun, Anda dapat dengan mudah menambahkan dukungan untuk berbagai format audio dan video dengan beberapa langkah sederhana. Langkah 1: Aktifkan Repositori RPM Fusion Paket-paket multimedia yang kita butuhkan tidak tersedia di repositori resmi Fedora. Oleh karena itu, langkah pertama adalah menambahkan repositori RPM Fusion. sudo dnf install https://download1.rpmfusion.org/free/fedora/rpmfusion-free-release-$(rpm -E %fedora).noarch.rpm https://download1.rpmfusion.org/nonfree/fedora/rpmfusion-nonfree-release-$(rpm -E %fedora).noarch.rpmSalin Langkah 2: Instal Codec Multimedia Setelah RPM Fusion aktif, Anda dapat menginstal grup paket multimedia dan sound-and-video untuk mendapatkan semua codec yang diperlukan. sudo dnf groupupdate multimedia --setop=\"install_weak_deps=False\" --exclude=PackageKit-gstreamer-plugin sudo dnf groupupdate sound-and-videoSalin Jika Anda lebih suka menginstal paket secara individual, Anda dapat menggunakan perintah berikut: sudo dnf install gstreamer1-plugins-{bad-\\*,good-\\*,base} gstreamer1-plugin-openh264 gstreamer1-libav --exclude=gstreamer1-plugins-bad-free-devel sudo dnf install lame\\* --exclude=lame-devel sudo dnf group upgrade --with-optional MultimediaSalin Setelah menyelesaikan langkah-langkah ini dan me-restart aplikasi pemutar media Anda (atau me-reboot sistem), Fedora Anda kini siap untuk memutar berbagai format audio dan video populer.",
  "meta": {
    "summary": "Panduan lengkap memasang codec multimedia di Fedora Linux menggunakan gstreamer dan xine-lib-extras-freeworld agar bisa memutar berbagai format audio dan video.",
    "prompt_hint": "Panduan lengkap memasang codec multimedia di Fedora Linux menggunakan gstreamer dan xine-lib-extras-freeworld agar bisa memutar berbagai format audio dan video.",
    "keywords": [],
    "topics": []
  }
}