{
  "id": "fedora-multimedia-codec",
  "slug": "fedora-multimedia-codec",
  "title": "Fedora: Pasang Codec Tambahan Agar Bisa Bernyanyi",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-05-09T23:20:38.180+00:00",
  "url": "https://dalam.web.id/artikel/fedora-multimedia-codec.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiPSXcp3t_5nMZecJkwm8UQE8sCvOtZZW-JTKRPcuXs4_2j7cAt-ruti-sOPA2AxuX2b-NnH1xcwU6YsnhWrwRbA_kjvWl-gaEePYx4pId4Z3ixc9Ol6TwejVMHWAuHU46jPl4Yup_MePd_/s1600/poweredby.png",
  "content": {
    "text": "Fedora: Pasang Codec Tambahan Agar Bisa Bernyanyi Secara bawaan, Fedora hanya mendukung format media bebas paten seperti OGG. Agar bisa memutar MP3, MP4, MKV, dan lainnya, Anda perlu memasang paket codec tambahan. Tutorial ini adalah catatan lawas untuk Fedora 16 dan 19, menunjukkan betapa mudahnya menambahkan kemampuan multimedia penuh ke sistem Anda hanya dengan beberapa perintah di terminal. Tahapan untuk Fedora 16 Untuk Fedora 16, prosesnya terdiri dari dua langkah utama. 1. Instal Repositori RPM Fusion Pertama, tambahkan repositori RPM Fusion Free dan Non-free yang berisi paket-paket multimedia. sudo yum -y localinstall --nogpgcheck http://download1.rpmfusion.org/nonfree/fedora/rpmfusion-nonfree-release-stable.noarch.rpm http://download1.rpmfusion.org/free/fedora/rpmfusion-free-release-stable.noarch.rpmSalin 2. Instal Paket Multimedia Setelah repositori ditambahkan, instal semua codec yang diperlukan dengan satu perintah. sudo yum -y install gstreamer gstreamer-plugins-good gstreamer-plugins-bad gstreamer-plugins-ugly libdvdread libdvdnav lsdvd libdvdcss ffmpeg ffmpeg-libs gstreamer-ffmpeg libmatroska xvidcore xine-lib xine-lib-extras-freeworld xine-pluginSalin Untuk Fedora 19 dan yang Lebih Baru Untuk Fedora 19 dan versi yang lebih modern, prosesnya jauh lebih ringkas. Setelah menambahkan RPM Fusion, Anda hanya perlu menginstal beberapa grup paket utama. sudo dnf groupupdate multimedia --setop=\"install_weak_deps=False\" --exclude=PackageKit-gstreamer-plugin sudo dnf groupupdate sound-and-videoSalin Setelah selesai, Fedora Anda dijamin sudah bisa \"bernyanyi dan menari\" memainkan berbagai format media! 😉",
    "html": "<h1>Fedora: Pasang Codec Tambahan Agar Bisa Bernyanyi</h1>\n\n                    <p class=\"lead\">Secara bawaan, Fedora hanya mendukung format media bebas paten seperti OGG. Agar bisa memutar MP3, MP4, MKV, dan lainnya, Anda perlu memasang paket codec tambahan.</p>\n                    <div class=\"share-bar\">\n                    </div>\n                    <p>Tutorial ini adalah catatan lawas untuk Fedora 16 dan 19, menunjukkan betapa mudahnya menambahkan kemampuan multimedia penuh ke sistem Anda hanya dengan beberapa perintah di terminal.</p>\n                    <figure>\n                        <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiPSXcp3t_5nMZecJkwm8UQE8sCvOtZZW-JTKRPcuXs4_2j7cAt-ruti-sOPA2AxuX2b-NnH1xcwU6YsnhWrwRbA_kjvWl-gaEePYx4pId4Z3ixc9Ol6TwejVMHWAuHU46jPl4Yup_MePd_/s1600/poweredby.png\" alt=\"Logo Fedora Project\">\n                    </figure>\n                    <h2>Tahapan untuk Fedora 16</h2>\n                    <p>Untuk Fedora 16, prosesnya terdiri dari dua langkah utama.</p>\n                    <h3>1. Instal Repositori RPM Fusion</h3>\n                    <p>Pertama, tambahkan repositori RPM Fusion Free dan Non-free yang berisi paket-paket multimedia.</p>\n                    <pre class=\"language-bash\"><code id=\"code1\">sudo yum -y localinstall --nogpgcheck http://download1.rpmfusion.org/nonfree/fedora/rpmfusion-nonfree-release-stable.noarch.rpm http://download1.rpmfusion.org/free/fedora/rpmfusion-free-release-stable.noarch.rpm</code><button class=\"copy-btn\" data-target=\"code1\">Salin</button></pre>\n                    <h3>2. Instal Paket Multimedia</h3>\n                    <p>Setelah repositori ditambahkan, instal semua codec yang diperlukan dengan satu perintah.</p>\n                    <pre class=\"language-bash\"><code id=\"code2\">sudo yum -y install gstreamer gstreamer-plugins-good gstreamer-plugins-bad gstreamer-plugins-ugly libdvdread libdvdnav lsdvd libdvdcss ffmpeg ffmpeg-libs gstreamer-ffmpeg libmatroska xvidcore xine-lib xine-lib-extras-freeworld xine-plugin</code><button class=\"copy-btn\" data-target=\"code2\">Salin</button></pre>\n                    <h2>Untuk Fedora 19 dan yang Lebih Baru</h2>\n                    <p>Untuk Fedora 19 dan versi yang lebih modern, prosesnya jauh lebih ringkas. Setelah menambahkan RPM Fusion, Anda hanya perlu menginstal beberapa grup paket utama.</p>\n                    <pre class=\"language-bash\"><code id=\"code3\">sudo dnf groupupdate multimedia --setop=\"install_weak_deps=False\" --exclude=PackageKit-gstreamer-plugin\nsudo dnf groupupdate sound-and-video</code><button class=\"copy-btn\" data-target=\"code3\">Salin</button></pre>\n                    <p class=\"muted\">Setelah selesai, Fedora Anda dijamin sudah bisa \"bernyanyi dan menari\" memainkan berbagai format media! 😉</p>"
  },
  "meta": {
    "summary": "Tutorial mudah memasang paket multimedia tambahan untuk Fedora 16 dan Fedora 19 agar bisa memutar MP3, MP4, MKV, dan format lainnya. Tinggal copy-paste!",
    "prompt_hint": "Tutorial mudah memasang paket multimedia tambahan untuk Fedora 16 dan Fedora 19 agar bisa memutar MP3, MP4, MKV, dan format lainnya. Tinggal copy-paste!",
    "keywords": [],
    "topics": []
  }
}