{
  "id": "ffmpeg-rekam-desktop-ffmpeg",
  "slug": "ffmpeg-rekam-desktop-ffmpeg",
  "title": "Screencast Desktop Super Gampang di Linux pakai FFmpeg",
  "category": "📸 Multimedia & Editing",
  "published_at": "2025-04-09T12:38:48.537+00:00",
  "url": "https://dalam.web.id/artikel/ffmpeg-rekam-desktop-ffmpeg.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhinZKoTjXHcKVP_Yktl5T_ulZOHnLuCmIPvoRcGuWMDsCoPoL-aG2swRc4NwR8iOOE4OSQmr_LrU1_0j-aKLu4Yp4hSRZ_VDRZxGe8w04y8pB4yXe_SVQg1REJa9-HEkrK-qpnXkCTH0xn/s1600/Batu-Ampar_003.jpeg",
  "content": {
    "text": "Screencast Desktop Super Gampang di Linux pakai FFmpeg Untuk kamu yang suka ajar, sosialisasi, atau sekadar pamer workflow—rekam layar full dari Terminal. Simpel, ringan, tajam. 📅 21 Sep 2025 • FFmpeg • Linux Kenapa FFmpeg? Banyak aplikasi GUI buat screencast—dvr, gtk-recordmydesktop, idjc, istanbul, wink, xvidcap, dll. Tapi kalau mau yang fleksibel, skrip-able, dan hemat resource, FFmpeg itu senjata utama. Cukup satu perintah, rekam seluruh desktop. Pasang dulu (kalau belum) sudo apt-get update && sudo apt-get install -y ffmpeg Salin Biasanya FFmpeg sudah jadi paket wajib. Tapi kalau lupa, tinggal jalankan perintah di atas. Aman. Mantra rekam layar full ffmpeg -f x11grab -s 1920x1080 -r 25 -i :0.0 -q:v 5 rekaman-desktop.mpg Salin -s 1920x1080 Ganti sesuai resolusi layar kamu (misal 1366x768, 2560x1440). -r 25 Frame rate 25 fps, cukup mulus buat demo; naikkan ke 30 kalau perlu. -q:v 5 Kualitas 1 terbaik–31 terendah; atur biar ukuran file tetap bersahabat. Audio: rekam langsung, atau rekam terpisah? Bisa banget rekam suara bareng, tapi seringnya lebih aman dipisah. Kalau ada momen bersin atau bunyi-bunyi tak terduga, kamu cukup edit audio tanpa ngulang take layar. Rekam layar dulu: jalankan perintah FFmpeg di atas. Rekam suara terpisah: pakai perekam favorit (Audacity, dsb.). Gabungkan di editor: sinkronkan di Kdenlive/Olive/DaVinci. 💡 Kalau mau audio langsung: tambahkan -f pulse -i default (PulseAudio) atau set input ALSA sesuai perangkat kamu. Galeri situasi lapangan Setup screencast (klik untuk perbesar) Cuplikan hasil rekaman ffmpeg-rekam-desktop-ffmpeg.html Referensi How to do Proper Screencasts on Linux Using FFmpeg Live Screencasting using FFmpeg ✕"
  },
  "meta": {
    "summary": "Rekam seluruh aktivitas desktop Linux pakai FFmpeg langsung dari Terminal. Desain satu kolom, lebar, interaktif, mobile-friendly, lengkap metadata SEO, galeri, dan tombol berbagi.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Rekam seluruh aktivitas desktop Linux pakai FFmpeg langsung dari Terminal. Desain satu kolom, lebar, interaktif, mobile-friendly, lengkap metadata SEO, galeri, dan tombol berbagi."
  }
}