{
  "id": "fix-pacman-broken-systemd",
  "slug": "fix-pacman-broken-systemd",
  "title": "âš™ï¸ Memperbaiki Pacman Broken Setelah Menghapus Systemd di Arch Linux",
  "category": "ðŸ§ Linux & Open Source",
  "published_at": "2025-10-13T21:14:36.035+00:00",
  "url": "https://dalam.web.id/artikel/fix-pacman-broken-systemd.html",
  "image": "https://dalam.web.id/img/fix-pacman-broken-systemd.webp",
  "content_plain": "âš™ï¸ Memperbaiki Pacman Broken Setelah Menghapus Systemd Kalau kamu nekat menghapus systemd tanpa menyiapkan init alternatif yang lengkap, pacman dan dependensinya bisa ikut rusak. Tapi masih bisa diselamatkan ðŸ˜Ž âš ï¸ Gejala Umum Pacman tidak bisa dijalankan: error while loading shared libraries Sistem gagal boot: target basic.target not found Service penting seperti dbus atau udev tidak jalan. Perintah sudo atau loginctl error karena systemd hilang. ðŸ’¡ Penjelasan Singkat Arch Linux didesain berbasis systemd sebagai init utama. Saat kamu menghapusnya tanpa mengganti dependency dengan alternatif dari proyek seperti Artix (runit, dinit, openrc), banyak paket penting seperti dbus, udev, dan polkit ikut terhapus atau tidak berfungsi. Akibatnya, pacman dan proses login bisa gagal. ðŸ§­ Langkah-Langkah Pemulihan 1ï¸âƒ£ Boot ke Mode Live ISO Gunakan USB Arch Linux / CachyOS / Artix, lalu mount partisi root kamu: mount /dev/sdXY /mnt arch-chroot /mnt 2ï¸âƒ£ Pasang Ulang systemd (atau penggantinya) Jika kamu ingin kembali ke sistem normal (systemd): pacman -Syu systemd systemd-libs systemd-sysvcompat dbus udev polkit Atau kalau kamu memang ingin lanjut tanpa systemd (misal ke Artix runit): pacman -S artix-keyring runit elogind-runit dbus-runit udev-runit Pastikan repositori Artix sudah ditambahkan di /etc/pacman.conf sebelum menjalankan perintah ini. 3ï¸âƒ£ Reinstall Pacman Jika Rusak pacman -S pacman --overwrite '*' Jika pacman sendiri tidak bisa berjalan, gunakan versi statis: curl -LO https://archlinux.org/packages/core/x86_64/pacman/download/ tar xvf pacman*.tar.zst -C /mnt Setelah itu masuk ke chroot dan jalankan kembali pacman. 4ï¸âƒ£ Regenerasi Initramfs dan Bootloader mkinitcpio -P grub-mkconfig -o /boot/grub/grub.cfg ðŸš‘ Alternatif Recovery (Jika Tidak Bisa Boot Sama Sekali) Gunakan Arch ISO, lalu: pacstrap -K /mnt base linux linux-firmware systemd networkmanager genfstab -U /mnt >> /mnt/etc/fstab arch-chroot /mnt passwd Ini akan memulihkan sistem dasar dengan systemd lengkap tanpa harus install ulang seluruh sistem dari nol. âœ… Kesimpulan Menghapus systemd tanpa pengganti yang tepat bisa bikin sistem lumpuh total. Tapi selama kamu bisa masuk chroot dan reinstall paket kunci seperti systemd, dbus, dan udev, sistem bisa dipulihkan sepenuhnya.",
  "meta": {
    "summary": "Panduan menyelamatkan sistem Arch Linux ketika pacman rusak setelah menghapus systemd atau migrasi ke init alternatif seperti runit, openrc, atau dinit.",
    "prompt_hint": "Panduan menyelamatkan sistem Arch Linux ketika pacman rusak setelah menghapus systemd atau migrasi ke init alternatif seperti runit, openrc, atau dinit.",
    "keywords": [],
    "topics": []
  }
}