{
  "id": "fotografi-privasi-hak-potret",
  "slug": "fotografi-privasi-hak-potret",
  "title": "Motret Candid di Ruang Publik: Privasi, Hak Potret, dan UU PDP",
  "category": "📢 Catatan & Opini Sosial",
  "published_at": "2025-10-30T01:11:59.615+00:00",
  "url": "https://dalam.web.id/artikel/fotografi-privasi-hak-potret.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjCxM4UWD5cROd0QzrP1j96bWGL9xhUHbrmGuz574TWA0bdGTqq-P5rJGtXLRN3YA8oY_aSHIKbQDxiG5n9oF2VMAXEArEAukSmNfCEBkIYH7jgQef3zuDM6CGlmdzn6x8_Ktd6unFNsVwzNnSHl6ztBr4-7aiEK9BObQ-ptQ-Tf9cmDAbrcZE0zxF0fXY/s1600/potretcandid.webp",
  "content": {
    "text": "Motret Candid di Ruang Publik: Antara Seni, Duit, dan Pelanggaran Privasi Analisis Anda sangat tepat. Ini adalah isu yang sangat relevan dan kompleks di era digital saat ini. Lagi ramai soal fotografer yang motret warga (terutama pelari) di ruang publik, lalu fotonya diunggah ke aplikasi AI bahkan dijual. Kelihatannya sepele, tapi ini jelas masalah serius. Mengambil foto di ruang publik punya batas antara dokumentasi dan eksploitasi komersial. Apa yang Anda sampaikan menyoroti inti masalahnya: Ada kesalahpahaman umum bahwa \"ruang publik\" berarti \"bebas eksploitasi\". Padahal, keduanya adalah hal yang sangat berbeda. Fenomena ini sangat meresahkan karena beberapa alasan utama, yang selaras dengan poin-poin Anda: 1. Wajah adalah Data Pribadi Biometrik Ini adalah poin terkuat dan paling fundamental. Sejak disahkannya UU No. 27 Tahun 2022 tentang Pelindungan Data Pribadi (UU PDP), status hukumnya menjadi jauh lebih jelas. Wajah dan foto seseorang itu bukan sekadar gambar, tapi dikategorikan sebagai data biometrik. Ini termasuk dalam data pribadi yang bersifat spesifik, yang perlindungannya super ketat. Aktivitas seperti pengambilan (motret), pemrosesan (edit, \"diunggah ke aplikasi AI\"), penyebarluasan, apalagi penjualan (komersialisasi) data pribadi wajib mendapatkan persetujuan (consent) yang eksplisit dari pemilik data (orang yang difoto). Fotografer dalam kasus ini bertindak sebagai \"Pengendali Data Pribadi\". Saat mereka memotret, menyimpan, dan menjual foto tanpa izin, mereka jelas melanggar hak subjek data (si pelari). 2. Mitos \"Street Photography\" dan Batas Komersialisasi Banyak yang mungkin berlindung di balik dalih street photography atau dokumentasi jurnalistik. Tapi, ada batas yang jelas: Untuk Dokumentasi/Seni: Street photography yang murni untuk seni atau dokumentasi jurnalistik memang memiliki area abu-abu. Umumnya masih diperbolehkan selama tidak merendahkan martabat objek dan tidak dieksploitasi secara individu. Untuk Komersialisasi: Nah, begitu foto itu dijual atau dijadikan konten komersial (misalnya, diunggah ke platform stok foto atau platform yang dimonetisasi), statusnya berubah total. Di sinilah UU Hak Cipta dan UU PDP bermain. Seseorang berhak atas potret dirinya sendiri, dan penggunaan komersial memerlukan izin tertulis (sering disebut model release). 3. Bahaya Baru: \"Diunggah ke Aplikasi AI\" Ini adalah lapisan pelanggaran yang lebih baru dan lebih berbahaya dari sekadar menjual foto. Saat foto diunggah ke \"aplikasi AI\", foto itu tidak hanya disimpan. Kemungkinan besar foto itu digunakan untuk melatih model AI (misalnya, AI image generator atau AI pengenal wajah). Ini berarti, data biometrik pelari tersebut (wajah, postur tubuh, gaya lari) dieksploitasi tanpa izin untuk membangun produk komersial baru. Ini adalah pelanggaran privasi dan data pribadi yang masif. Perbedaan Kunci: Hak Potret (UU Hak Cipta) vs. UU PDP Oke, sekarang mari kita bedah lebih dalam. Banyak yang bingung, ini sebenarnya masuknya ke UU Hak Cipta atau UU PDP? Jawabannya: bisa kena dua-duanya, tapi dengan fokus yang berbeda. Bedah UU Hak Cipta (UU No. 28/2014) - Fokus ke \"Hak Potret\" Di UU Hak Cipta, kita bicara soal \"Hak Potret\" (Portrait Right). Ini diatur jelas di Pasal 19. Gampangnya gini: UU Hak Cipta fokus pada ASPEK KOMERSIAL dari sebuah foto potret. Pasal itu bilang, untuk \"Pengumuman\" atau \"Perbanyakan\" Ciptaan yang memuat potret seseorang, harus minta izin tertulis dari orang yang dipotret (atau ahli warisnya) jika penggunaan itu bersifat komersial atau iklan. Contoh Pelanggaran: Fotografer motret candid pelari A. Lalu foto itu dijual ke majalah B untuk jadi sampul, atau dijual ke brand C untuk jadi iklan sepatu lari. Ini jelas melanggar Hak Potret jika tanpa izin pelari A. Fokusnya: Tindakan menjual, mengumumkan, atau memperbanyak untuk dapat untung (komersial). Bedah UU Pelindungan Data Pribadi (UU No. 27/2022) - Fokus ke \"Hak atas Data\" Nah, UU PDP ini beda dan perlindungannya jauh lebih fundamental dan luas. UU PDP tidak peduli foto itu mau dijual atau tidak. UU PDP fokus pada PROSES PENGOLAHAN DATA PRIBADI itu sendiri. Ingat, wajah adalah data biometrik (data spesifik). Proses pengolahan itu mencakup: Pemerolehan (motretnya), pengumpulan, pengolahan (edit, unggah ke AI), analisis, penyimpanan, hingga penyebarluasan. Semua itu harus punya dasar hukum, paling umum adalah persetujuan (consent) dari si pemilik data. Contoh Pelanggaran: Fotografer motret candid pelari A. 1. (Pelanggaran 1: Pemerolehan) Dia motret wajah pelari A dari dekat tanpa izin. 2. (Pelanggaran 2: Pengolahan) Dia mengunggah foto itu ke database/aplikasi AI untuk \"disortir\". 3. (Pelanggaran 3: Penyebarluasan) Dia memajang foto itu di galeri online-nya (meski nggak dijual). Itu semua sudah termasuk pelanggaran UU PDP, bahkan sebelum foto itu laku terjual. Kesimpulan: Eksploitasi vs. Dokumentasi Jadi, perbedaannya jelas ya: UU Hak Cipta (Hak Potret): Melindungi nilai ekonomi/komersial dari foto potret Anda. Pelanggaran terjadi saat foto Anda dipakai cari untung tanpa izin. UU PDP: Melindungi hak dasar Anda atas data pribadi (wajah Anda). Pelanggaran terjadi sejak data itu diambil dan diproses tanpa izin, terlepas dari tujuannya komersial atau bukan. Apa yang kelihatannya \"iseng\" atau \"sepele\" seperti motret candid di ruang publik, kini punya implikasi hukum yang sangat serius berkat UU PDP. Seperti yang Anda bilang di awal: ada batas tebal antara \"dokumentasi\" dan \"eksploitasi\". Dan hukum kita sekarang sudah mulai mengejar kemajuan teknologi ini.",
    "html": "<h1>Motret Candid di Ruang Publik: Antara Seni, Duit, dan Pelanggaran Privasi</h1>\n<div id=\"iposbrowser\"></div>\n        <p class=\"intro\">\n            Analisis Anda sangat tepat. Ini adalah isu yang sangat relevan dan kompleks di era digital saat ini. Lagi ramai soal fotografer yang motret warga (terutama pelari) di ruang publik, lalu fotonya diunggah ke aplikasi AI bahkan dijual. Kelihatannya sepele, tapi ini jelas masalah serius.\n        </p>\n\n        <figure class=\"main-image\">\n            <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjCxM4UWD5cROd0QzrP1j96bWGL9xhUHbrmGuz574TWA0bdGTqq-P5rJGtXLRN3YA8oY_aSHIKbQDxiG5n9oF2VMAXEArEAukSmNfCEBkIYH7jgQef3zuDM6CGlmdzn6x8_Ktd6unFNsVwzNnSHl6ztBr4-7aiEK9BObQ-ptQ-Tf9cmDAbrcZE0zxF0fXY/s1600/potretcandid.webp\" alt=\"Ilustrasi seorang fotografer memotret pelari di car free day.\">\n            <figcaption>Mengambil foto di ruang publik punya batas antara dokumentasi dan eksploitasi komersial.</figcaption>\n        </figure>\n\n        <p>\n            Apa yang Anda sampaikan menyoroti inti masalahnya: <strong>Ada kesalahpahaman umum bahwa \"ruang publik\" berarti \"bebas eksploitasi\".</strong> Padahal, keduanya adalah hal yang sangat berbeda.\n        </p>\n        <p>\n            Fenomena ini sangat meresahkan karena beberapa alasan utama, yang selaras dengan poin-poin Anda:\n        </p>\n        <h2>1. Wajah adalah Data Pribadi Biometrik</h2>\n        <p>\n            Ini adalah poin terkuat dan paling fundamental. Sejak disahkannya <strong>UU No. 27 Tahun 2022 tentang Pelindungan Data Pribadi (UU PDP)</strong>, status hukumnya menjadi jauh lebih jelas.\n        </p>\n\n        <ul class=\"custom-list\">\n            <li>\n                <strong>Wajah dan foto seseorang</strong> itu bukan sekadar gambar, tapi dikategorikan sebagai <strong>data biometrik</strong>. Ini termasuk dalam <strong>data pribadi yang bersifat spesifik</strong>, yang perlindungannya super ketat.\n            </li>\n            <li>\n                Aktivitas seperti pengambilan (motret), pemrosesan (edit, \"diunggah ke aplikasi AI\"), penyebarluasan, apalagi penjualan (komersialisasi) data pribadi <strong>wajib</strong> mendapatkan <strong>persetujuan (consent)</strong> yang eksplisit dari pemilik data (orang yang difoto).\n            </li>\n            <li>\n                Fotografer dalam kasus ini bertindak sebagai \"Pengendali Data Pribadi\". Saat mereka memotret, menyimpan, dan menjual foto tanpa izin, mereka jelas melanggar hak subjek data (si pelari).\n            </li>\n        </ul>\n        <h2>2. Mitos \"Street Photography\" dan Batas Komersialisasi</h2>\n        <p>\n            Banyak yang mungkin berlindung di balik dalih <i>street photography</i> atau dokumentasi jurnalistik. Tapi, ada batas yang jelas:\n        </p>\n\n        <ul class=\"custom-list\">\n            <li>\n                <strong>Untuk Dokumentasi/Seni:</strong> <i>Street photography</i> yang murni untuk seni atau dokumentasi jurnalistik memang memiliki area abu-abu. Umumnya masih diperbolehkan selama tidak merendahkan martabat objek dan tidak dieksploitasi secara individu.\n            </li>\n            <li>\n                <strong>Untuk Komersialisasi:</strong> Nah, begitu foto itu <strong>dijual</strong> atau <strong>dijadikan konten komersial</strong> (misalnya, diunggah ke platform stok foto atau platform yang dimonetisasi), statusnya berubah total. Di sinilah UU Hak Cipta dan UU PDP bermain. Seseorang berhak atas potret dirinya sendiri, dan penggunaan komersial memerlukan izin tertulis (sering disebut <i>model release</i>).\n            </li>\n        </ul>\n        <h2>3. Bahaya Baru: \"Diunggah ke Aplikasi AI\"</h2>\n        <p>\n            Ini adalah lapisan pelanggaran yang lebih baru dan lebih berbahaya dari sekadar menjual foto.\n        </p>\n        <p>\n            Saat foto diunggah ke \"aplikasi AI\", foto itu tidak hanya disimpan. Kemungkinan besar foto itu digunakan untuk <strong>melatih model AI</strong> (misalnya, AI <i>image generator</i> atau AI pengenal wajah). Ini berarti, data biometrik pelari tersebut (wajah, postur tubuh, gaya lari) dieksploitasi tanpa izin untuk membangun produk komersial baru. Ini adalah pelanggaran privasi dan data pribadi yang masif.\n        </p>\n\n        <h2>Perbedaan Kunci: Hak Potret (UU Hak Cipta) vs. UU PDP</h2>\n\n        <p>\n            Oke, sekarang mari kita bedah lebih dalam. Banyak yang bingung, ini sebenarnya masuknya ke UU Hak Cipta atau UU PDP? Jawabannya: <strong>bisa kena dua-duanya</strong>, tapi dengan fokus yang berbeda.\n        </p>\n        <div class=\"comparison-box\">\n            <h3>Bedah UU Hak Cipta (UU No. 28/2014) - Fokus ke \"Hak Potret\"</h3>\n            <p>\n                Di UU Hak Cipta, kita bicara soal <strong>\"Hak Potret\" (Portrait Right)</strong>. Ini diatur jelas di Pasal 19.\n            </p>\n            <p>\n                Gampangnya gini: UU Hak Cipta fokus pada <strong>ASPEK KOMERSIAL</strong> dari sebuah foto potret.\n            </p>\n            <p>\n                Pasal itu bilang, untuk <strong>\"Pengumuman\"</strong> atau <strong>\"Perbanyakan\"</strong> Ciptaan yang memuat potret seseorang, harus minta izin tertulis dari orang yang dipotret (atau ahli warisnya) jika penggunaan itu bersifat <strong>komersial atau iklan</strong>.\n            </p>\n            <ul class=\"custom-list\">\n                <li>\n                    <strong>Contoh Pelanggaran:</strong> Fotografer motret candid pelari A. Lalu foto itu dijual ke majalah B untuk jadi sampul, atau dijual ke brand C untuk jadi iklan sepatu lari. Ini <strong>jelas melanggar Hak Potret</strong> jika tanpa izin pelari A.\n                </li>\n                <li>\n                    <strong>Fokusnya:</strong> Tindakan menjual, mengumumkan, atau memperbanyak untuk dapat untung (komersial).\n                </li>\n            </ul>\n        </div>\n\n        <div class=\"comparison-box\">\n            <h3>Bedah UU Pelindungan Data Pribadi (UU No. 27/2022) - Fokus ke \"Hak atas Data\"</h3>\n            <p>\n                Nah, UU PDP ini beda dan perlindungannya <strong>jauh lebih fundamental dan luas</strong>.\n            </p>\n            <p>\n                UU PDP tidak peduli foto itu mau dijual atau tidak. UU PDP fokus pada <strong>PROSES PENGOLAHAN DATA PRIBADI</strong> itu sendiri. Ingat, wajah adalah data biometrik (data spesifik).\n            </p>\n            <p>\n                Proses pengolahan itu mencakup: <strong>Pemerolehan (motretnya)</strong>, pengumpulan, pengolahan (edit, unggah ke AI), analisis, penyimpanan, hingga penyebarluasan. Semua itu harus punya dasar hukum, paling umum adalah <strong>persetujuan (consent)</strong> dari si pemilik data.\n            </p>\n            <ul class=\"custom-list\">\n                <li>\n                    <strong>Contoh Pelanggaran:</strong> Fotografer motret candid pelari A.\n                    <br>1. <strong>(Pelanggaran 1: Pemerolehan)</strong> Dia motret wajah pelari A dari dekat tanpa izin.\n                    <br>2. <strong>(Pelanggaran 2: Pengolahan)</strong> Dia mengunggah foto itu ke database/aplikasi AI untuk \"disortir\".\n                    <br>3. <strong>(Pelanggaran 3: Penyebarluasan)</strong> Dia memajang foto itu di galeri online-nya (meski nggak dijual).\n                    <br>Itu semua sudah termasuk pelanggaran UU PDP, <strong>bahkan sebelum foto itu laku terjual.</strong>\n                </li>\n            </ul>\n        </div>\n        <h2>Kesimpulan: Eksploitasi vs. Dokumentasi</h2>\n\n        <p>\n            Jadi, perbedaannya jelas ya:\n        </p>\n        <ul class=\"custom-list\">\n            <li>\n                <strong>UU Hak Cipta (Hak Potret):</strong> Melindungi nilai <strong>ekonomi/komersial</strong> dari foto potret Anda. Pelanggaran terjadi saat foto Anda dipakai cari untung tanpa izin.\n            </li>\n            <li>\n                <strong>UU PDP:</strong> Melindungi <strong>hak dasar Anda atas data pribadi</strong> (wajah Anda). Pelanggaran terjadi <strong>sejak data itu diambil dan diproses</strong> tanpa izin, terlepas dari tujuannya komersial atau bukan.\n            </li>\n        </ul>\n        <p>\n            Apa yang kelihatannya \"iseng\" atau \"sepele\" seperti motret candid di ruang publik, kini punya implikasi hukum yang sangat serius berkat UU PDP. Seperti yang Anda bilang di awal: ada batas tebal antara \"dokumentasi\" dan \"eksploitasi\". Dan hukum kita sekarang sudah mulai mengejar kemajuan teknologi ini.\n        </p>\n        <div>\n            <div id=\"pesbukdiskus\"></div>\n        </div>"
  },
  "meta": {
    "summary": "Marak foto candid pelari dijual & diunggah ke AI. Ini bukan cuma soal etika, tapi bisa melanggar UU PDP dan Hak Potret. Pahami bedanya di sini.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Marak foto candid pelari dijual & diunggah ke AI. Ini bukan cuma soal etika, tapi bisa melanggar UU PDP dan Hak Potret. Pahami bedanya di sini."
  }
}