{
  "id": "gcos-2009-ngoprek-spg-ubuntu-jogja",
  "slug": "gcos-2009-ngoprek-spg-ubuntu-jogja",
  "title": "Ngoprek bareng SPG Ubuntu Jogja - GCOS 2009 di Aryaduta Semanggi",
  "category": "🐧 Linux & Open Source",
  "published_at": "2009-11-01T13:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/gcos-2009-ngoprek-spg-ubuntu-jogja.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjdW4blweq_8XOLDjC6FZptgnqp1YsR1GQG6qcGtXFN9opwknEGhDlwcLUwKtsg_TB0tlNg8OwAfbYpkS2TMuDganL6oPPmtEF4U-p1RT_xitvR274wByfSWyE8G75Vgw1-JIfAdgM3728/s1600/geeks+at+aryaduta+2.resized.JPG",
  "content": "Ngoprek bareng SPG Ubuntu Jogja - GCOS 2009 Menginap di The Aryaduta Suite Hotel Semanggi. Koneksi belum mulus, semangat tetap 100%. Ponsel, kamera, wireless, Ubuntu semua dibedah bareng. 🐧 SPG Ubuntu Jogja 🏨 Aryaduta Semanggi Geeks in a suite Walau internet seret (Telkomsel Flash, ada yang oprek modem Motorola inject SMART), tiap orang fokus pada “PR”-nya. Yang menarik dari ngoprek bareng: masalah beda-beda, tapi rasa penasarannya sama. Cerita singkat Seru juga kalau bisa ngoprek bareng di satu tempat. Saat menghadiri GCOS 2009 SPG Ubuntu Jogja, kami menginap di The Aryaduta Suite Hotel Semanggi. Ada yang ngoprek ponsel, kamera, wireless, bahkan Ubuntu masing-masing dengan tantangan hardware-nya. Di Jakarta pun, koneksi tak selalu mulus. Telkomsel Flash agak seret; ada yang utak-atik Motorola inject SMART biar netbook bisa online. Yang bikin hangat: fokus kolektif untuk saling bantu sampai beres. Sumber: milisdad.blogspot.com Tim ngoprek Oprek modem Bongkar pasang Tukar akal 1 / 1",
  "meta": {
    "summary": "Serunya ngoprek bareng SPG Ubuntu Jogja saat GCOS 2009: ponsel, kamera, wireless, sampai Ubuntu. Menginap di The Aryaduta Suite Hotel Semanggi. Galeri foto + cerita singkat.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Serunya ngoprek bareng SPG Ubuntu Jogja saat GCOS 2009: ponsel, kamera, wireless, sampai Ubuntu. Menginap di The Aryaduta Suite Hotel Semanggi. Galeri foto + cerita singkat."
  }
}