{
  "id": "git-prevent-auto-merge-request",
  "slug": "git-prevent-auto-merge-request",
  "title": "Cara Agar Branch Tidak Minta Merge Otomatis ke Main",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-10-22T11:53:56.623+00:00",
  "url": "https://dalam.web.id/artikel/git-prevent-auto-merge-request.html",
  "image": "https://dalam.web.id/img/git-prevent-auto-merge-request.webp",
  "content": {
    "text": "Itu Bukan Permintaan, Cuma Saran Kok! Pertama-tama, penting untuk tahu kalau anak branch itu sebenarnya gak pernah minta merge otomatis. Notifikasi kuning yang muncul di GitHub setelah kamu nge-push branch baru itu cuma **saran** atau **jalan pintas** yang baik hati dari GitHub. Tujuannya biar kamu gampang bikin Pull Request. Nah, kalau kamu mau alur kerjanya beda, ada dua cara utama untuk mengatur ini, dari yang paling gampang sampai yang paling ketat. Cara 1: Cukup Abaikan Saja (Paling Gampang) Betul, sesederhana itu. Kamu gak perlu mengubah setelan apa pun di repositori. Cukup ubah kebiasaanmu saja. Kerja Seperti Biasa: Lakukan semua perubahan, commit, dan push ke anak branch-mu (misal: `desain-baru`). Push ke Branch Sendiri: Pastikan kamu hanya push ke branch tersebut. git push origin desain-baru Salin Cuekin Tombolnya: Saat notifikasi \"Compare & pull request\" muncul di GitHub, **jangan diklik**. Anggap saja tidak ada. Selama tidak ada yang membuat Pull Request, anak branch akan tetap terpisah. Perubahan hanya akan masuk ke `main` jika kamu sebagai pengelola `main` branch \"memanggil\"-nya secara manual dengan `git merge`. Cara 2: Kunci `main` dengan Aturan (Paling Aman) Kalau kamu kerja bareng tim dan mau memastikan *semua orang* mengikuti aturan, ini adalah setelan yang wajib kamu aktifkan. Namanya Branch Protection Rules. Langkah-langkah Mengaktifkan: Buka repositorimu, lalu masuk ke tab Settings. Di menu kiri, pilih Branches. Klik tombol Add rule. Di bagian \"Branch name pattern\", ketik `main`. Centang kotak yang paling penting: ✅ Require a pull request before merging. Apa Efek dari Setelan Ini? Dengan mencentang satu kotak itu saja, kamu sudah mendapatkan keamanan luar biasa: Push Langsung Diblokir: Tidak ada lagi yang bisa secara tidak sengaja (atau sengaja) melakukan `git push origin main`. Semua perubahan wajib lewat Pull Request. Kontrol Penuh: Kamu bisa menambahkan aturan turunan, seperti \"wajib ada 1 *approval* dari rekan setim\" sebelum PR bisa di-merge. Kesimpulan: Cara 1 (mengabaikan) adalah tentang mengubah kebiasaan. Cara 2 (Branch Protection) adalah tentang mengubah sistem agar semua orang terpaksa mengikuti kebiasaan yang aman.",
    "html": "<h2>Itu Bukan Permintaan, Cuma Saran Kok!</h2>\n                <p>Pertama-tama, penting untuk tahu kalau anak branch itu sebenarnya gak pernah minta merge otomatis. Notifikasi kuning yang muncul di GitHub setelah kamu nge-push branch baru itu cuma **saran** atau **jalan pintas** yang baik hati dari GitHub. Tujuannya biar kamu gampang bikin Pull Request.</p>\n\n\n                <p>Nah, kalau kamu mau alur kerjanya beda, ada dua cara utama untuk mengatur ini, dari yang paling gampang sampai yang paling ketat.</p>\n                <div class=\"method-card\">\n                    <div class=\"method-header\">\n                        <i class=\"fas fa-coffee\"></i>\n                        <h2>Cara 1: Cukup Abaikan Saja (Paling Gampang)</h2>\n                    </div>\n                    <div class=\"method-body\">\n                        <p>Betul, sesederhana itu. Kamu gak perlu mengubah setelan apa pun di repositori. Cukup ubah kebiasaanmu saja.</p>\n                        <ol>\n                            <li><strong>Kerja Seperti Biasa:</strong> Lakukan semua perubahan, commit, dan push ke anak branch-mu (misal: `desain-baru`).</li>\n                            <li><strong>Push ke Branch Sendiri:</strong> Pastikan kamu hanya push ke branch tersebut.\n                                <div class=\"code-block\">\n                                    <pre><code>git push origin desain-baru</code></pre>\n                                    <button class=\"copy-btn\"><i class=\"far fa-copy\"></i> Salin</button>\n                                </div>\n                            </li>\n                            <li><strong>Cuekin Tombolnya:</strong> Saat notifikasi \"Compare &amp; pull request\" muncul di GitHub, **jangan diklik**. Anggap saja tidak ada.</li>\n                        </ol>\n                        <p>Selama tidak ada yang membuat Pull Request, anak branch akan tetap terpisah. Perubahan hanya akan masuk ke `main` jika kamu sebagai pengelola `main` branch \"memanggil\"-nya secara manual dengan `git merge`.</p>\n                    </div>\n                </div>\n                <div class=\"method-card\">\n                    <div class=\"method-header\">\n                        <i class=\"fas fa-shield-halved\"></i>\n                        <h2>Cara 2: Kunci `main` dengan Aturan (Paling Aman)</h2>\n                    </div>\n                    <div class=\"method-body\">\n                        <p>Kalau kamu kerja bareng tim dan mau memastikan *semua orang* mengikuti aturan, ini adalah setelan yang wajib kamu aktifkan. Namanya <strong>Branch Protection Rules</strong>.</p>\n                        <h4>Langkah-langkah Mengaktifkan:</h4>\n                        <ol>\n                            <li>Buka repositorimu, lalu masuk ke tab <strong>Settings</strong>.</li>\n                            <li>Di menu kiri, pilih <strong>Branches</strong>.</li>\n                            <li>Klik tombol <strong>Add rule</strong>.</li>\n                            <li>Di bagian \"Branch name pattern\", ketik `main`.</li>\n                            <li>Centang kotak yang paling penting: ✅ <strong>Require a pull request before merging</strong>.</li>\n                        </ol>\n\n\n                        <h4>Apa Efek dari Setelan Ini?</h4>\n                        <p>Dengan mencentang satu kotak itu saja, kamu sudah mendapatkan keamanan luar biasa:</p>\n                        <ul>\n                            <li><i class=\"fas fa-ban\"></i> <strong>Push Langsung Diblokir:</strong> Tidak ada lagi yang bisa secara tidak sengaja (atau sengaja) melakukan `git push origin main`. Semua perubahan wajib lewat Pull Request.</li>\n                            <li><i class=\"fas fa-check-double\"></i> <strong>Kontrol Penuh:</strong> Kamu bisa menambahkan aturan turunan, seperti \"wajib ada 1 *approval* dari rekan setim\" sebelum PR bisa di-merge.</li>\n                        </ul>\n                        <div class=\"tip\">\n                           <i class=\"fas fa-lightbulb\"></i>\n                           <strong>Kesimpulan:</strong> Cara 1 (mengabaikan) adalah tentang mengubah kebiasaan. Cara 2 (Branch Protection) adalah tentang mengubah sistem agar semua orang terpaksa mengikuti kebiasaan yang aman.\n                        </div>\n                    </div>\n                </div>"
  },
  "meta": {
    "summary": "Tutorial santai cara kerja Git dan GitHub agar anak branch tidak",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Tutorial santai cara kerja Git dan GitHub agar anak branch tidak"
  }
}