{
  "id": "gnome-49",
  "slug": "gnome-49",
  "title": "GNOME 49 Dirilis: Showtime, Papers, Wallpaper HDR, dan Peningkatan Besar",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-05-17T23:20:38.184+00:00",
  "url": "https://dalam.web.id/artikel/gnome-49.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbvzz-OwS4HYUs9S6IKtLgZFCQGJTKdNgll5JtVAiXUOm5NAeixlJxpzMFsCma4ZfWTVDdrBwVaqzse159QeLEgfp8Wor9_Q6YSenkQ01k3DXdr49lF6jY_n-4eP0RcYbOc74Q0wmFdOF2lKIVKbN55-BGqKrxBBQzmmr1tjo9ikV9LB1n7Q9_c2Yvg4k/s1600/gnome49.jpg",
  "content": {
    "text": "GNOME 49 \"Brescia\" Dirilis: Showtime, Papers, dan Wallpaper HDR Enam bulan setelah versi 48, GNOME 49 hadir dengan fokus pada pengalaman yang lebih mulus, tampilan elegan, dan fitur-fitur yang relevan untuk pengguna desktop Linux modern. Sorotan Utama GNOME 49 Pemutar Video Baru (Showtime): Menggantikan Totem, Showtime adalah aplikasi berbasis GTK 4 + Libadwaita dengan kontrol minimalis dan performa yang halus. Penampil Dokumen Modern (Papers): Menggantikan Evince dengan antarmuka yang lebih segar, kinerja lebih baik, dan fitur anotasi PDF yang disempurnakan. Dukungan Wallpaper HDR: Katalog wallpaper baru dioptimalkan untuk layar HDR, menampilkan rentang warna yang lebih luas dan kontras yang lebih baik. Web Browser (Epiphany) Naik Kelas: Peramban Web GNOME mendapatkan banyak perbaikan, termasuk dukungan daftar blokir iklan regional dan estimasi waktu baca. Kalender Responsif: Aplikasi Kalender didesain ulang agar nyaman digunakan di berbagai ukuran layar, dari ponsel hingga desktop. Peningkatan Desktop Jarak Jauh: Kini mendukung input multitouch, input mouse relatif untuk gaming, dan monitor virtual tambahan. Ketersediaan GNOME 49 akan menjadi bagian dari rilis distro mendatang seperti Fedora 43 dan Ubuntu 25.10. Pengguna disarankan untuk menunggu hingga GNOME 49 tersedia di repositori resmi distro mereka untuk proses pembaruan yang aman dan stabil.",
    "html": "<h1>GNOME 49 \"Brescia\" Dirilis: Showtime, Papers, dan Wallpaper HDR</h1>\n<div id=\"iposbrowser\"></div>\n                    <p class=\"lead\">Enam bulan setelah versi 48, GNOME 49 hadir dengan fokus pada pengalaman yang lebih mulus, tampilan elegan, dan fitur-fitur yang relevan untuk pengguna desktop Linux modern.</p>\n                    <div class=\"gallery\">\n                        <figure><img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbvzz-OwS4HYUs9S6IKtLgZFCQGJTKdNgll5JtVAiXUOm5NAeixlJxpzMFsCma4ZfWTVDdrBwVaqzse159QeLEgfp8Wor9_Q6YSenkQ01k3DXdr49lF6jY_n-4eP0RcYbOc74Q0wmFdOF2lKIVKbN55-BGqKrxBBQzmmr1tjo9ikV9LB1n7Q9_c2Yvg4k/s1600/gnome49.jpg\" alt=\"Tampilan utama GNOME 49\"></figure>\n                        <figure><img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgzB5CTyXbHMJZ1vVlpyrBeYbnZ11Q7UrE-c3x61OmvJ2aVcL_Nf36esOzmYe62ZE_qCgkSUYINq1Fzru27jx4NK_yJDKjFTW6QtaIF80mmVEpaNK8gX6qO7irWPqhv6_1yASCNIWBt7hYl0sLB5HJyRaU8phBzL4oYAHYEoBDkAYHVaaq_UO0NujSKZFs/s1600/gnome49-de.jpg\" alt=\"Menu dan panel GNOME 49\"></figure>\n                        <figure><img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjpCNz8n1T_8nKfw_uD4ql7-PeqysoiTMe81zCi8QG761fYK10k4kK90YF-wfQhmBJ_YV3pfqD01irZEgjjFX-OY3kjDzruw-cj0EQ3_fULqOQYUqnQXhK4XBehFF4A_G1WwAzk-uRfWrpJ3cWM1MwAkFnrKZv-SgLCkduEFlXU6fJ_sHhtA4q93M5Rh3c/s1600/gnome49-new-wallpapers-catalog.jpg\" alt=\"Katalog wallpaper HDR baru\"></figure>\n                    </div>\n                    <h2>Sorotan Utama GNOME 49</h2>\n                    <ul>\n                        <li><strong>Pemutar Video Baru (Showtime):</strong> Menggantikan Totem, Showtime adalah aplikasi berbasis GTK 4 + Libadwaita dengan kontrol minimalis dan performa yang halus.</li>\n                        <li><strong>Penampil Dokumen Modern (Papers):</strong> Menggantikan Evince dengan antarmuka yang lebih segar, kinerja lebih baik, dan fitur anotasi PDF yang disempurnakan.</li>\n                        <li><strong>Dukungan Wallpaper HDR:</strong> Katalog wallpaper baru dioptimalkan untuk layar HDR, menampilkan rentang warna yang lebih luas dan kontras yang lebih baik.</li>\n                        <li><strong>Web Browser (Epiphany) Naik Kelas:</strong> Peramban Web GNOME mendapatkan banyak perbaikan, termasuk dukungan daftar blokir iklan regional dan estimasi waktu baca.</li>\n                        <li><strong>Kalender Responsif:</strong> Aplikasi Kalender didesain ulang agar nyaman digunakan di berbagai ukuran layar, dari ponsel hingga desktop.</li>\n                        <li><strong>Peningkatan Desktop Jarak Jauh:</strong> Kini mendukung input multitouch, input mouse relatif untuk gaming, dan monitor virtual tambahan.</li>\n                    </ul>\n                    <h2>Ketersediaan</h2>\n                    <p>GNOME 49 akan menjadi bagian dari rilis distro mendatang seperti <strong>Fedora 43</strong> dan <strong>Ubuntu 25.10</strong>. Pengguna disarankan untuk menunggu hingga GNOME 49 tersedia di repositori resmi distro mereka untuk proses pembaruan yang aman dan stabil.</p>\n                    <div id=\"pesbukdiskus\"></div>"
  },
  "meta": {
    "summary": "GNOME 49 menghadirkan pemutar video Showtime, penampil dokumen Papers, dukungan wallpaper HDR, perbaikan besar di Web, Kalender, dan peningkatan desktop jarak jauh.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "GNOME 49 menghadirkan pemutar video Showtime, penampil dokumen Papers, dukungan wallpaper HDR, perbaikan besar di Web, Kalender, dan peningkatan desktop jarak jauh."
  }
}