{
  "id": "google-code-exporter",
  "slug": "google-code-exporter",
  "title": "Misteri GoogleCodeExporter: Jejak Migrasi Wiki Google Code",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-10-26T18:18:01.840+00:00",
  "url": "https://dalam.web.id/artikel/google-code-exporter.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEioZcFbq0AgFCdcEbp15JZWZkmdYk1OHxdIOXhuZkM_VSgs2DJF0t1OEjTLqfPHyFOCENcTG7_z27QsjSZqfWtPBvNONVWFpuZAhxGhZf8BjUqhUdsaS-bdZtkNbwYvqMYpW6nhZUp8SCoBKFyV4pLDHvet16J2G_srn3h38LHNJOydSMt9OdFyg9YJiMo/s1600/GoogleCodeExporter.webp",
  "content": "dalam.web.id / Jejak Digital Misteri GoogleCodeExporter: Menyelami Jejak Digital Migrasi Wiki Pernah lihat commit log aneh bertuliskan \"Migrating wiki contents from Google Code\"? Tenang, itu bukan error. Itu adalah artefak sejarah dari masa lalu internet. Jejak digital dari proses migrasi Google Code ke GitHub. Jadi, Apa Sebenarnya GoogleCodeExporter Itu? Singkatnya, **GoogleCodeExporter** itu adalah alat internal alias \"jasa pindahan digital\" yang dibuat oleh Google. Dulu banget, sebelum GitHub merajai dunia, Google punya layanan hosting proyek open-source sendiri namanya **Google Code** (di `code.google.com`). Mirip GitHub lah, ada hosting kode (Subversion, Mercurial, Git), pelacak isu (*issues*), dan halaman Wiki. Nah, di tahun 2015, Google mutusin buat menutup layanan Google Code. Biar proyek-proyek yang ada di sana nggak hilang ditelan zaman, Google bikin alat `GoogleCodeExporter` ini. Tujuannya spesifik: membantu developer memindahkan (migrasi) semua data proyek mereka dari Google Code ke platform lain, yang paling populer, tentu saja, **GitHub**. Oke, Terus \"Migrating wiki contents\" Itu Apa? Itu adalah **pesan commit otomatis** yang dibuat oleh alat GoogleCodeExporter tadi. Saat seorang developer menekan tombol \"Ekspor ke GitHub\" di proyek Google Code mereka, si alat GoogleCodeExporter ini mulai bekerja. Ia mengambil data kode, data *issue*, dan data Wiki, lalu mengunggahnya ke repositori baru di GitHub. Setiap tindakan yang dilakukannya (seperti menambah file wiki) dicatat sebagai sebuah commit Git. Dan biar jelas, alat ini ngasih pesan commit: `Migrating wiki contents from Google Code`. Jadi, kalau kamu lihat pesan commit itu, kamu sedang melihat \"jejak kaki\" digital dari sebuah alat yang melakukan migrasi otomatis lebih dari satu dekade lalu. Keren, kan? Bagian Paling Unik: Kenapa Wikinya Ada di Branch? Ini dia bagian yang sering bikin bingung. Kalau kamu cek repositori yang punya commit log tadi, kamu mungkin sadar: \"Loh, kok Wiki GitHub-nya kosong?\" Jawabannya adalah: **alat ini tidak memindahkan Wiki Google Code ke fitur Wiki GitHub.** Alasannya? Formatnya beda. Google Code pakai *markup syntax* sendiri, sedangkan GitHub pakai formatnya sendiri (kebanyakan Markdown). Migrasi langsung itu susah dan rawan berantakan. Solusi pintas dari GoogleCodeExporter adalah: Mengambil semua file Wiki lama (misal: `HomePage.wiki`, `Instalasi.wiki`). Mengubah formatnya sebisa mungkin ke Markdown (`.md`). Memasukkan semua file itu ke dalam **branch (cabang) baru** di repositori GitHub kamu. Branch baru itu (hampir selalu) diberi nama: `wiki`. Jadi, wiki-nya nggak hilang. Dia \"terarsip\" dengan aman sebagai sebuah branch di dalam repositori kodemu. Kesimpulannya Kalau kamu ketemu commit `GoogleCodeExporter` dengan pesan `Migrating wiki contents from Google Code`, itu bukan error atau ulah iseng developer. Itu adalah **artefak digital** yang sah, sebuah tanda kalau repositori itu adalah \"lulusan\" Google Code yang berhasil pindah ke GitHub sekitar tahun 2015. Dan kalau kamu butuh dokumentasi lama dari proyek itu, coba aja cek di branch yang namanya `wiki`. Siapa tahu kamu nemu harta karun!",
  "meta": {
    "summary": "Pernah lihat commit",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Pernah lihat commit"
  }
}