{
  "id": "gorilla-glass-s2",
  "slug": "gorilla-glass-s2",
  "title": "Demo Nekat! Kekuatan Gorilla Glass Samsung Galaxy S2 🚬",
  "category": "🔆 Lainnya",
  "published_at": "2025-04-09T12:38:48.540+00:00",
  "url": "https://dalam.web.id/artikel/gorilla-glass-s2.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgtW5sjYcXyRJwMKQ9cU4_luhCw74TlBDppiVQBEd9n_0oPov7_QVUucXKalaAxELQOM2RujOk-LNHMfkSz-NAlyjaMoM5q-jRkgrIN0rpK9ZxYRFxcqxQJ91WXkLmRY2x2wHLqDvxX2IkvuApp4i0zPbvlZ92nvSE8Gbc79eBQDYriA4EUc35ZQoRYVWk/s1600/hqdefault.jpg",
  "content_plain": "Demo Gorilla Glass Samsung Galaxy S2 Jangan ditiru di rumah, ini hanya demo ekstrem! Halo lur! Siapa di sini yang masih ingat masa kejayaan **Samsung Galaxy S2**? Ponsel legendaris ini memang punya banyak cerita, apalagi soal layarnya yang sudah dibekali teknologi canggih **Corning Gorilla Glass** generasi awal. Nah, buat membuktikan seberapa tangguh kaca ini, ada lho demo yang cukup nekat dan bikin ngilu! Pernah kepikiran layar ponsel bisa dijadikan asbak? 😅 Jangan ditiru ya, karena kali ini hanya demo iseng untuk menunjukkan kekuatan **Gorilla Glass** di Samsung Galaxy S2 putih. Seorang teman mencoba mematikan rokok langsung di layar! Gila, kan? Mematikan api rokok di layar ponsel bukanlah hal yang biasa. Suhu puntung rokok yang menyala itu bisa mencapai **ratusan derajat Celcius**, lho! Tapi, ajaibnya, layar Gorilla Glass ini didesain bukan cuma tahan goresan dari kunci atau koin di saku, tapi juga tahan terhadap panas ekstrem dan tekanan kecil tanpa pecah atau tergores serius. Tentu saja, lapisan oleofobik (anti minyak) di atasnya mungkin kena dampak, tapi kaca intinya tetap aman. Ini beneran bukti ketangguhan teknologi zaman dulu! Segala resiko tentu saja ditanggung oleh penonton. Ingat, layar HP itu mahal! Jadi cukup tonton saja videonya tanpa perlu praktek sendiri. 😉",
  "meta": {
    "summary": "Nekat! Demo Gorilla Glass pada Samsung Galaxy S2 putih dengan mematikan rokok di layar handphone. Video ini hanya untuk hiburan dan membuktikan ketangguhan layar. Jangan pernah ditiru!",
    "prompt_hint": "Nekat! Demo Gorilla Glass pada Samsung Galaxy S2 putih dengan mematikan rokok di layar handphone. Video ini hanya untuk hiburan dan membuktikan ketangguhan layar. Jangan pernah ditiru!",
    "keywords": [],
    "topics": []
  }
}