{
  "id": "grand-tjokro-balikpapan-2017",
  "slug": "grand-tjokro-balikpapan-2017",
  "title": "Hotel Tour Grand Tjokro Balikpapan — Kopdar Blogger & Influencer (2017)",
  "category": "🔆 Lainnya",
  "published_at": "2017-09-24T02:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/grand-tjokro-balikpapan-2017.html",
  "image": "https://dalam.web.id/img/grand-tjokro-balikpapan-2017.webp",
  "content": {
    "text": "Registrasi & pemanasan Datang sebagai Blogger & Influencer Balikpapan, registrasi dulu dong. Suasananya cair: sapa-sapa, cek nama, dan siap jalan bareng untuk hotel tour. Lantai 4: Non-smoking area Lantai 4 full non-smoking: lorong hingga kamar. Fitur keamanan: akses pintu RFID dan safe deposit box dengan pin yang bisa kamu set sendiri. Nyaman, bersih, dan aman. Highlight pribadi? View langsung ke landasan pacu Bandara SAMS Sepinggan dari jendela kamar—spot favorit buat penikmat pesawat landing-takeoff.",
    "html": "<h2>Registrasi &amp; pemanasan</h2>\n        <p>Datang sebagai Blogger &amp; Influencer Balikpapan, registrasi dulu dong. Suasananya cair: sapa-sapa, cek nama, dan siap jalan bareng untuk hotel tour.</p>\n        <h2>Lantai 4: Non-smoking area</h2>\n        <p>Lantai 4 full non-smoking: lorong hingga kamar. Fitur keamanan: akses pintu RFID dan safe deposit box dengan pin yang bisa kamu set sendiri. Nyaman, bersih, dan aman.</p>\n        <p>Highlight pribadi? View langsung ke landasan pacu Bandara SAMS Sepinggan dari jendela kamar—spot favorit buat penikmat pesawat landing-takeoff.</p>"
  },
  "meta": {
    "summary": "Cerita santai hotel tour di Grand Tjokro Balikpapan bareng Blogger & Influencer: kamar non-smoking, view runway, suite room, Emerald Chinese Restaurant, spa & kolam renang. Lengkap dengan galeri foto dan info praktis.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Cerita santai hotel tour di Grand Tjokro Balikpapan bareng Blogger & Influencer: kamar non-smoking, view runway, suite room, Emerald Chinese Restaurant, spa & kolam renang. Lengkap dengan galeri foto dan info praktis."
  }
}