{
  "id": "history-of-linux-project",
  "slug": "history-of-linux-project",
  "title": "History of Linux Project (HOLP) – Sejarah Kernel Linux dari Awal Sampai Sekarang",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-10-25T13:28:45.332+00:00",
  "url": "https://dalam.web.id/artikel/history-of-linux-project.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhksg7KmVc58-RjdFbQm-BBT_PO4ucCLx_sVRaESJqgCNZHSiFYELV53qvM9pQuHKduRssKTTX5paPoD9_WLEBR01Qv5yPJssrnpnwHRVJshFWCSqYof7rYlPILi6bp5P_Va6lW1linK2cDlU7pxoMwLMZWoee4H2FHnDY3jVXz-DXfuCg6zxZHxzooRh4/s320/linux-history.webp",
  "content": {
    "text": "History Of Linux Project (HOLP) Bagaimana kernel Linux lahir, berkembang, dan jadi besar. Cerita bagaimana kernel Linux diciptakan, dari awal sampai hari ini. (how the Linux kernel came to be, from its origins till today) Timeline (klik untuk lihat) (klik gambar untuk detail penuh) Apa itu HOLP? History Of Linux Project (HOLP) adalah sebuah inisiatif open-source (dan ke depan akan jadi asosiasi budaya), yang tujuannya menceritakan dan mengilustrasikan sejarah Linux kernel lewat timeline berwarna, kartu peristiwa, dan gambar-gambar tokoh penting. Setiap kartu pada diagram mewakili momen inti yang berdampak pada lahir dan besarnya Linux kernel sampai sekarang. Gambarnya pun dibuat informatif – ada foto pendiri, logo perusahaan/komunitas yang berperan langsung maupun tidak langsung dalam perkembangan Linux. Kamu bisa langsung ke halaman releases untuk download timeline versi terbaru! Tujuan HOLP (Goals) Menjelaskan bagaimana Linux lahir sampai masa kini, step-by-step. Mendokumentasikan sejarah perkembangan kernel Linux secara detail. Jadi referensi utama (de facto) untuk pendidikan sejarah Linux. Meningkatkan awareness terhadap semangat open-source di dunia digital! Cara Berkontribusi di HOLP HOLP benar-benar open-source dan butuh banyak kontribusi dari volunteers! Kamu bisa: Menambah, mengedit, atau menghapus kartu event sejarah Linux; Memastikan isi & tanggal di timeline benar (fact-checking!); Kasi saran artistik buat desain timeline makin menarik; Bantu aksesibilitas (bisa dibaca lebih mudah); Menambah terjemahan biar makin global. Mau gabung? Cek dulu kontribusi guidelines di sini. Semua kontributor akan diberi kredit di bagian atas, jadi yuk join bareng! Linux bukan sekadar software—tapi semangat kolaborasi, belajar, dan berbagi! Dengan HOLP, sejarah Linux akan tetap hidup dan menginspirasi generasi berikutnya. #LinuxForEveryone",
    "html": "<header>\n        <img class=\"logo-linux\" src=\"https://upload.wikimedia.org/wikipedia/commons/a/af/Tux.png\" alt=\"Tux Linux icon\" loading=\"lazy\">\n        <div>\n            <h1>History Of Linux Project <span style=\"font-weight:400; color:#6fedfa\">(HOLP)</span></h1>\n\n            <div class=\"subtitle\">Bagaimana kernel Linux lahir, berkembang, dan jadi besar.</div>\n        </div>\n    </header>\n    <p style=\"text-align:center; margin-top:8px;\">\n        <i>Cerita bagaimana kernel Linux diciptakan, dari awal sampai hari ini.</i>\n        <br><i>(how the Linux kernel came to be, from its origins till today)</i>\n    </p>\n    <details>\n    <summary>Timeline <i>(klik untuk lihat)</i></summary>\n    <br>\n    <div class=\"timeline-img\">\n        <a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhksg7KmVc58-RjdFbQm-BBT_PO4ucCLx_sVRaESJqgCNZHSiFYELV53qvM9pQuHKduRssKTTX5paPoD9_WLEBR01Qv5yPJssrnpnwHRVJshFWCSqYof7rYlPILi6bp5P_Va6lW1linK2cDlU7pxoMwLMZWoee4H2FHnDY3jVXz-DXfuCg6zxZHxzooRh4/s5637/linux-history.webp\" target=\"_blank\">\n            <img alt=\"timeline sejarah kernel linux\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhksg7KmVc58-RjdFbQm-BBT_PO4ucCLx_sVRaESJqgCNZHSiFYELV53qvM9pQuHKduRssKTTX5paPoD9_WLEBR01Qv5yPJssrnpnwHRVJshFWCSqYof7rYlPILi6bp5P_Va6lW1linK2cDlU7pxoMwLMZWoee4H2FHnDY3jVXz-DXfuCg6zxZHxzooRh4/s320/linux-history.webp\">\n        </a>\n        <div style=\"text-align:center; font-size:1rem; color:#ffd;\">(klik gambar untuk detail penuh)</div>\n    </div>\n    </details>\n\n    <div class=\"section card\">\n        <h2>Apa itu HOLP?</h2>\n        <div class=\"info\">\n            <b>History Of Linux Project</b> (<b>HOLP</b>) adalah sebuah inisiatif open-source (dan ke depan akan jadi <a href=\"https://it.wikipedia.org/wiki/Associazionismo_culturale\" target=\"_blank\">asosiasi budaya</a>),\n            yang tujuannya menceritakan dan mengilustrasikan sejarah Linux kernel lewat timeline berwarna, kartu peristiwa, dan gambar-gambar tokoh penting. <br><br>\n            Setiap kartu pada diagram mewakili momen inti yang berdampak pada lahir dan besarnya Linux kernel sampai sekarang. Gambarnya pun dibuat informatif – ada foto pendiri, logo perusahaan/komunitas yang berperan langsung maupun tidak langsung dalam perkembangan Linux.<br><br>\n            Kamu bisa langsung ke <a href=\"https://github.com/MarkGotLasagna/holp/releases\" target=\"_blank\">halaman releases</a> untuk download timeline versi terbaru!\n        </div>\n    </div>\n\n    <div class=\"section card\">\n        <h2>Tujuan HOLP (Goals)</h2>\n        <ul class=\"goal\">\n            <li>Menjelaskan bagaimana Linux lahir sampai masa kini, step-by-step.</li>\n            <li>Mendokumentasikan sejarah perkembangan kernel Linux secara detail.</li>\n            <li>Jadi referensi utama (de facto) untuk pendidikan sejarah Linux.</li>\n            <li>Meningkatkan awareness terhadap semangat open-source di dunia digital!</li>\n        </ul>\n    </div>\n\n    <div class=\"section card\">\n        <h2>Cara Berkontribusi di HOLP</h2>\n        <div class=\"info\">\n            HOLP benar-benar open-source dan butuh banyak kontribusi dari volunteers! Kamu bisa:\n            <ul style=\"margin:6px 0 0 0;\">\n                <li>Menambah, mengedit, atau menghapus kartu event sejarah Linux;</li>\n                <li>Memastikan isi &amp; tanggal di timeline benar (fact-checking!);</li>\n                <li>Kasi saran artistik buat desain timeline makin menarik;</li>\n                <li>Bantu aksesibilitas (bisa dibaca lebih mudah);</li>\n                <li>Menambah terjemahan biar makin global.</li>\n            </ul>\n            Mau gabung? Cek dulu <a href=\"https://github.com/MarkGotLasagna/holp/wiki/Contribution-guidelines\" target=\"_blank\">kontribusi guidelines di sini.</a> <br>\n            Semua kontributor akan diberi kredit di bagian atas, jadi yuk join bareng!\n        </div>\n    </div>\n<div class=\"section card\">\n          \n    </div>\n    <div style=\"margin:36px 0 14px; font-size:1rem; color:#fde95f;\">\n        Linux bukan sekadar software—tapi semangat kolaborasi, belajar, dan berbagi!\n        Dengan HOLP, sejarah Linux akan tetap hidup dan menginspirasi generasi berikutnya.\n        <b>#LinuxForEveryone</b>\n    </div>"
  },
  "meta": {
    "summary": "Story behind how the Linux kernel was born, berkembang, hingga jadi open-source utama dunia, lengkap dengan timeline dan cara berkontribusi!",
    "prompt_hint": "Story behind how the Linux kernel was born, berkembang, hingga jadi open-source utama dunia, lengkap dengan timeline dan cara berkontribusi!",
    "keywords": [],
    "topics": []
  }
}