{
  "id": "hukum-perayaan-hari-kelahiran-dalam-islam",
  "slug": "hukum-perayaan-hari-kelahiran-dalam-islam",
  "title": "Hukum Perayaan Hari Kelahiran (Termasuk Maulid Nabi) dalam Islam",
  "category": "📚 Sejarah & Religi",
  "published_at": "2025-08-01T03:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/hukum-perayaan-hari-kelahiran-dalam-islam.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgpOdGKsVe0kbktZEqrJnlrM8hFsD7WWS0QbTwNhjsjbs7hqMvo89fBbzk5G2umDWlJ_jbQIujGjssg-_dj3nD96h_7YgaJf3EkTU81fYDJpnBWbcnAXWyNMYJ4uWCUZtxyFe_-y59a3VAG/s600/app_full_proxy.gif",
  "content": "Hukum Perayaan Hari Kelahiran dalam Islam Alhamdulillah, segala puji bagi Allah. Shalawat dan salam semoga dilimpahkan kepada Rasulullah, keluarga, sahabat, serta mereka yang mengikuti jejak langkahnya. Amma ba’d. Pertanyaan yang Diajukan Saya membaca sebuah makalah di koran Al-Madinah (28/12/1410 H) tentang perayaan kelahiran. Pertanyaan muncul: Apakah perayaan hari kelahiran (termasuk Maulid Nabi) dibolehkan dalam Islam? Jawaban Berdasarkan Syariat Islam hanya mensyariatkan dua hari raya resmi bagi kaum Muslimin: Idul Fitri dan Idul Adha. Selain itu, ada hari-hari ibadah yang diagungkan seperti Jum'at, Arafah, dan Tasyriq. Namun, **Allah tidak pernah mensyariatkan perayaan hari kelahiran**, baik kelahiran Nabi maupun selainnya. \"Barangsiapa membuat sesuatu yang baru dalam urusan kami (agama Islam) yang tidak terdapat tuntunan padanya, maka ia tertolak.\" – HR. Bukhari & Muslim Perayaan hari kelahiran termasuk kategori **bid’ah** (inovasi dalam agama) dan **tasyabbuh** (menyerupai kaum Yahudi & Nashrani dalam praktik keagamaan mereka). Nabi Muhammad SAW tidak pernah merayakan hari kelahirannya, begitu pula para sahabat dan tabi’in. Jika perayaan ini merupakan suatu kebaikan, tentu generasi terbaik umat ini sudah mendahului kita dalam melakukannya. Sejarah mencatat, yang pertama kali merayakan maulid adalah kelompok **Syi’ah Fathimiyah** pada abad ke-4 H, lalu diikuti sebagian umat Islam tanpa dasar syariat yang sahih. Oleh karena itu, ulama menegaskan kewajiban menjelaskan bahaya bid’ah ini agar sunnah tidak terkubur. Referensi Hadits (Untuk Bukti Larangan Bid'ah) HR. Bukhari & Muslim (Hadits Aisyah tentang penolakan amalan baru) HR. Muslim (Al-Jumu’ah 867 – tentang sebaik-baik petunjuk adalah petunjuk Muhammad SAW) HR. Abu Dawud & Ahmad (Tentang larangan tasyabbuh) HR. Bukhari & Muslim (Al-Ilm 2669 – tentang berpegang teguh pada sunnah) Kesimpulan Perayaan hari kelahiran **tidak disyariatkan** dalam Islam dan dianggap sebagai bid'ah. Kaum Muslimin hendaknya menjauhi, mengingkari, serta tidak menyebarkannya. Wajib bagi setiap Muslim untuk berpegang teguh pada **Al-Qur’an dan Sunnah** (sesuai pemahaman para sahabat), serta berhati-hati dari segala bentuk bid’ah dan tasyabbuh dengan kaum kafir.",
  "meta": {
    "summary": "Penjelasan rinci tentang hukum perayaan hari kelahiran (termasuk maulid Nabi) dalam Islam berdasarkan Al-Qur",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Penjelasan rinci tentang hukum perayaan hari kelahiran (termasuk maulid Nabi) dalam Islam berdasarkan Al-Qur"
  }
}