{
  "id": "imagemagick-konversi-png-ke-jpg-massal",
  "slug": "imagemagick-konversi-png-ke-jpg-massal",
  "title": "Konversi massal PNG ke JPG dengan ImageMagick di Linux, macOS, dan Windows",
  "category": "📸 Multimedia & Editing",
  "published_at": "2025-10-02T16:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/imagemagick-konversi-png-ke-jpg-massal.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiKKxJRcihtnyH6nkOtfaP_YqyrpG3J9lUTiG5ZDjuQkMDR0Rbs3EjhUWKzLGT2R7sj9G9dh84gWmgLGhIMihPoIzAwbCdFkUgb2wxJ-kH2aBAGAfdBAJF-45f5OAuMond9foS4vvadprMfB8d05wTgyGtx8ejiJRBWgAv6T0ZjVUapufitMim5Ytg7JN8/s1600/imlinux.jpg",
  "content_plain": "Konversi massal PNG ke JPG dengan ImageMagick di Linux, macOS, dan Windows ImageMagick itu seperti “pisau Swiss” untuk gambar. Buat urusan convert massal, dia simpel, cepat, dan konsisten di berbagai sistem. Di bawah ini perintah siap pakai untuk ubah semua PNG jadi JPG sekaligus, plus tips kualitas, output folder, dan penanganan transparansi. Ditulis oleh Fakhrul · 03 Okt 2025 Prinsip umum: mogrify untuk massal ImageMagick menyediakan perintah mogrify untuk memproses banyak file sekaligus. Versi baru memanggilnya lewat magick, jadi pola umumnya: magick mogrify. Perintahnya konsisten di Linux, macOS, dan Windows—bedanya cuma shell/terminal yang dipakai. Linux terminal macOS terminal Windows PowerShell Linux (bash/zsh) Masuk ke folder berisi file .png, lalu jalankan perintah berikut untuk mengubah semua PNG menjadi JPG di folder yang sama: # Konversi semua PNG menjadi JPG di folder ini magick mogrify -format jpg *.png Kalau mau hasilnya ke folder lain agar rapi, buat folder output lalu gunakan opsi -path: mkdir ../jpg-output magick mogrify -path ../jpg-output -format jpg *.png macOS (Terminal) Perintahnya identik dengan Linux (macOS berbasis Unix). Contohnya: cd /path/ke/folder/gambar magick mogrify -format jpg *.png # Simpan ke Desktop sebagai folder output magick mogrify -path ~/Desktop/jpg-output -format jpg *.png Windows (Command Prompt atau PowerShell) Di Windows, panggil magick juga. Buka Command Prompt atau PowerShell, lalu: cd \"C:\\Users\\NamaAnda\\Pictures\\png-folder\" magick mogrify -format jpg *.png # Output ke folder lain: magick mogrify -path \"C:\\Users\\NamaAnda\\Pictures\\jpg-output\" -format jpg *.png Opsi penting: kualitas, kompresi, dan transparansi Kualitas JPEG (0–100, default 92–95 tergantung build). 85 biasanya aman untuk web: magick mogrify -quality 85 -format jpg *.png Hasil ke folder lain agar tidak campur dengan PNG asli: magick mogrify -path ./output-jpg -format jpg *.png Transparansi (alpha): PNG bisa transparan, sedangkan JPG tidak. Supaya latar jadi putih dan tidak hitam: magick mogrify -background white -alpha remove -alpha off -format jpg *.png Catatan kompatibilitas Jika kamu menggunakan versi lama ImageMagick, kadang perintahnya masih convert/mogrify langsung tanpa awalan magick. Untuk massal, tetap pakai mogrify: # Versi lama (tidak direkomendasikan, tapi masih ada) mogrify -format jpg *.png Intinya: untuk konversi massal, gunakan magick mogrify -format jpg *.png. Tambahkan -quality bila perlu, dan pakai -background white -alpha remove untuk menangani PNG transparan agar latarnya putih. 🄯 2025 dalam.web.id · Artikel disajikan dengan gaya santai, tetap akurat dan ramah pengguna. ← → ✕ —",
  "meta": {
    "summary": "Panduan santai cara mengubah semua PNG menjadi JPG sekaligus dalam satu folder dengan ImageMagick—di Linux, macOS, dan Windows. Termasuk opsi kualitas, output folder, dan penanganan transparansi.",
    "prompt_hint": "Panduan santai cara mengubah semua PNG menjadi JPG sekaligus dalam satu folder dengan ImageMagick—di Linux, macOS, dan Windows. Termasuk opsi kualitas, output folder, dan penanganan transparansi.",
    "keywords": [],
    "topics": []
  }
}