{
  "id": "instal-cloudflare-warp-linux-2025",
  "slug": "instal-cloudflare-warp-linux-2025",
  "title": "Cara Instal Cloudflare WARP di Linux (Debian 13, Ubuntu, RHEL/CentOS) – Update 2025!",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-12-17T14:58:47.952+00:00",
  "url": "https://dalam.web.id/artikel/instal-cloudflare-warp-linux-2025.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEisaeOoP4xqx9OmlXhSNkLMDJq4btwbzOdEP972KJ7g6j8FD_mV7Az4DpIvGGv08LgX4Ul1wFbRgZDP-Ki1_TTOOsyJvIRI5EX9Ej_6h_7ygCISUE-HWsCPtpyv-XH8Af5OoC6sFaEqRUmrkVLfBkjuz39xMiGf9HsX4x51w4fa_zjcbOMWuoADiLiIJ2Q/s1600/cloudflare-warp.webp",
  "content": "Cara Instal Cloudflare WARP di Linux – Update Desember 2025! Good news bro! Cloudflare sekarang resmi support Debian 13 (Trixie). Ini tutorial lengkap buat berbagai distro, termasuk notice penting soal public key update. Cocok buat kamu yang lagi kesel koneksi MyRepublic lambat ke GitHub 🔥 Sebelumnya sempet error \"Unable to locate package cloudflare-warp\" di Debian 13, tapi sekarang (17 Desember 2025) Cloudflare udah resmi nambah support Trixie! Jadi nggak perlu workaround bookworm lagi. Makasih info dari situs resmi pkg.cloudflareclient.com – aku update artikel ini biar lebih lengkap dan cover distro lain juga. Cloudflare WARP ini tool keren buat bypass routing ISP yang mood-moodan, apalagi MyRepublic ke server luar kayak GitHub. Bikin latency turun, loading ngebut. Plus gratis unlimited (basic mode). Kalau error locate package muncul lagi, biasanya karena cache apt atau key lama – tapi sekarang harusnya lancar. Notice Penting (Update 2025): Public key harus di-update kalau repo kamu diinstal sebelum 12 September 2025. Kalau nggak, repo bakal error setelah 4 Desember 2025. Selalu re-run step add GPG key! Distro yang Didukung Resmi (Desember 2025) Ubuntu: Noble (24.04), Jammy (22.04), Focal (20.04), Bionic (18.04), Xenial (16.04) Debian: Trixie (13) 🔥, Bookworm (12), Bullseye (11), Buster (10), Stretch (9) Red Hat Enterprise Linux & CentOS: 8 Kalau distro kamu nggak ada di list, coba fallback ke versi terdekat atau download .deb/.rpm manual dari situs Cloudflare. Instal di Ubuntu & Debian (Termasuk Debian 13 Trixie) Cara resmi, pakai $(lsb_release -cs) otomatis – sekarang Trixie langsung support! # Add cloudflare gpg key (WAJIB re-run kalau instal sebelum Sept 2025!) curl -fsSL https://pkg.cloudflareclient.com/pubkey.gpg | sudo gpg --yes --dearmor --output /usr/share/keyrings/cloudflare-warp-archive-keyring.gpg # Add repo echo \"deb [signed-by=/usr/share/keyrings/cloudflare-warp-archive-keyring.gpg] https://pkg.cloudflareclient.com/ $(lsb_release -cs) main\" | sudo tee /etc/apt/sources.list.d/cloudflare-client.list # Install sudo apt-get update && sudo apt-get install cloudflare-warp Kalau masih error locate package: Clear cache apt (sudo apt clean), atau cek codename kamu bener (lsb_release -cs harus trixie/bookworm dll). Instal di Red Hat Enterprise Linux & CentOS (Versi 8) # Update public key (kalau perlu) sudo rpm -e 'gpg-pubkey(4fa1c3ba-61abda35)' && sudo rpm --import https://pkg.cloudflareclient.com/pubkey.gpg # Add repo curl -fsSl https://pkg.cloudflareclient.com/cloudflare-warp-ascii.repo | sudo tee /etc/yum.repos.d/cloudflare-warp.repo # Update & Install sudo yum update sudo yum install cloudflare-warp Setelah Instal, Aktifin WARP warp-cli registration new warp-cli connect Cek status: warp-cli status – harus Connected! Disconnect kalau mau: warp-cli disconnect. Tips: Connect ke mode WARP (full tunnel) biar semua traffic bypass ISP – GitHub langsung ngebut dari Balikpapan! Coba sekarang ya, bro – harusnya langsung works tanpa drama. Kalau masih ada error (share output terminalnya), aku bantu debug lagi. Semangat, semoga koneksi international jadi kayak kilat setelah ini! Jangan sampe routing MyRepublic bikin tambah gerah 😏💻 Kalau artikel ini membantu, share ke temen lain dong. Kita bikin Linux user di Indo lebih happy bareng!",
  "meta": {
    "summary": "Tutorial santai instal Cloudflare WARP di berbagai distro Linux, termasuk Debian 13 Trixie yang sekarang resmi support. Solusi error Unable to locate package dan notice key update 2025. Cocok buat bypass routing MyRepublic lambat ke GitHub!",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Tutorial santai instal Cloudflare WARP di berbagai distro Linux, termasuk Debian 13 Trixie yang sekarang resmi support. Solusi error Unable to locate package dan notice key update 2025. Cocok buat bypass routing MyRepublic lambat ke GitHub!"
  }
}