{
  "id": "integritas-lisan",
  "slug": "integritas-lisan",
  "title": "Integritas Dimulai dari Lisan: Sebuah Renungan Kejujuran",
  "category": "📢 Catatan & Opini Sosial",
  "published_at": "2025-11-01T12:55:53.042+00:00",
  "url": "https://dalam.web.id/artikel/integritas-lisan.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj2LCfKJAITfBy7Q6Ri9vsKe_YhyphenhyphenXgpo61hZu6rgSmbsmLvQhJOzjjd6-twZmBMxk6g_2gJeaidl7P3iXD2Wak0hQM6KmrOJBnMMpgeDDtJkOUkVB6QfdosdQbtbPWXmUy2t-6t82RjWCeowLFK4K72RntRDRsCk7gY8oQ96ubEzFTbGnMWTN7DQxg93M8/s600/janganbohong2.jpg.webp",
  "content": {
    "text": "Integritas Dimulai dari Lisan Kejujuran adalah akar kepercayaan. Sekali kita berbohong, meskipun dalam candaan, ia bisa merusak kredibilitas dan keimanan kita. Mari renungkan sabda Nabi ﷺ: \"Celakalah bagi yang berbicara lantas berdusta hanya karena ingin membuat suatu kaum tertawa. Celakalah dia, celakalah dia.\" Semoga Allah selalu membimbing lisan kita untuk berkata benar. Kenapa Sih, Bercanda Bohong Aja Nggak Boleh? Mungkin kita mikir, \"Ah, cuma bercanda doang, kan nggak serius.\" Eits, tunggu dulu. Masalahnya nggak sesimpel itu, sob. Lisan kita itu ibarat pedang bermata dua. Bisa dipakai buat kebaikan, bisa juga buat ngelukain. Hadits tadi ngasih *warning* keras banget, sampai diulang tiga kali \"Celakalah dia\". Ini nunjukkin kalau masalah bohong buat lucu-lucuan itu serius banget di mata agama. Kenapa? Karena kebohongan, sekecil apa pun, itu kayak noda di kain putih. Awalnya kecil, tapi lama-lama bisa merusak segalanya. Kepercayaan Itu Mahal, Bro! Kepercayaan itu kayak lem. Sekali rusak, butuh usaha ekstra buat nyambunginnya lagi, dan hasilnya nggak bakal sama kayak semula. Merusak Kredibilitas: Kalau kita keseringan bohong (walaupun niatnya bercanda), orang lama-lama bakal mikir, \"Ini orang lagi serius apa ngelawak, ya?\". Omongan kita jadi nggak ada harganya lagi. Mengikis Keimanan: Kata Nabi, bohong itu salah satu tanda orang munafik. Ngeri, kan? Candaan yang kita anggap remeh, ternyata bisa ngegerogoti iman kita pelan-pelan. Jadi Kebiasaan Buruk: Yang namanya bohong, sekali dicoba, bisa ketagihan. Dari bohong kecil buat bercanda, bisa jadi kebiasaan bohong buat hal-hal serius. Jadi, intinya, yuk kita jaga lisan kita. Masih banyak kok cara buat bikin suasana asyik dan ketawa bareng tanpa harus nyelipin kebohongan. Integritas kita jauh lebih berharga daripada sekadar tawa sesaat.",
    "html": "<header>\n                <h1>Integritas Dimulai dari Lisan</h1>\n\n            </header>\n\n            <section class=\"content\">\n                <p>Kejujuran adalah akar kepercayaan. Sekali kita berbohong, meskipun dalam candaan, ia bisa merusak kredibilitas dan keimanan kita.</p>\n\n                <p>Mari renungkan sabda Nabi ﷺ:</p>\n                \n                <blockquote>\n                    <p>\"Celakalah bagi yang berbicara lantas berdusta hanya karena ingin membuat suatu kaum tertawa. Celakalah dia, celakalah dia.\"</p>\n                    \n                </blockquote>\n\n                <p>Semoga Allah selalu membimbing lisan kita untuk berkata benar.</p>\n\n                <figure>\n                    <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgtV2g0Dg2_flMSf-W-izkP5bszLUdWXYwhjskC_riZ61noDrMe8U2K598kfAGO0zZGZyEG-v87LQcnW-zsS2XyrwT_GAZIYOvxyIerqXfs0bUbLQ9OqYZJ3JZlnHdrIJSzQsEl8fIaXL9OkobmBXCX47emAB5mwgE_2194PRpffq_ZbbMiQwIpvOK85YE/s600/janganbohong1.jpg.webp\" alt=\"Ilustrasi jangan berbohong\">\n                </figure>\n\n                <h2>Kenapa Sih, Bercanda Bohong Aja Nggak Boleh?</h2>\n\n                <p>Mungkin kita mikir, \"Ah, cuma bercanda doang, kan nggak serius.\" Eits, tunggu dulu. Masalahnya nggak sesimpel itu, sob.</p>\n\n                <p>Lisan kita itu ibarat pedang bermata dua. Bisa dipakai buat kebaikan, bisa juga buat ngelukain. Hadits tadi ngasih *warning* keras banget, sampai diulang tiga kali \"Celakalah dia\". Ini nunjukkin kalau masalah bohong buat lucu-lucuan itu serius banget di mata agama.</p>\n                \n                <p>Kenapa? Karena kebohongan, sekecil apa pun, itu kayak noda di kain putih. Awalnya kecil, tapi lama-lama bisa merusak segalanya.</p>\n\n                <figure>\n                    <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj2LCfKJAITfBy7Q6Ri9vsKe_YhyphenhyphenXgpo61hZu6rgSmbsmLvQhJOzjjd6-twZmBMxk6g_2gJeaidl7P3iXD2Wak0hQM6KmrOJBnMMpgeDDtJkOUkVB6QfdosdQbtbPWXmUy2t-6t82RjWCeowLFK4K72RntRDRsCk7gY8oQ96ubEzFTbGnMWTN7DQxg93M8/s600/janganbohong2.jpg.webp\" alt=\"Peringatan untuk tidak berdusta\">\n                </figure>\n\n                <h2>Kepercayaan Itu Mahal, Bro!</h2>\n\n                <p>Kepercayaan itu kayak lem. Sekali rusak, butuh usaha ekstra buat nyambunginnya lagi, dan hasilnya nggak bakal sama kayak semula. </p>\n                \n                <ul>\n                    <li><strong>Merusak Kredibilitas:</strong> Kalau kita keseringan bohong (walaupun niatnya bercanda), orang lama-lama bakal mikir, \"Ini orang lagi serius apa ngelawak, ya?\". Omongan kita jadi nggak ada harganya lagi.</li>\n                    <li><strong>Mengikis Keimanan:</strong> Kata Nabi, bohong itu salah satu tanda orang munafik. Ngeri, kan? Candaan yang kita anggap remeh, ternyata bisa ngegerogoti iman kita pelan-pelan.</li>\n                    <li><strong>Jadi Kebiasaan Buruk:</strong> Yang namanya bohong, sekali dicoba, bisa ketagihan. Dari bohong kecil buat bercanda, bisa jadi kebiasaan bohong buat hal-hal serius.</li>\n                </ul>\n\n                <p>Jadi, intinya, yuk kita jaga lisan kita. Masih banyak kok cara buat bikin suasana asyik dan ketawa bareng tanpa harus nyelipin kebohongan. Integritas kita jauh lebih berharga daripada sekadar tawa sesaat.</p>\n                \n                <figure>\n                    <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgHk84VAQlbynj6-iig-LJwXwx9fUGhRb_GLw8TRhyphenhyphenwDFL5tzOIz2U7LDAOhmmCxgHiiFEM1RteNd6vNJrKlYYOlRSappFm18D3gEuNygF7PXxOSXUIyQOqH9kL7C1WgmCVLL0yG7BLi75XgDyRJvlZhTz1LusbTp2NnzUi15ozPAedKwv_Y8GI-iPoxgA/s600/janganbohong3.jpg.webp\" alt=\"Menjaga lisan dari kebohongan\">\n                </figure>\n<section id=\"comment-section\">\n                    \n                </section>\n            </section>"
  },
  "meta": {
    "summary": "Renungan tentang pentingnya kejujuran lisan, bahkan dalam bercanda. Menjaga integritas adalah menjaga iman. Celakalah orang yang berbohong untuk membuat orang tertawa.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Renungan tentang pentingnya kejujuran lisan, bahkan dalam bercanda. Menjaga integritas adalah menjaga iman. Celakalah orang yang berbohong untuk membuat orang tertawa."
  }
}