{
  "id": "islam-indonesia-merdeka-ramadhan",
  "slug": "islam-indonesia-merdeka-ramadhan",
  "title": "Islam, Indonesia Merdeka, dan Ramadhan - syukur, sejarah, dan inspirasi",
  "category": "📚 Sejarah & Religi",
  "published_at": "2025-04-02T08:24:29.849+00:00",
  "url": "https://dalam.web.id/artikel/islam-indonesia-merdeka-ramadhan.html",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_Indonesia.svg/1200px-Flag_of_Indonesia.svg.png",
  "content_plain": "Semua yang mulia dalam sejarah punya momen emas. Ramadhan menyapa dengan tenang, Indonesia lahir dengan gagah. Di antara keduanya, kita belajar bersyukur: pada wahyu yang menuntun, pada pahlawan yang berkorban, dan pada setiap detik yang meneguhkan. Catatan hangat: daftar dan tanggal di bawah merangkum tradisi pengetahuan umat tentang momen istimewa Ramadhan. Tujuan utamanya untuk mengingat, merenung, dan mengambil hikmah—bukan untuk berdebat kusir. Turunnya kitab suci di bulan Ramadhan Taurat: kepada Nabi Musa AS - bahasa Ibrani. Zabur: kepada Nabi Daud AS - bahasa Qibti. Injil: kepada Nabi Isa AS - bahasa Suryani. Al-Qur’an: kepada Nabi Muhammad SAW - bahasa Arab. Pahlawan muslim pejuang kemerdekaan Indonesia Kepada para pendahulu, kita kirim doa terbaik. Beberapa nama yang sering disebut: Cut Nyak Dhien dan Cut Nyak Meutia KH Ahmad Dahlan Kapiten Pattimura Laksamana Keumalahayati Pangeran Diponegoro Panglima Polem Sultan Ageng Tirtayasa Sultan Agung Prabu Hanyokrokusumo Sultan Hasanuddin Sultan Iskandar Muda Sultan Mahmud Badaruddin II Teuku Chik Ditiro dan Teuku Umar Tuanku Imam Bonjol Dan masih banyak lagi (lebih dari 126 pahlawan nasional). Lihat daftar di Wikipedia. Peristiwa penting di bulan Ramadhan Penghancuran berhala Latta, Uzza, dan Manat milik kaum Quraisy. Ramadhan 2 H: Kemenangan Perang Badar. Ramadhan 8 H: Fathu Makkah - pembebasan Makkah. Ramadhan 223 H: Khalifah Al-Mu’tasim mengepung ‘Amuriyah (Bizantium). Ramadhan 361 H: Peletakan pondasi Jami’ Al-Azhar (Mesir) oleh Panglima Jauhar Ash-Shiqilli. Ramadhan 587 H: Penguasaan kota ‘Asqalan, gerbang menuju Al-Quds. Ramadhan 666 H: Penaklukan benteng kuat di Anthokiah oleh Panglima Dhohir Bibris. Ramadhan 732 H: Lahirnya Ibnu Khaldun (Abdurrahman bin Muhammad bin Khaldun). Ramadhan 825 H: Sultan Murad II mengepung Qostantiniyah (Konstantinopel). Ramadhan 1393 H: Tentara Mesir menembus Terusan Suez dan menghantam Benteng Bar Lev. Ramadhan 1393 H: Aksi mendadak pasukan Palestina di Ramallah terhadap kekuatan Israel. 8 Ramadhan 1364 H (17 Agustus 1945 M): Indonesia Merdeka. Doa penutup: Alhamdulillah kita dipertemukan dengan Ramadhan 1431 H (nuansa tulisan ini), dan kala itu menyambut HUT RI ke-65 (2010). Semoga syukur tak putus sampai hari ini. Galeri kebangsaan dan Ramadhan Kumpulan visual untuk menguatkan rasa: merah-putih, bulan sabit, dan jejak sejarah. Merah Putih - merdeka itu amanah.",
  "meta": {
    "summary": "Mengulas keistimewaan Ramadhan, turunnya kitab-kitab suci, para pahlawan muslim, dan momen kemerdekaan Indonesia. Santai, ceria, dan penuh syukur.",
    "prompt_hint": "Mengulas keistimewaan Ramadhan, turunnya kitab-kitab suci, para pahlawan muslim, dan momen kemerdekaan Indonesia. Santai, ceria, dan penuh syukur.",
    "keywords": [],
    "topics": []
  }
}