{
  "id": "iwan-fals-bangunlah-putra-putri-pertiwi",
  "slug": "iwan-fals-bangunlah-putra-putri-pertiwi",
  "title": "Iwan Fals — Bangunlah Putra Putri Pertiwi (Lirik & Video)",
  "category": "🔆 Lainnya",
  "published_at": "2014-10-28T16:59:50.000+00:00",
  "url": "https://dalam.web.id/artikel/iwan-fals-bangunlah-putra-putri-pertiwi.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhH_w_zA2fJjUFKoQ5NKqR46TSuYZEIyv914i3QH3axfK6vKQ6wVWp2b7j6xhsG35i5T0S5iwwjXEY8mpzJwLmDsTcW10EO5-TPJ2CE0jC9uOs9YgnmZzAlGXVb-PGRq0OvY_EklhDvuoXU/s1600/IMG_20141029_005950.jpg",
  "content": "Iwan Fals — Bangunlah Putra Putri Pertiwi Semangat pagi, garuda, merah putih, dan ajakan bangun. Putar videonya, baca liriknya, resapi pesannya. 🎧 Video + Lirik Putar lagu, hidupkan semangat Kalimat sederhana yang mengetuk: bangun, rapikan diri, lalu berjanji. Sebuah pengingat ringan, tapi tegas. Lirik Sinar matamu tajam namun ragu Kokoh sayapmu semua tahu Tegap tubuhmu takkan tergoyahkan Kuat jarimu kalau mencengkeram Bermacam suku yang berbeda Bersatu dalam cengkerammu Angin genit mengelus merah putihku Yang berkibar sedikit malu-malu Merah membara tertanam wibawa Putihmu suci penuh kharisma Pulau-pulau yang berpencar Bersatu dalam kibarmu Terbanglah garudaku Singkirkan kutu-kutu di sayapmu Berkibarlah benderaku Singkirkan benalu di tiangmu Jangan ragu dan jangan malu Tunjukkan pada dunia Bahwa sebenarnya kita mampu Mentari pagi sudah membumbung tinggi Bangunlah putra putri ibu pertiwi Mari mandi dan gosok gigi Setelah itu kita berjanji Tadi pagi esok hari atau lusa nanti Garuda bukan burung perkutut Sang saka bukan sandang pembalut Dan coba kau dengarkan Pancasila itu bukanlah rumus kode buntut Yang hanya berisi harapan Yang hanya berisi khayalan 1 / 1",
  "meta": {
    "summary": "Baca lirik dan putar video Iwan Fals — Bangunlah Putra Putri Pertiwi. Nuansa semangat kebangsaan dengan desain fullscreen, interaktif, dan mobile-friendly.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Baca lirik dan putar video Iwan Fals — Bangunlah Putra Putri Pertiwi. Nuansa semangat kebangsaan dengan desain fullscreen, interaktif, dan mobile-friendly."
  }
}