{
  "id": "janganlah-sombong",
  "slug": "janganlah-sombong",
  "title": "Janganlah Sombong - Tafsir, Bahaya, dan Jalan Menjauhi Takabbur",
  "category": "📚 Sejarah & Religi",
  "published_at": "2025-04-02T08:24:29.850+00:00",
  "url": "https://dalam.web.id/artikel/janganlah-sombong.html",
  "image": "https://dalam.web.id/img/janganlah-sombong.webp",
  "content_plain": "Diperbarui: — Penulis: RefleksiAkhlaq.id Sombong menurut Rasulullah SAW Sombong, sebagaimana didefinisikan oleh Rasulullah SAW, adalah melecehkan orang lain dan menolak kebenaran (HR. Muslim dan Tirmidzi). Penyakit hati ini merusak tatanan moral masyarakat: menghapus rasa hormat, menghancurkan sopan santun, dan menjadikan kebenaran sebagai mainan. Hadits inti: \"Tidak akan masuk surga orang yang di dalam hatinya ada kesombongan sebesar dzarrah (atom).\" (HR. Muslim) Mengapa Kesombongan Berbahaya? Kesombongan membuka pintu untuk beragam perilaku tercela: kezaliman, kemarahan yang tak terkendali, permusuhan, dan pelanggaran hak. Seseorang yang sombong cenderung menilai dirinya sempurna dan menempatkan dirinya di atas orang lain. Sumber-sumber Kesombongan Di antara sumber utama kesombongan adalah: Nasab / Keturunan. Mereka yang bangga karena garis keturunan sering merendahkan orang lain, meski dari sisi ilmu atau amal lebih rendah. Kisah Bilal bin Rabah yang pernah diremehkan karena asal usulnya adalah contoh nyata. Harta / Kekayaan. Raja, pemimpin, konglomerat, atau pejabat yang bangga akan harta dan kedudukan dapat merendahkan orang lain. Kisah Qarun adalah peringatan nyata tentang bahaya sombong karena harta. Ilmu Pengetahuan. Ilmu yang tidak disertai ketawadhu'an dan niat ikhlas mudah menjadi sumber kesombongan: seorang berilmu merasa lebih mulia daripada yang lain. Amal dan Ibadah. Orang yang beramal secara riya atau merasa lebih selamat daripada orang lain bisa jatuh ke dalam sikap merendahkan sesama. Kecantikan / Ketampanan. Rupa paras yang elok kadang menumbuhkan rasa superior dan mengolok-olok yang kurang beruntung dari segi rupa. Akibat Spiritual dan Sosial Kesombongan menutup pintu-pintu akhlak mulia yang menjadi jalan masuk surga. Orang yang sombong sulit mencintai saudara seiman sebagaimana mencintai diri sendiri, sehingga terputuslah rasa persaudaraan, saling tolong, dan kesetaraan dalam masyarakat. Cara Menjauhi dan Menyembuhkan Kesombongan Berikut beberapa langkah praktis yang dapat dilakukan: Tausiyah dan introspeksi: Sering mengevaluasi niat (ihsan) dalam setiap tindakan; tanyakan pada diri, \"Apakah aku mencari ridha Allah atau pujian manusia?\" Mengingatkan kematian: Kesadaran bahwa hidup sementara dan mati akan mempertanggungjawabkan semua amal merendahkan kebanggaan duniawi. Belajar rendah hati dari teladan: Mengkaji sirah para sahabat dan ulama yang dikenal tawadhu'. Bergaul luas: Menjaga ukhuwah antar golongan, tidak eksklusif berdasarkan nasab, harta, atau kedudukan. Perbanyak amal sosial: Membantu fakir miskin dan berbuat baik tanpa pamrih menumbuhkan empati dan memadamkan sikap superior. Perbaiki ilmu dengan adab: Menuntut ilmu disertai niat ikhlas dan adab supaya ilmu melahirkan tawadhu', bukan kesombongan. Semoga Allah menjaga hati kita dari penyakit sombong, dan memudahkan kita untuk bersikap tawadhu' serta menjaga persaudaraan.",
  "meta": {
    "summary": "Penjelasan tentang kesombongan (takabbur) menurut Rasulullah SAW, sumber-sumbernya (nasab, harta, ilmu, amal), dampak sosial dan spiritual, serta cara-cara menanggulanginya.",
    "prompt_hint": "Penjelasan tentang kesombongan (takabbur) menurut Rasulullah SAW, sumber-sumbernya (nasab, harta, ilmu, amal), dampak sosial dan spiritual, serta cara-cara menanggulanginya.",
    "keywords": [],
    "topics": []
  }
}