{
  "id": "jurnal1-oktober-2025",
  "slug": "jurnal1-oktober-2025",
  "title": "Jurnal Teknologi & AI: Edisi Oktober 2025 | Layar Kosong",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-12-18T12:42:07.202+00:00",
  "url": "https://dalam.web.id/artikel/jurnal1-oktober-2025.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiOvn9ps-0bg6eK_QxJbZI4dF2XBEa_ozv6CjmCBnT3-ZudQxiH-edtSJBDn0GSDEyGUlWk4JfXzwlsieG_OhatsswjQ76EAp1BHS99YBi8OcTMIlbh-ZB47eZrJmpXxRE-YMkgzxtDifZSKFrGHbXtS3Rkes1TfINcyidMilaVwjCRE_TebYvTNktxCHg/s1600/2025-10.webp",
  "content": {
    "text": "Jurnal Teknologi: Oktober 2025 🚀 Topik Utama: Disrupsi AI di Kantor, Otomatisasi GitHub \"Gila-gilaan\", dan Nostalgia Windows XP. Catatan dari Aku: Halo kawan-kawan! Oktober 2025 yang lalu rasanya seperti bulan \"bersih-bersih dan persiapan\". Kenapa? Karena di satu sisi kita melihat ancaman nyata AI terhadap pekerjaan administratif (HR & IT), tapi di sisi lain, kita juga diberi 'senjata' berupa skrip otomatisasi yang luar biasa banyak. Aku menulis lebih dari 70 artikel bulan ini, tapi di halaman ini aku sarikan menjadi 4 pilar utama yang boleh kamu baca. Kita akan belajar cara bikin mesin kita kerja sendiri lewat GitHub Actions, mengamankan karir dari robot, dan sedikit nostalgia soal pembajakan legendaris. Yuk, disimak! ☕ 1. Karir di Ujung Tanduk: HR & IT vs AI Ini bahasan yang agak berat tapi penting. Data menunjukkan peran administratif di HR dan IT Support adalah yang paling rentan. Tapi, bukan berarti kiamat. Aku bahas strateginya di sini. Analisis Karir • 30 Oktober Peran HR & IT yang Paling Cepat Tergantikan AI Jangan cuma takut, tapi pahami kenapa peran ini digantikan. Jawabannya ada di pola kerja repetitif. Artikel ini ngasih solusi teknis soal upskilling dan konsep human-in-the-loop biar kamu tetap relevan. Strategi • 30 Oktober Evolusi Recruiter: Dari Perekrut ke Talent Strategist Recruiter masa depan nggak lagi sibuk sortir CV manual. Mereka berubah jadi konsultan strategi bakat yang menggunakan data AI. Transformasi ini boleh hukumnya kalau nggak mau ketinggalan. 2. GitHub Actions & Node.js Magic Bulan ini aku banyak banget ngoprek skrip. Tujuannya satu: biar kita bisa malas dengan produktif. Biarkan robot yang kerja. DevOps • 29 Oktober Bedah Workflow: upgrade-everything.yml Capek update dependensi manual? Workflow ini otomatis nge-cek update, jalankan tes, dan bikin Pull Request sendiri. Hidup developer jadi jauh lebih tenang. Scripting • 29 Oktober Generate Ikon PWA & Manifest Otomatis Bikin ikon aplikasi itu ngebosenin. Skrip generate-icons.js ini bakal generate semua ukuran ikon iOS/Android dan file manifest cuma dari satu file SVG. Utility • 29 Oktober Markdown.js: Highlight Kode di HTML Cara simpel buat bikin tampilan kode di blog kamu jadi cantik dengan syntax highlighting, tanpa perlu library yang berat-berat. 3. Menguasai Git & Workflow Tim Git itu gampang-gampang susah. Bulan ini kita bedah trik-trik yang jarang diajarin di bootcamp. Tips Git • 22 Oktober Kecilkan Ukuran Repo: Bye Bye node_modules! Pernah nggak sengaja commit node_modules? Repomu jadi bengkak? Ini cara bersihin history Git biar repo kembali langsing dan cepat di-clone. Automation • 13 Oktober Paket gh-force-tools: Otomatisasi Merge Kumpulan tool CLI buat kamu yang suka 'maksa' (dalam artian positif). Otomatis merge branch yang bandel atau bersihin branch sisa-sisa development. 4. Sejarah & Wawasan Tech Biar nggak coding melulu, kita flashback sedikit ke masa lalu dan bahas hal-hal fundamental. Sejarah • 19 Oktober Kisah FCKGW: Kode Bajakan Paling Legendaris Anak warnet pasti tahu kode ini. Ternyata FCKGW bukan hasil crack, tapi kebocoran lisensi volume korporat. Baca kisah seru di balik kode yang menghantui Microsoft ini. Web Tech • 13 Oktober Evolusi Browser Engine: Dari KHTML ke Blink Pernah mikir kenapa Chrome dan Safari itu mirip? Ternyata mereka punya nenek moyang yang sama, yaitu KHTML dari Linux. Ini timeline evolusinya. Web Tech • 2 Oktober Dampak rel=noreferrer Tanpa target=_blank Sering asal copy-paste kode link? Hati-hati, penggunaan atribut ini bisa bikin data analitik kamu kacau balau kalau nggak dipasang barengan sama target blank.",
    "html": "<header>\n        <h1>Jurnal Teknologi: Oktober 2025 🚀</h1>\n<div id=\"iposbrowser\"></div>\n        <p><strong>Topik Utama:</strong> Disrupsi AI di Kantor, Otomatisasi GitHub \"Gila-gilaan\", dan Nostalgia Windows XP.</p>\n    </header>\n\n    <div class=\"editor-note\">\n        <p><i class=\"fa-solid fa-quote-left\"></i> <strong>Catatan dari Aku:</strong></p>\n        <p>Halo kawan-kawan! Oktober 2025 yang lalu rasanya seperti bulan \"bersih-bersih dan persiapan\". Kenapa? Karena di satu sisi kita melihat ancaman nyata AI terhadap pekerjaan administratif (HR &amp; IT), tapi di sisi lain, kita juga diberi 'senjata' berupa skrip otomatisasi yang luar biasa banyak.</p>\n        <p>Aku menulis lebih dari 70 artikel bulan ini, tapi di halaman ini aku sarikan menjadi 4 pilar utama yang boleh kamu baca. Kita akan belajar cara bikin mesin kita kerja sendiri lewat GitHub Actions, mengamankan karir dari robot, dan sedikit nostalgia soal pembajakan legendaris. Yuk, disimak! ☕</p>\n    </div>\n\n    <section class=\"article-group\">\n        <h2><i class=\"fa-solid fa-briefcase\"></i> 1. Karir di Ujung Tanduk: HR &amp; IT vs AI</h2>\n        <p>Ini bahasan yang agak berat tapi penting. Data menunjukkan peran administratif di HR dan IT Support adalah yang paling rentan. Tapi, bukan berarti kiamat. Aku bahas strateginya di sini.</p>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Analisis Karir • 30 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/peran-hr-it-cepat-tergantikan-ai.html\" class=\"article-title\">Peran HR &amp; IT yang Paling Cepat Tergantikan AI</a>\n            <p>Jangan cuma takut, tapi pahami <em>kenapa</em> peran ini digantikan. Jawabannya ada di pola kerja repetitif. Artikel ini ngasih solusi teknis soal <em>upskilling</em> dan konsep <em>human-in-the-loop</em> biar kamu tetap relevan.</p>\n        </div>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Strategi • 30 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/evolusi-recruiter-ai.html\" class=\"article-title\">Evolusi Recruiter: Dari Perekrut ke Talent Strategist</a>\n            <p>Recruiter masa depan nggak lagi sibuk sortir CV manual. Mereka berubah jadi konsultan strategi bakat yang menggunakan data AI. Transformasi ini boleh hukumnya kalau nggak mau ketinggalan.</p>\n        </div>\n    </section>\n\n    <section class=\"article-group\">\n        <h2><i class=\"fa-brands fa-github\"></i> 2. GitHub Actions &amp; Node.js Magic</h2>\n        <p>Bulan ini aku banyak banget ngoprek skrip. Tujuannya satu: biar kita bisa malas dengan produktif. Biarkan robot yang kerja.</p>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">DevOps • 29 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/penjelasan-workflow-upgrade-everything-yml.html\" class=\"article-title\">Bedah Workflow: upgrade-everything.yml</a>\n            <p>Capek update dependensi manual? Workflow ini otomatis nge-cek update, jalankan tes, dan bikin Pull Request sendiri. Hidup developer jadi jauh lebih tenang.</p>\n        </div>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Scripting • 29 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/penjelasan-generate-icons-js.html\" class=\"article-title\">Generate Ikon PWA &amp; Manifest Otomatis</a>\n            <p>Bikin ikon aplikasi itu ngebosenin. Skrip <code>generate-icons.js</code> ini bakal generate semua ukuran ikon iOS/Android dan file manifest cuma dari satu file SVG.</p>\n        </div>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Utility • 29 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/penjelasan-markdown-js.html\" class=\"article-title\">Markdown.js: Highlight Kode di HTML</a>\n            <p>Cara simpel buat bikin tampilan kode di blog kamu jadi cantik dengan syntax highlighting, tanpa perlu library yang berat-berat.</p>\n        </div>\n    </section>\n\n    <section class=\"article-group\">\n        <h2><i class=\"fa-solid fa-code-branch\"></i> 3. Menguasai Git &amp; Workflow Tim</h2>\n        <p>Git itu gampang-gampang susah. Bulan ini kita bedah trik-trik yang jarang diajarin di bootcamp.</p>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Tips Git • 22 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/git-repo-size-reduction.html\" class=\"article-title\">Kecilkan Ukuran Repo: Bye Bye node_modules!</a>\n            <p>Pernah nggak sengaja commit <code>node_modules</code>? Repomu jadi bengkak? Ini cara bersihin history Git biar repo kembali langsing dan cepat di-clone.</p>\n        </div>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Automation • 13 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/gh-force-tools-index.html\" class=\"article-title\">Paket gh-force-tools: Otomatisasi Merge</a>\n            <p>Kumpulan tool CLI buat kamu yang suka 'maksa' (dalam artian positif). Otomatis merge branch yang bandel atau bersihin branch sisa-sisa development.</p>\n        </div>\n    </section>\n\n    <section class=\"article-group\">\n        <h2><i class=\"fa-solid fa-floppy-disk\"></i> 4. Sejarah &amp; Wawasan Tech</h2>\n        <p>Biar nggak coding melulu, kita flashback sedikit ke masa lalu dan bahas hal-hal fundamental.</p>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Sejarah • 19 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/fckgw-windows-xp.html\" class=\"article-title\">Kisah FCKGW: Kode Bajakan Paling Legendaris</a>\n            <p>Anak warnet pasti tahu kode ini. Ternyata FCKGW bukan hasil crack, tapi kebocoran lisensi volume korporat. Baca kisah seru di balik kode yang menghantui Microsoft ini.</p>\n        </div>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Web Tech • 13 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/evolusi-browser-engine.html\" class=\"article-title\">Evolusi Browser Engine: Dari KHTML ke Blink</a>\n            <p>Pernah mikir kenapa Chrome dan Safari itu mirip? Ternyata mereka punya nenek moyang yang sama, yaitu KHTML dari Linux. Ini timeline evolusinya.</p>\n        </div>\n\n        <div class=\"article-card\">\n            <span class=\"article-meta\">Web Tech • 2 Oktober</span>\n            <a href=\"https://dalam.web.id/artikel/noreferrer-tanpa-target-blank.html\" class=\"article-title\">Dampak rel=noreferrer Tanpa target=_blank</a>\n            <p>Sering asal copy-paste kode link? Hati-hati, penggunaan atribut ini bisa bikin data analitik kamu kacau balau kalau nggak dipasang barengan sama target blank.</p>\n        </div>\n    </section>\n        <div id=\"pesbukdiskus\"></div>"
  },
  "meta": {
    "summary": "Rangkuman mendalam Oktober 2025: Analisis dampak AI pada HR & IT, kumpulan skrip otomatisasi GitHub Actions, Node.js tools, hingga sejarah kelam Windows XP.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Rangkuman mendalam Oktober 2025: Analisis dampak AI pada HR & IT, kumpulan skrip otomatisasi GitHub Actions, Node.js tools, hingga sejarah kelam Windows XP."
  }
}