{
  "id": "kereta-api-di-terminal-sl",
  "slug": "kereta-api-di-terminal-sl",
  "title": "SL di Terminal: Kereta Api Nyelonong Gara-gara Salah Ketik",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-05-17T23:20:38.188+00:00",
  "url": "https://dalam.web.id/artikel/kereta-api-di-terminal-sl.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiGZbA0kod-u1RbKj1qnRoLL-5fxRo_pP8HV-oUiHJ7wOAOXKMpha5_dvIbLQgDG023nfPcKVzhqzW0JLi658am_pkq_CJlikqnJs5xfJicpQDsOVhsOr6nk5_ENfkrNHY0MWZYE0xuNGamDKNN416ZQfIGvYWkDB-LEB357dNToSA6bXw6FxjwdTQD_SM/s1920/sl-linux.gif",
  "content_plain": "SL di Terminal: Kereta Api Nyelonong Gara-gara Salah Ketik Sepoor, kreto, sepur, kereta api - semua sama. Dan kali ini, dia lewat di terminal karena kamu salah ketik ls jadi sl. Serius. 21 Sep 2025 • Linux Fun Kisah bermula dari salah ketik Pengen lihat isi direktori, niatnya ngetik ls. Eh jari kebablasan jadi sl. Muncul pesan: The program 'sl' is currently not installed. You can install it by typing: sudo apt-get install sl Salin Karena penasaran, ya sudah… dipasang saja. Dan begitu ketik sl, jreng - kereta api ASCII melintas gagah di terminal! Animasi SL - siap-siap ketagihan. Apa itu SL? SL adalah program kecil nan legendaris yang menampilkan animasi kereta api ASCII di terminal. Didesain untuk “menghibur” (dan sedikit mengejek) kita yang sering salah ketik ls. Instal cepat sudo apt-get update && sudo apt-get install -y sl Jalankan sl Opsi lucu sl -a (mengerikan), sl -l (kereta panjang), sl -F (kereta terbang - iya, serius) Galeri: bukti nyelonong “The program 'sl' is currently not installed.” Instal SL via apt - secepat kereta Argo. Kereta ASCII lewat. Stasiun? Nanti dulu… Referensi Paket SL (Ubuntu) Repositori SL (GitHub mirror tidak resmi) ✕",
  "meta": {
    "summary": "Salah ketik ls jadi sl? Ternyata muncul kereta api lewat di terminal! Yuk kenalan dengan paket SL yang kocak dan nostalgia.",
    "prompt_hint": "Salah ketik ls jadi sl? Ternyata muncul kereta api lewat di terminal! Yuk kenalan dengan paket SL yang kocak dan nostalgia.",
    "keywords": [],
    "topics": []
  }
}