{
  "id": "keutamaan-salam",
  "slug": "keutamaan-salam",
  "title": "Keutamaan Mengucapkan Salam",
  "category": "📚 Sejarah & Religi",
  "published_at": "2025-04-02T08:24:29.851+00:00",
  "url": "https://dalam.web.id/artikel/keutamaan-salam.html",
  "image": "https://dalam.web.id/img/keutamaan-salam.webp",
  "content": {
    "text": "Keutamaan Mengucapkan Salam Setiap Muslim ketika mengucapkan salam kepada saudaranya, dia akan diganjar dengan kebaikan (pahala). Dalam kaidah singkat menyingkat pun sudah diatur oleh Allah dan diajarkan kepada Rasulullah. Dalam suatu pertemuan bersama Rasulullah, seorang sahabat datang dan melewati beliau sambil mengucapkan: Assalamu ‘alaikum Rasulullah bersabda: \"Orang ini mendapat 10 pahala kebaikan.\" Tak lama kemudian datang sahabat lainnya dan mengucapkan: Assalamu‘alaikum Warahmatullah Kata Rasulullah: \"Orang ini mendapat 20 pahala kebaikan.\" Kemudian lewat lagi seorang sahabat berikutnya sambil mengucapkan: Assalamu ‘alaikum warahmatullah wa baraokatuh Rasulullah bersabda: \"Ia mendapat 30 pahala kebaikan.\" [HR. Ibnu Hibban dari Abi Hurairah] Hati-hati dengan bacaan ini Satu hal lagi yang perlu diingat adalah ketika kita menuliskan kata Assalamu'alaikum, perlu diperhatikan agar jangan sampai huruf L nya tertinggal sehingga menjadi Assaamu'alaikum. Diriwayatkan bahwa dahulu ada seorang Yahudi yang memberi salam kepada Nabi dengan ucapan Assaamu 'alaika ya Muhammad (artinya kematian). Nabi bersabda: \"Kalau orang kafir mengatakan padamu assaamu 'alaikum, maka jawablah dengan 'Wa 'alaikum'.\" [HR. Bukhari] Bagaimana di era modern? Lalu bagaimanakah ketika pada jaman sekarang muncul banyak singkatan seperti: \"Ass\" - \"Asswrwb\" dan sebagainya? Bagaimanakah kita menjawabnya? Tentunya jawabannya tetap dengan niat baik dan sunnah Nabi."
  },
  "meta": {
    "summary": "Setiap Muslim ketika mengucapkan salam kepada saudaranya akan diganjar pahala. Pelajari keutamaan salam menurut hadits dan bagaimana menjawab salam di era modern.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Setiap Muslim ketika mengucapkan salam kepada saudaranya akan diganjar pahala. Pelajari keutamaan salam menurut hadits dan bagaimana menjawab salam di era modern."
  }
}