{
  "id": "kisah-sebarubuntu-2014",
  "slug": "kisah-sebarubuntu-2014",
  "title": "Kisah #SebarUbuntu 2014: Saat Komunitas Ubuntu Jogja Turun ke Jalan",
  "category": "🐧 Linux & Open Source",
  "published_at": "2014-01-31T17:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/kisah-sebarubuntu-2014.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg9ldpPK6bVRUFqRLJQY8eIOhpeC10J0pbixK8-SWDOvI5NQoJhJ8nf86y3-Nc2f-J_QamXXcrYDceB21Lb71cy2hyphenhyphenFOzSPBFnk1JP1dp72ikRg7ZXOvXbJD3n4NRTxWtcqWAb9sQc-Auo/s1600/sebarubuntu1.jpg",
  "content_plain": "Dari Pesta Rilis ke Aksi Jalanan Biasanya, setiap rilis baru Ubuntu—seperti Ubuntu 13.10 \"Saucy Salamander\" pada Oktober 2013—dirayakan dengan acara meriah yang dikenal sebagai Saucy Release Party. Namun, kali ini Komunitas Ubuntu Jogja memutuskan untuk mencoba sesuatu yang berbeda dan lebih personal. Alih-alih pesta seremonial, mereka meluncurkan kampanye keren bertajuk #SebarUbuntu. Gerakan ini berlangsung selama dua minggu penuh, dari 1 hingga 14 Februari 2014, dengan konsep yang sederhana tapi mengena: di mana pun ada pengguna Ubuntu, di situ panitia akan membagikan stiker kece dengan logo resmi Komunitas Ubuntu Indonesia. Intinya: Ini adalah pengganti Saucy Release Party. Persiapan dimulai akhir Januari dan eksekusinya fleksibel selama dua minggu pertama Februari 2014. Targetnya simpel: membuat Ubuntu makin kelihatan, terasa dekat, dan menyenangkan. Meskipun ada sedikit kendala teknis di awal persiapan, semangatnya tidak padam. Aksi ini menjadi cara yang lebih cair dan langsung untuk merayakan rilis baru, sekaligus mengapresiasi para pengguna setia Ubuntu di Jogja dan sekitarnya. Ini bukti kreativitas dan semangat berbagi dari komunitas open source di Indonesia!",
  "meta": {
    "summary": "Gabungan cerita dari aksi #SebarUbuntu 2014. Ketika Saucy Release Party ditiadakan, Komunitas Ubuntu Jogja membuat gerakan seru membagikan stiker dan bertemu pengguna langsung.",
    "prompt_hint": "Gabungan cerita dari aksi #SebarUbuntu 2014. Ketika Saucy Release Party ditiadakan, Komunitas Ubuntu Jogja membuat gerakan seru membagikan stiker dan bertemu pengguna langsung.",
    "keywords": [],
    "topics": []
  }
}