{
  "id": "kpli-balikpapan-rilis-party-ubuntu-1604",
  "slug": "kpli-balikpapan-rilis-party-ubuntu-1604",
  "title": "KPLI Balikpapan - Rilis Party Ubuntu 16.04 di DiLo Telkom",
  "category": "🐧 Linux & Open Source",
  "published_at": "2016-06-13T01:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/kpli-balikpapan-rilis-party-ubuntu-1604.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi0G0CmQTaZs6urVT76FlTnTwKBRrmggA4euVQHZLzHV0on0D8-iffJla7vs01N56H21vRo_D158UcBRxhqF6-AVdS1AgJsAILQjyxVUKufjAXh6Scf_MKhfLcuRvhmDUqkKXBuDe2OmA5L/s1600/IMG_20160612_141504.jpg",
  "content_plain": "Ngisi waktu luang yang produktif Berangkat dari semangat berbagi, KPLI Balikpapan ngajak adik-adik pelajar SMK kenalan sama Ubuntu 16.04. Mulai dari rilis highlights, cara bikin media instalasi, sampai tips pasca-instalasi biar sistem langsung siap dipakai. Di sela materi, kita juga ngobrol santai soal kultur open source kenapa legal itu keren, dan bagaimana kontribusi kecil bisa berdampak panjang buat ekosistem. KPLI itu apa sih? KPLI adalah Komunitas Pengguna Linux Indonesia, organisasi nirlaba yang fokus pada gerakan sosial berbasis komunitas untuk menyebarkan literasi TI, khususnya Linux dan perangkat lunak open source. Sejarah singkat Didirikan di Jakarta pada 31 Oktober 1998 dengan nama KPLI-Jakarta, komunitas ini jadi wadah pengguna & pemerhati Linux, mendorong penggunaan perangkat lunak gratis dan terbuka. Seiring waktu, KPLI tumbuh jadi payung banyak Linux User Group (LUG) di berbagai kota. KPLI di Balikpapan Di Balikpapan, diskusi Linux dan open source berkembang dari grup daring dan kopdar santai, lalu merambat ke kegiatan edukasi praktis seperti rilis party ini merangkul sekolah, kampus, dan komunitas teknologi setempat.",
  "meta": {
    "summary": "KPLI Balikpapan ngisi waktu luang bareng pelajar SMK: rilis party Ubuntu 16.04 di ruang DiLo Telkom. Cerita, foto, dan semangat open source.",
    "prompt_hint": "KPLI Balikpapan ngisi waktu luang bareng pelajar SMK: rilis party Ubuntu 16.04 di ruang DiLo Telkom. Cerita, foto, dan semangat open source.",
    "keywords": [],
    "topics": []
  }
}