{
  "id": "kutai-kartanegara-oss-2010",
  "slug": "kutai-kartanegara-oss-2010",
  "title": "OSS Kutai Kartanegara 2010 - Sosialisasi & Migrasi",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-04-02T12:38:48.547+00:00",
  "url": "https://dalam.web.id/artikel/kutai-kartanegara-oss-2010.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi1UyeLmW3xXbYWK52wxfAaWeToDtM6BVqNXGyDjNQ2LMtvfVSHZVOk5D3t29vj5NncO6vnF7fZzwBXwtl-mqwcXGBuiuEOBuO2ZEVWS8MfQbMo5uBD-jVHeVjZgWK3b4get9paJmAQAxRU_w4CneNqCnIj-wtGfS0RnEd2Ni11bhgcYKMP0QU-owOo914/s1600/Gemini_Generated_Image_rar5ysrar5ysrar5.png",
  "content": "Open Source Sosialisasi & Migrasi Kutai Kartanegara OSS Kutai Kartanegara 2010 - dari sosialisasi ke aksi Semangat bareng: legal, terbuka, dan kolaboratif. Dari aula sosialisasi ke ruang-ruang kerja SKPD—OSS dibawa jalan beneran. 4–8 Oktober 2010 • Pemda Kab. Kutai Kartanegara Highlight singkat: Sosialisasi dibuka Wakil Bupati, lanjut migrasi & pelatihan 5–8 Okt, bareng Makara UI, KPLI Balikpapan, dan POSS Unmul. Narasumber hadir dari Kemenristek, Kominfo, POSS ITB, dan Onno Purbo. Cerita acaranya Dalam rangka gerakan penggunaan perangkat lunak legal berbasis Open Source, Kemenristek pada 4 Oktober 2010 ngadain Sosialisasi Pemanfaatan Perangkat Lunak Legal & OSS di lingkungan Pemda Kutai Kartanegara. Acaranya dibuka resmi sama Wakil Bupati, didampingi Kadis Kominfo Kukar sebagai tuan rumah lokal. Sosialisasi ini lanjut ke tahap penting: migrasi dan pelatihan OSS di seluruh SKPD, tanggal 5–8 Oktober 2010. Tim teknisnya gabungan: Makara UI, Komunitas OSS - KPLI Balikpapan, dan POSS Universitas Mulawarman. Gak cuma materi, tapi langsung praktik biar layanan publik bisa nikmatin manfaat OSS yang legal, hemat biaya, dan fleksibel. Audiensnya beragam: pimpinan SKPD, guru, mahasiswa, dan komunitas OSS setempat. Narasumber hadir dari Kemenristek (Kasubid Promosi IPTEK Industri Strategis), Kominfo (Kasubdit Interoperabilitas), POSS ITB, dan Onno Purbo. Harapannya, model migrasi ini jadi implementasi nyata dan tindak lanjut Surat Edaran MenPAN soal penggunaan perangkat lunak legal dan OSS. Galeri foto",
  "meta": {
    "summary": "Ringkasan santai dan interaktif dari Sosialisasi Pemanfaatan Perangkat Lunak Legal & Open Source di Pemda Kutai Kartanegara (4–8 Okt 2010): agenda, narasumber, foto, dan spirit migrasi OSS.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Ringkasan santai dan interaktif dari Sosialisasi Pemanfaatan Perangkat Lunak Legal & Open Source di Pemda Kutai Kartanegara (4–8 Okt 2010): agenda, narasumber, foto, dan spirit migrasi OSS."
  }
}