{
  "id": "laptop-pertama-osborne1",
  "slug": "laptop-pertama-osborne1",
  "title": "Osborne 1 - Laptop Pertama Dunia",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-02-12T00:31:19.948+00:00",
  "url": "https://dalam.web.id/artikel/laptop-pertama-osborne1.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj8bFisLsDrynWzbNVXt5lJ0zBdvvL6nAXTn_0PrAPkmfENUerHby-6tBJDg0amBAzC1-cd5pEWO_bqC_WOrE-WI9uUHMfOgZerldszngkxRCOdgFdsSRR1z9bhth1FqGy5QTHSoJ-J9Thy1xkvi7gXP-2qk9g7JQKnHlCnFnZ6FltbOfxUHo3U_dhg1-8/s1600/xadam-osborne.png",
  "content": "Osborne 1 — Laptop Pertama di Dunia Osborne 1 adalah komputer portabel pertama yang benar-benar diproduksi massal. Diluncurkan pada tahun 1981 oleh Adam Osborne, perangkat ini menandai tonggak penting dalam sejarah komputasi modern — memadukan mobilitas dan fungsionalitas dalam satu paket. Tampilan Osborne 1 (1981) Desain portabel Osborne 1 dengan layar 5 inci monochrome Adam Osborne, pendiri Osborne Computer Corporation Meskipun ukurannya besar menurut standar laptop modern, Osborne 1 merupakan terobosan luar biasa pada masanya. Ia dilengkapi dengan layar CRT 5 inci, dua floppy drive, sistem operasi CP/M, serta dibundel dengan perangkat lunak produktivitas — menjadikannya komputer siap pakai begitu keluar dari kotak. Laptop ini memiliki berat 24 Pounds (~10 kg) dan dijual dengan harga $1795 (~15 juta Rupiah) saat itu. Osborne 1 menjadi tonggak penting dalam sejarah laptop modern. Spesifikasi dan Fitur Prosesor: Zilog Z80, 4 MHz Memori: 64 KB RAM Media penyimpanan: 2 floppy disk 5,25\" Layar: 5\" monochrome CRT Sistem Operasi: CP/M Berat: 24 Pounds (~10 kg) Harga saat itu: $1795 Sayangnya, kesuksesan Osborne 1 tidak bertahan lama. Ketika perusahaan mengumumkan model penerus terlalu dini, penjualan menurun drastis — menyebabkan apa yang dikenal sebagai “Osborne Effect” dan berujung pada kebangkrutan perusahaan. × ❮ ❯ Ganti Tema",
  "meta": {
    "summary": "Osborne 1, laptop pertama di dunia yang dibuat oleh Adam Osborne pada tahun 1981. Berat 10kg, harga $1795, sejarah lengkap & gambar.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Osborne 1, laptop pertama di dunia yang dibuat oleh Adam Osborne pada tahun 1981. Berat 10kg, harga $1795, sejarah lengkap & gambar."
  }
}