{
  "id": "larangan-jilbab-1980-1990",
  "title": "Kontroversi Larangan Jilbab di Sekolah Negeri (1980-1990)",
  "slug": "larangan-jilbab-1980-1990.html",
  "url": "https://dalam.web.id/artikel/larangan-jilbab-1980-1990.html",
  "datePublished": "2025-10-05T08:45:00.000+00:00",
  "summary": "Pada dekade 1980-an hingga awal 1990-an, kebijakan mengenai atribut sekolah di Indonesia menghadapi salah satu kontroversi terbesarnya.",
  "category": "📢 Catatan & Opini Sosial",
  "promptHint": "Pada dekade 1980-an hingga awal 1990-an, kebijakan mengenai atribut sekolah di Indonesia menghadapi salah satu kontroversi terbesarnya.",
  "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi8XR9eALGG8QfRiwpUo3JB8JaAalEiR7lvpbfKikzgggc0-AwKeEGCij7JVhXZsMg3YRZa1jCLkvlHUXKNSpBsqZe4VTiXm0QZdpFtIHTRT0MP2qkjY-8JbRqrvjev6ZLHOd1771QEIJkoqxqMMVAW5bskFInw9byr5p1irwM_OdXMVsnck98z7RNelkE/s1600/laranganjilbab.jpg",
  "content_plain": "Kontroversi Larangan Jilbab di Sekolah Negeri (1980-1990) Pada dekade 1980-an hingga awal 1990-an, kebijakan mengenai atribut sekolah di Indonesia menghadapi salah satu kontroversi terbesarnya, yaitu larangan penggunaan jilbab di sekolah-sekolah negeri. Periode ini merupakan masa kelam bagi siswi Muslim yang ingin menjalankan ajaran agamanya, di mana mereka dipaksa memilih antara keyakinan dan pendidikan. Latar Belakang Kebijakan “Larangan ini terjadi secara masif selama masa pemerintahan Orde Baru. Puncaknya terjadi di pertengahan 1980-an dengan penegasan regulasi yang melarang penggunaan seragam di luar ketentuan baku. Pemerintah saat itu melihat atribut keagamaan yang terlalu menonjol sebagai potensi ancaman terhadap stabilitas dan ideologi tunggal negara, Pancasila.” Implikasi kebijakan ini sangat berat. Para siswi dihadapkan pada dilema sulit: melepas jilbab demi melanjutkan pendidikan di sekolah negeri, atau tetap berjilbab namun harus pindah ke sekolah swasta yang membolehkan pakai Jilbab. Pencabutan Larangan Situasi ini akhirnya mereda setelah hampir satu dekade perdebatan dan protes. Larangan tersebut secara resmi dicabut pada 16 Februari 1991 melalui SK Nomor 100/C/Kep/D/1991. Pencabutan ini menandai kembalinya hak siswi Muslim untuk mengenakan jilbab di lingkungan sekolah negeri dan menjadi momen penting dalam sejarah kebebasan berekspresi keagamaan dan pendidikan di Indonesia."
}