{
  "id": "marie-muhammad-mr-clean",
  "slug": "marie-muhammad-mr-clean",
  "title": "Teladan Mar'ie Muhammad: Kisah Kesederhanaan Sang Mr. Clean",
  "category": "🔆 Lainnya",
  "published_at": "2025-10-25T05:51:04.752+00:00",
  "url": "https://dalam.web.id/artikel/marie-muhammad-mr-clean.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjlAyR__FSNx0lWVhuJAroI-UfmbirLvpXsEfhOu-bMVlbpawaCK5QIm6hO-Vui4Y3z5osfvSsig42pgOiQJNcHVCfn5yovzjSoPOBR_m_XXOlrpV98HvPWqnOavx0CouzxDO7vZ75gNSZXKhseJtzKOuFW1rcSE4E2heugzJdgKS4Ns0NIsEoByTT2sRg/s1600/hasil_horizontal_1.webp",
  "content": {
    "text": "Kisah Mobil Tua di Gerbang Istana Negara Pernah dengar cerita Menteri Keuangan era Orde Baru, Mar'ie Muhammad—sosok legendaris yang dijuluki Mr. Clean? Julukan itu bukan sekadar sebutan, tapi benar-benar cerminan totalitas hidupnya yang bersih dan jujur. Salah satu kisah unik yang nyaris jadi legenda adalah soal pilihan mobilnya. Ceritanya begini. Tahun 1996, Mar'ie dijadwalkan menerima Bintang Mahaputra dari Presiden Soeharto. Momen yang istimewa, biasanya pejabat tinggi datang menggunakan mobil dinas mewah, lengkap dengan sopir dan pengawalan. Tapi, Mar'ie malah tampil beda. Ia memilih berangkat bersama istrinya pakai Kijang tua keluaran 1980-an. Mobil itu pun bukan mobil dinas, melainkan milik pribadinya yang sudah lama jadi andalan keluarga. Begitu sampai di gerbang Istana Negara, petugas keamanan langsung menghentikan mobil mereka. Wajar sih, mungkin penampilan kendaraan sederhana itu jauh dari gaya pejabat biasanya. Para penjaga mengira Mar'ie dan istrinya cuma tamu biasa, bukan Menteri Keuangan! Suasana agak kikuk, sampai akhirnya Mar'ie menunjukkan identitas dan menjelaskan tujuannya. Petugas pun buru-buru meminta maaf, lalu mempersilakan beliau masuk. \"Mobil dinas itu harus dipakai untuk urusan pekerjaan, bukan untuk urusan pribadi.\" Prinsip Hidup & Alasannya Menggunakan Mobil Pribadi Tua Berdasarkan buku Mr.Clean Marie Muhammad (2025), sikap Mar'ie sama sekali bukan kebetulan. Ia memang berpegang kuat bahwa mobil dinas hanya untuk keperluan pekerjaan, bukan urusan pribadi. Bahkan dalam keseharian, beliau anti gengsi—barang apapun selama masih berfungsi, tetap dipakai. Anak Mar'ie Muhammad pernah bercerita, ayahnya punya prinsip efisiensi lebih penting daripada gaya hidup mewah. Mau mobil Rp500 juta atau Rp100 juta, rasanya tetap sama saja, asal bisa dipakai. Begitu juga jam tangan atau sepatu, baru akan diganti kalau memang sudah rusak. Jujur, prinsip semacam ini sekarang terasa langka banget! Mar'ie Muhammad: Simbol Kesederhanaan, Integritas, dan Prestasi Kesederhanaan Mar'ie bukan pencitraan. Semua itu bagian dari nilai hidupnya: bersih, jujur, dan tegas. Prinsip inilah yang bikin beliau diakui bukan hanya oleh masyarakat, bahkan komunitas internasional. Di birokrasi, beliau dikenal super disiplin dan tak kenal kompromi pada korupsi. Saat menjabat Dirjen Pajak, Mar'ie mampu mengerek penerimaan pajak dari Rp9 triliun menjadi Rp19 triliun—dua kali lipat dari target! Lalu naik jadi Menteri Keuangan, ia sukses menjaga keseimbangan anggaran negara dan menunda krisis ekonomi lewat kebijakan fiskal yang penuh perhitungan. Gak heran, AsiaMoney menobatkan beliau sebagai Menteri Keuangan Terbaik Asia di tahun 1995. Setelah pensiun pada 1998, Mar'ie masih terus mengabdi di bidang kemanusiaan dan anti-korupsi hingga tutup usia pada 11 Desember 2016. Kesederhanaan, efisiensi, integritas. Inilah warisan nyata Mar'ie Muhammad—Mr. Clean Indonesia yang reputasinya menginspirasi banyak generasi. Semoga pejabat kekinian bisa belajar dari jejak Mar'ie, ya! Kisah ini diambil dari berbagai sumber, termasuk autobiografi Mr.Clean Marie Muhammad (2025), serta wawancara keluarganya.",
    "html": "<h2>Kisah Mobil Tua di Gerbang Istana Negara</h2>\n      <p>\n        Pernah dengar cerita Menteri Keuangan era Orde Baru, Mar'ie Muhammad—sosok legendaris yang dijuluki <strong>Mr. Clean</strong>? Julukan itu bukan sekadar sebutan, tapi benar-benar cerminan totalitas hidupnya yang bersih dan jujur. Salah satu kisah unik yang nyaris jadi legenda adalah soal pilihan mobilnya.\n      </p>\n      <img class=\"side-image\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhIlbn1mWAkbuIGp8lfjRaqjCH_VgJF3apEQCcrOfcTyg9c8PbbX2x30J0NhjZsZtQhnIZ2KC9G2mdpEu-Bmv48A62DD9-JMKz7LKfOgX19znYeUJ_IgLRvRtVYKCC7xZL0eqshbNnSIJixYgyVoEKEpl8WF0mJ_AN6MJVZc6Ed3Eup9-VxPUb41_jmlEI/s1600/hasil_horizontal_0.webp\" alt=\"Mobil Kijang Tua Mar'ie Muhammad\">\n      <p>\n        Ceritanya begini. Tahun 1996, Mar'ie dijadwalkan menerima Bintang Mahaputra dari Presiden Soeharto. Momen yang istimewa, biasanya pejabat tinggi datang menggunakan mobil dinas mewah, lengkap dengan sopir dan pengawalan. Tapi, Mar'ie malah tampil beda. Ia memilih berangkat bersama istrinya pakai Kijang tua keluaran 1980-an. Mobil itu pun bukan mobil dinas, melainkan milik pribadinya yang sudah lama jadi andalan keluarga.\n      </p>\n      <p>\n        Begitu sampai di gerbang Istana Negara, petugas keamanan langsung menghentikan mobil mereka. Wajar sih, mungkin penampilan kendaraan sederhana itu jauh dari gaya pejabat biasanya. Para penjaga mengira Mar'ie dan istrinya cuma tamu biasa, bukan Menteri Keuangan! Suasana agak kikuk, sampai akhirnya Mar'ie menunjukkan identitas dan menjelaskan tujuannya. Petugas pun buru-buru meminta maaf, lalu mempersilakan beliau masuk.\n      </p>\n      <div class=\"quote\">\n        \"Mobil dinas itu harus dipakai untuk urusan pekerjaan, bukan untuk urusan pribadi.\"\n      </div>\n      <h2>Prinsip Hidup &amp; Alasannya Menggunakan Mobil Pribadi Tua</h2>\n      <p>\n        Berdasarkan buku <i>Mr.Clean Marie Muhammad</i> (2025), sikap Mar'ie sama sekali bukan kebetulan. Ia memang berpegang kuat bahwa mobil dinas <b>hanya untuk keperluan pekerjaan</b>, bukan urusan pribadi. Bahkan dalam keseharian, beliau anti gengsi—barang apapun selama masih berfungsi, tetap dipakai.\n      </p>\n      <p>\n        Anak Mar'ie Muhammad pernah bercerita, ayahnya punya prinsip <b>efisiensi lebih penting daripada gaya hidup mewah</b>. Mau mobil Rp500 juta atau Rp100 juta, rasanya tetap sama saja, asal bisa dipakai. Begitu juga jam tangan atau sepatu, baru akan diganti kalau memang sudah rusak. Jujur, prinsip semacam ini sekarang terasa langka banget!\n      </p>\n      <h2>Mar'ie Muhammad: Simbol Kesederhanaan, Integritas, dan Prestasi</h2>\n      <p>\n        Kesederhanaan Mar'ie bukan pencitraan. Semua itu bagian dari nilai hidupnya: bersih, jujur, dan tegas. Prinsip inilah yang bikin beliau diakui bukan hanya oleh masyarakat, bahkan komunitas internasional. Di birokrasi, beliau dikenal super disiplin dan tak kenal kompromi pada korupsi.\n      </p>\n      <p>\n        Saat menjabat <strong>Dirjen Pajak</strong>, Mar'ie mampu mengerek penerimaan pajak dari Rp9 triliun menjadi Rp19 triliun—dua kali lipat dari target! Lalu naik jadi <strong>Menteri Keuangan</strong>, ia sukses menjaga keseimbangan anggaran negara dan menunda krisis ekonomi lewat kebijakan fiskal yang penuh perhitungan. Gak heran, <em>AsiaMoney</em> menobatkan beliau sebagai <b>Menteri Keuangan Terbaik Asia</b> di tahun 1995. Setelah pensiun pada 1998, Mar'ie masih terus mengabdi di bidang kemanusiaan dan anti-korupsi hingga tutup usia pada 11 Desember 2016.\n      </p>\n      <div class=\"quote\">\n        Kesederhanaan, efisiensi, integritas. Inilah warisan nyata Mar'ie Muhammad—Mr. Clean Indonesia yang reputasinya menginspirasi banyak generasi. Semoga pejabat kekinian bisa belajar dari jejak Mar'ie, ya!\n      </div>\n      <p style=\"color:#222;font-size:1.08rem;font-weight:500;\">\n          Kisah ini diambil dari berbagai sumber, termasuk autobiografi <em>Mr.Clean Marie Muhammad</em> (2025), serta wawancara keluarganya.</p>"
  },
  "meta": {
    "summary": "Mengulik kisah inspiratif Mar",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Mengulik kisah inspiratif Mar"
  }
}