{
  "id": "maulid-timeline",
  "slug": "maulid-timeline",
  "title": "Sejarah Maulid Nabi: Dari Fathimiyah hingga Era Modern",
  "category": "📚 Sejarah & Religi",
  "published_at": "2025-09-18T03:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/maulid-timeline.html",
  "image": "https://dalam.web.id/img/maulid-timeline.webp",
  "content": "Timeline Sejarah Maulid Nabi Dari awal kemunculan pada masa Dinasti Fathimiyah, penerimaan sebagian ulama, hingga dinamika modern—dijelaskan padat, runtut, dan mudah dipahami. Sejarah Ikhtilaf Ulama Budaya & Dakwah Ringkasan cepat Inti: Maulid Nabi tidak dikenal pada masa Nabi ﷺ, sahabat, dan tabi’in. Praktiknya muncul kemudian, lalu menjadi ruang perbedaan penilaian ulama: ada yang menolak sebagai bid’ah, ada yang membolehkan dengan syarat kontennya sesuai tuntunan syariat. Timeline perkembangan Abad ke-4 H (sekitar 900-an M) Fathimiyah, Mesir - Perayaan Maulid pertama kali dicatat pada masa Dinasti Fathimiyah (Syi’ah). - Lebih dekat pada tradisi istana dan politik, bukan sunnah generasi awal. Abad ke-6–7 H Syam & Irak - Mulai diadopsi kalangan Ahlus Sunnah di beberapa wilayah. - Format sederhana: pembacaan sirah, dzikir, dan doa. Abad ke-8–9 H Karya ulama - Ulama seperti Ibn Hajar al-‘Asqalani dan as-Suyuthi menulis risalah yang membolehkan dengan syarat. - Konten disaring: shalawat, dzikir, sedekah, dan pengajaran sirah. Abad ke-12 H Gelombang tajdid - Gerakan pembaruan, termasuk Ibn Abdul Wahhab, menolak Maulid sebagai bid’ah. - Terbentuk dua arus besar: penolakan total vs kebolehan bersyarat. Masa modern (abad ke-19–sekarang) Ragam praktik - Indonesia, Mesir, Turki, Maroko: perayaan luas, bernuansa dakwah dan budaya. - Saudi Arabia dan sebagian Teluk: tidak dirayakan secara resmi. Konteks dan penjelasan Landasan keberatan: Ketiadaan teladan salaf, potensi tasyabbuh, dan ghuluw. Landasan kebolehan: Substansi kebaikan (shalawat, sirah, sedekah) sebagai wasilah, bukan ibadah khusus yang ditetapkan nash. Prinsip adab: Jaga persaudaraan, utamakan ilmu, hindari saling menyalahkan, fokus pada amalan yang jelas dalilnya. Snippet timeline (siap di-copy) <ul class=\"timeline-plain\"> <li><strong>Abad ke-4 H:</strong> Awal Maulid pada masa Fathimiyah di Mesir.</li> <li><strong>Abad ke-6–7 H:</strong> Masuk ke Ahlus Sunnah di Syam & Irak, format sederhana.</li> <li><strong>Abad ke-8–9 H:</strong> Sejumlah ulama membolehkan dengan syarat isi yang baik.</li> <li><strong>Abad ke-12 H:</strong> Gerakan tajdid menolak sebagai bid’ah.</li> <li><strong>Modern:</strong> Praktik beragam; sebagian negara rayakan, sebagian tidak.</li> </ul> Copy Tutup ✕",
  "meta": {
    "summary": "Versi timeline lengkap perkembangan Maulid Nabi: awal mula pada Dinasti Fathimiyah, penerimaan sebagian ulama, penolakan gerakan tajdid, hingga ragam praktik modern. Disajikan ringkas, berimbang, dan mudah dipahami.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Versi timeline lengkap perkembangan Maulid Nabi: awal mula pada Dinasti Fathimiyah, penerimaan sebagian ulama, penolakan gerakan tajdid, hingga ragam praktik modern. Disajikan ringkas, berimbang, dan mudah dipahami."
  }
}