{
  "id": "membuat-git-orphan-branch",
  "slug": "membuat-git-orphan-branch",
  "title": "Cara Membuat Orphan Branch di Git & GitHub",
  "category": "ðŸ–¥ï¸ Teknologi Web, AI & Umum",
  "published_at": "2025-10-22T11:53:56.636+00:00",
  "url": "https://dalam.web.id/artikel/membuat-git-orphan-branch.html",
  "image": "https://dalam.web.id/img/membuat-git-orphan-branch.webp",
  "content_plain": "Apa sih Orphan Branch itu? Bayangin aja, kamu mau mulai sesuatu yang bener-bener baru di proyekmu. Misalnya, mau bikin halaman dokumentasi atau deploy website statis pakai GitHub Pages. Nah, kamu gak mau kan riwayat commit dari kode utama (`main` atau `master`) ikut kebawa? Di sinilah orphan branch jadi pahlawan. Dia ini branch kosong, tanpa orang tua, tanpa sejarah commit, siap untuk diisi dari nol! Langkah-Langkah Eksekusi Langkah 1: Ciptakan Branch \"Yatim Piatu\" Buka terminal di folder proyekmu, lalu ketik perintah sakti ini. Perintah ini bakal bikin branch baru (misal: `gh-pages`) dan langsung pindah ke sana, tapi isinya masih \"kosong\" secara riwayat. git checkout --orphan gh-pages Salin Info: Kamu bebas ganti `gh-pages` dengan nama branch lain yang kamu suka, misalnya `dokumentasi` atau `v2-release`. Langkah 2: Operasi Bersih-Bersih Eits, walaupun riwayatnya kosong, file-file dari branch `main` masih ada di *staging area*. Kita harus usir mereka dulu biar gak ikut di commit pertama. Sapu bersih dengan perintah ini. git rm -rf . Salin Penting: Perintah ini cuma menghapus file dari *index* Git, bukan dari hardisk-mu (selama kamu belum commit). Jadi tenang aja, file-mu di branch `main` tetap aman sentosa. Langkah 3: Letakkan Batu Pertama (Commit Awal) Sekarang branch-mu sudah suci. Saatnya membuat kehidupan baru. Buat satu file, apa aja, biar ada sesuatu untuk di-commit. Contohnya kita bikin `index.html`. echo \"Halo Dunia Baru!\" > index.html git add index.html git commit -m \"Initial commit: Memulai kehidupan baru di branch gh-pages\" Salin Langkah 4: Terbangkan ke GitHub! Semua sudah siap di lokal. Tinggal kita dorong (*push*) branch baru ini ke rumahnya di repositori GitHub. git push origin gh-pages Salin Selesai! Gampang kan? Selamat! Kamu sekarang punya branch `gh-pages` di GitHub yang riwayatnya bersih dan terpisah total dari branch `main`. Siap dipakai untuk proyek-proyek kerenmu selanjutnya!",
  "meta": {
    "summary": "Tutorial lengkap dan santai cara membuat branch Git baru (orphan branch) yang tidak punya riwayat commit dari branch main. Cocok untuk halaman gh-pages atau proyek terpisah.",
    "prompt_hint": "Tutorial lengkap dan santai cara membuat branch Git baru (orphan branch) yang tidak punya riwayat commit dari branch main. Cocok untuk halaman gh-pages atau proyek terpisah.",
    "keywords": [],
    "topics": []
  }
}