{
  "id": "membagikan-aplikasi-debian-dengan-dpkg-repack",
  "slug": "membagikan-aplikasi-debian-dengan-dpkg-repack",
  "title": "Membagikan Aplikasi Debian dengan dpkg-repack",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-05-25T23:20:38.195+00:00",
  "url": "https://dalam.web.id/artikel/membagikan-aplikasi-debian-dengan-dpkg-repack.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhXkQ4RV9Tth0kWya0PHABpWb3t8BO44elqA6FCyCKyvy1kDSR1zdKH_EUZoXzCL6g3fNsWsvRVWrpz7Og0v2vKnU0P97Sm4PBJAwg7QKWrNpZAsvvpG09i11vihjMKisfzDQt1gt-hHxqw/s1600/dpkg-repack.jpg",
  "content": {
    "text": "Membagikan Aplikasi Debian dengan dpkg-repack Banyak pengguna Debian rajin membersihkan cache APT, tapi bagaimana jika ingin berbagi aplikasi tanpa koneksi internet? Solusinya sederhana: gunakan dpkg-repack. Bayangkan Anda ingin memperlihatkan aplikasi baru di laptop, lalu teman Anda juga ingin memasangnya. Tidak ada internet, tidak bawa repositori, hanya ada flashdisk kosong. Di sinilah dpkg-repack menjadi pahlawan. Langkah-langkah Menggunakan dpkg-repack Prosesnya sangat mudah dan hanya memerlukan beberapa perintah di terminal. 1. Instalasi dpkg-repack Pastikan paket dpkg-repack sudah terpasang. Jika belum, Anda perlu koneksi internet untuk menginstalnya sekali ini saja. sudo apt-get install dpkg-repackSalin 2. Buat Ulang Paket .deb Gunakan perintah dpkg-repack diikuti dengan nama paket yang ingin Anda bagikan. Contoh, untuk memaketkan ulang pemutar musik Amarok: dpkg-repack amarokSalin Setelah perintah dijalankan, file amarok_VERSION_ARCH.deb akan muncul di direktori Anda saat ini. Cukup salin file .deb tersebut ke flashdisk dan bagikan ke teman Anda! Tips: Menggunakan Fakeroot Jika Anda ingin menjalankan perintah tanpa sudo, Anda bisa menggunakan bantuan fakeroot. Ini berguna untuk menghindari masalah perizinan. fakeroot -u dpkg-repack nama-paketSalin"
  },
  "meta": {
    "summary": "Cara mudah membagikan aplikasi di Debian menggunakan dpkg-repack, bahkan tanpa internet. Simpan aplikasi ke flashdisk dan bagikan ke teman Anda.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Cara mudah membagikan aplikasi di Debian menggunakan dpkg-repack, bahkan tanpa internet. Simpan aplikasi ke flashdisk dan bagikan ke teman Anda."
  }
}