{
  "id": "mengganti-kata-dengan-perl",
  "slug": "mengganti-kata-dengan-perl",
  "title": "Mengganti Kata dalam Banyak Dokumen dengan Perl",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-05-25T23:20:38.196+00:00",
  "url": "https://dalam.web.id/artikel/mengganti-kata-dengan-perl.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjmO8NTjyL75ML_31USiYa3l0wszCYNRszJg6FHIfp5qT0LallW8xHyskyaf0zZ2oIn4BcT7J8HhR6Chw0UomjirShOwtX1xwN7wajrd5mG_xkJGBGGQ54jSNatKcU_374fZPIce9NOyXjp/s1600/perl_logo.jpg",
  "content_plain": "Mengganti Kata dalam Banyak Dokumen dengan Perl Terkadang kita perlu merevisi dokumen dengan mengganti kata tertentu di banyak file sekaligus. Jika dilakukan manual, tentu sangat melelahkan. Untungnya, Perl menyediakan solusi cepat dengan satu baris perintah. Perintah Dasar Contoh kasus: Anda ingin mengganti kata \"Desember\" menjadi \"Januari\" di semua file laporan bulanan yang berformat .txt. Dengan Perl, cukup gunakan perintah berikut di terminal: perl -pi -w -e 's/Desember/Januari/g;' *.txtSalin Perintah ini akan mencari dan mengganti semua kemunculan kata \"Desember\" di setiap file .txt di direktori saat ini. Mengganti URL atau Teks dengan Karakter Khusus Jika teks yang ingin Anda ganti mengandung karakter / (seperti pada URL), Anda bisa menggunakan pemisah lain, misalnya #, |, atau :. perl -pi -w -e 's#//dalam.web.id/home#//dalam.web.id/sitemap#g' *.htmlSalin Keunggulan Menggunakan Perl Cepat: Satu perintah singkat untuk mengganti semua kata di banyak file. Efisien: Tidak perlu membuka file satu per satu secara manual. Powerful: Dukungan Regular Expression (regex) memungkinkan pencarian dan penggantian yang sangat kompleks. Perlu diingat, metode ini paling cocok untuk file teks biasa (plain text), seperti .txt, .html, .css, .xml, dan file kode sumber lainnya.",
  "meta": {
    "summary": "Cara mudah mengganti kata di banyak dokumen teks sekaligus menggunakan perintah Perl. Praktis, cepat, dan efisien.",
    "prompt_hint": "Cara mudah mengganti kata di banyak dokumen teks sekaligus menggunakan perintah Perl. Praktis, cepat, dan efisien.",
    "keywords": [],
    "topics": []
  }
}