{
  "id": "meta-opt-out",
  "slug": "meta-opt-out",
  "title": "Menolak Data Anda untuk Pelatihan AI Meta: Cara, Hoaks, dan Privasi",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-05-25T23:20:38.196+00:00",
  "url": "https://dalam.web.id/artikel/meta-opt-out.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiq7K_ryLz7ORz3JCz-kZT66VfLZa9k6ADP1WTUVNz8BBZ1ejLeDzJZl8OYsUwg6lePQF3ahUAuvt-Jj7r2xTGrHozHdbwKfoXk2B2TN8ugqPn5XcpHyDvuEDQFi2xmO8kKYpV7NNn5z4LW7cMRU7me66vrOg9jZg73XmpDFZxPo3hZHEDnHfQ84_9L8JY/s1600/nsa_facebook_google_mind_control.jpg",
  "content": {
    "text": "Menolak Data Anda untuk Pelatihan AI Meta Meta (induk perusahaan Facebook, Instagram, dan WhatsApp) menyediakan opsi bagi pengguna untuk menolak penggunaan data publik mereka dalam pelatihan model AI. Berikut adalah panduan praktis, klarifikasi hoaks, dan tips tambahan untuk menjaga privasi Anda. Cara Resmi Menolak Penggunaan Data Publik Proses penolakan (opt-out) dapat dilakukan melalui Pusat Privasi di Instagram atau Facebook. Buka aplikasi Instagram atau Facebook. Navigasi ke Settings → Privacy Center. Cari menu yang berkaitan dengan AI at Meta atau kebijakan serupa. Pilih opsi \"Submit an objection request\" atau \"Ajukan permintaan keberatan\". Isi formulir dengan alamat email yang terhubung ke akun Anda dan jelaskan alasan keberatan Anda, lalu kirim. Setelah permintaan Anda diproses, Meta akan mengirimkan konfirmasi melalui email bahwa data publik Anda tidak akan digunakan untuk pengembangan model AI di masa depan. Klarifikasi Hoaks \"Goodbye Meta AI\" Fakta: Postingan viral yang berisi teks \"Goodbye Meta AI\" atau sejenisnya tidak efektif untuk melindungi data Anda. Meta telah mengonfirmasi bahwa postingan semacam itu adalah hoaks. Satu-satunya cara yang sah untuk mengajukan keberatan adalah melalui formulir resmi yang disediakan di Pusat Privasi. Langkah Tambahan untuk Privasi Anda Atur Akun Menjadi Privat: Mengubah akun Instagram atau Facebook Anda menjadi privat adalah cara paling efektif untuk membatasi data apa saja yang dapat diakses secara publik. Bersihkan Postingan Lama: Hapus postingan lama yang tidak lagi relevan untuk mengurangi jejak digital publik Anda. Aktifkan Otentikasi Dua Faktor (2FA): Ini adalah langkah keamanan penting untuk melindungi akun Anda dari akses tidak sah.",
    "html": "<h1>Menolak Data Anda untuk Pelatihan AI Meta</h1>\n<div id=\"iposbrowser\"></div>\n                    <p class=\"lead\">Meta (induk perusahaan Facebook, Instagram, dan WhatsApp) menyediakan opsi bagi pengguna untuk menolak penggunaan data publik mereka dalam pelatihan model AI. Berikut adalah panduan praktis, klarifikasi hoaks, dan tips tambahan untuk menjaga privasi Anda.</p>\n                    <figure>\n                        <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiq7K_ryLz7ORz3JCz-kZT66VfLZa9k6ADP1WTUVNz8BBZ1ejLeDzJZl8OYsUwg6lePQF3ahUAuvt-Jj7r2xTGrHozHdbwKfoXk2B2TN8ugqPn5XcpHyDvuEDQFi2xmO8kKYpV7NNn5z4LW7cMRU7me66vrOg9jZg73XmpDFZxPo3hZHEDnHfQ84_9L8JY/s1600/nsa_facebook_google_mind_control.jpg\" alt=\"Ilustrasi kontrol data dan privasi\">\n                    </figure>\n                    <h2>Cara Resmi Menolak Penggunaan Data Publik</h2>\n                    <p>Proses penolakan (opt-out) dapat dilakukan melalui Pusat Privasi di Instagram atau Facebook.</p>\n                    <ol>\n                        <li><strong>Buka aplikasi</strong> Instagram atau Facebook.</li>\n                        <li>Navigasi ke <strong>Settings → Privacy Center</strong>.</li>\n                        <li>Cari menu yang berkaitan dengan <strong>AI at Meta</strong> atau kebijakan serupa.</li>\n                        <li>Pilih opsi \"Submit an objection request\" atau \"Ajukan permintaan keberatan\".</li>\n                        <li>Isi formulir dengan alamat email yang terhubung ke akun Anda dan jelaskan alasan keberatan Anda, lalu kirim.</li>\n                    </ol>\n                    <p class=\"muted\">Setelah permintaan Anda diproses, Meta akan mengirimkan konfirmasi melalui email bahwa data publik Anda tidak akan digunakan untuk pengembangan model AI di masa depan.</p>\n                    <h2>Klarifikasi Hoaks \"Goodbye Meta AI\"</h2>\n                    <div class=\"warning-box\">\n                        <p><strong>Fakta:</strong> Postingan viral yang berisi teks \"Goodbye Meta AI\" atau sejenisnya <strong>tidak efektif</strong> untuk melindungi data Anda. Meta telah mengonfirmasi bahwa postingan semacam itu adalah hoaks.</p>\n                        <p>Satu-satunya cara yang sah untuk mengajukan keberatan adalah melalui formulir resmi yang disediakan di Pusat Privasi.</p>\n                    </div>\n                    <h2>Langkah Tambahan untuk Privasi Anda</h2>\n                    <ul>\n                        <li><strong>Atur Akun Menjadi Privat:</strong> Mengubah akun Instagram atau Facebook Anda menjadi privat adalah cara paling efektif untuk membatasi data apa saja yang dapat diakses secara publik.</li>\n                        <li><strong>Bersihkan Postingan Lama:</strong> Hapus postingan lama yang tidak lagi relevan untuk mengurangi jejak digital publik Anda.</li>\n                        <li><strong>Aktifkan Otentikasi Dua Faktor (2FA):</strong> Ini adalah langkah keamanan penting untuk melindungi akun Anda dari akses tidak sah.</li>\n                    </ul>\n                    <div id=\"pesbukdiskus\"></div>"
  },
  "meta": {
    "summary": "Panduan santai menolak penggunaan data publik Anda oleh Meta untuk pelatihan AI, meluruskan hoaks",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Panduan santai menolak penggunaan data publik Anda oleh Meta untuk pelatihan AI, meluruskan hoaks"
  }
}