{
  "id": "oss-di-sekolah",
  "slug": "oss-di-sekolah",
  "title": "Kampanye OSS di Sekolah: Hemat Anggaran, Tingkatkan Kreativitas",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-09-18T03:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/oss-di-sekolah.html",
  "image": "https://dalam.web.id/img/oss-di-sekolah.webp",
  "content": "Kampanye OSS di Sekolah Open Source • Pendidikan • Anggaran Efektif Mulai Baca Hemat anggaran, tingkatkan kreativitas: kenapa sekolah perlu OSS Ajak semua orang di sekolah untuk menggunakan perangkat lunak bebas terbuka (OSS). Banyak opsi andal dan gratis: LibreOffice, GIMP, GNUCash, serta GNU/Linux. OSS mengurangi ketergantungan, mendorong eksplorasi, dan menumbuhkan kemandirian teknologi. Promote the use of free software (OSS) in our schools. LibreOffice, GIMP, GNUCash and other GPL software which is cost free. Masalah yang kita hadapi Biaya lisensi tinggi: setiap tahun dana pendidikan habis untuk lisensi OS dan aplikasi proprietary. Ketergantungan vendor: perangkat lunak tertutup cenderung kaku dan sulit disesuaikan kebutuhan lokal. Kreativitas terhambat: desain yang “misterius” membuat siswa kurang memahami cara kerja perangkat lunak. Each year our educational system wastes billions of Rupiahs for proprietary software. The software is rigid and opaque to our children. Solusi: migrasi bertahap ke OSS Kami menganjurkan penggantian bertahap perangkat lunak berbayar dengan alternatif berlisensi GPL atau setara. Gunakan perangkat lunak yang selaras dengan definisi “free software” dari Free Software Foundation agar siswa belajar sekaligus memahami filosofi kebebasan. We advocate the gradual replacement of proprietary software with open source alternatives (GPL). Have students use software that complies with the definition of free software. Kenapa GNU/Linux? Sistem operasi GNU/Linux beserta kode sumber, tools, dan dokumentasinya mudah diakses siswa. Gunakan sebagai media belajar yang hemat biaya, fleksibel, dan transparan. The GNU/Linux OS, source code, tools and docs are readily available to students. Their use should be encouraged as they are cost free. Kebebasan memilih itu penting Kebebasan perangkat lunak adalah kunci masa depan teknologi—dan masa depan anak-anak kita. Jika Anda setuju, dorong sekolah, komite, dan dinas terkait untuk membuat kebijakan ramah OSS. Software freedom is important to the future of technology and our children's futures. Please support if you agree. Rekomendasi awal: LibreOffice (pengolah kata/spreedsheet), GIMP (grafis), Inkscape (vektor), Audacity (audio), GNUCash (akuntansi), Thunderbird (email), dan distribusi GNU/Linux yang ramah pemula (mis. Ubuntu). Snippet siap pakai (Debian/Ubuntu) Gunakan perintah berikut untuk memasang paket dasar di lab komputer sekolah: Salin sudo apt update && sudo apt install -y \\ libreoffice gimp inkscape audacity gnucash thunderbird \\ vlc gparted filezilla Contoh kebijakan internal (ringkas) Salin # Kebijakan OSS Sekolah (Ringkas) - Prioritas menggunakan perangkat lunak berlisensi bebas/terbuka. - Pengadaan lab memasukkan 80% paket OSS inti. - Pelatihan guru & siswa minimal 2x per semester. - Evaluasi kompatibilitas dokumen (ODF) tiap caturwulan. Sebarkan agar lebih banyak sekolah mengambil langkah konkret. Rencana implementasi 4 langkah Audit kebutuhan: petakan fungsi (ofis, grafis, akuntansi, multimedia), lalu padankan dengan OSS. Uji coba pilot: 1 lab (10–20 komputer) selama 1 semester; kumpulkan feedback guru–siswa. Pelatihan internal: modul singkat 2x per semester untuk guru dan operator lab. Skala bertahap: migrasi bertahap 25% per semester sambil menjaga kompatibilitas dokumen (ODF). Format dokumen yang disarankan Teks & Spreedsheet: ODF (odt, ods) untuk interoperabilitas. Grafik: SVG (vektor) dan PNG (bitmap) untuk kualitas dan keterbukaan. Audio: FLAC/WAV untuk master; OGG untuk distribusi. Sumber belajar LibreOffice Help: panduan fitur dasar–lanjutan. GIMP Docs: manipulasi gambar dan retouching. Ubuntu Wiki: administrasi sistem & paket edukasi.",
  "meta": {
    "summary": "Ajak sekolah beralih ke Perangkat Lunak Bebas Terbuka (OSS): LibreOffice, GIMP, GNUCash, dan GNU/Linux. Hemat anggaran, tingkatkan kreativitas, kemandirian, dan literasi digital. Halaman interaktif dengan tombol berbagi, info perangkat, dan snippet siap pakai.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Ajak sekolah beralih ke Perangkat Lunak Bebas Terbuka (OSS): LibreOffice, GIMP, GNUCash, dan GNU/Linux. Hemat anggaran, tingkatkan kreativitas, kemandirian, dan literasi digital. Halaman interaktif dengan tombol berbagi, info perangkat, dan snippet siap pakai."
  }
}