{
  "id": "perbaiki-grub-rescue",
  "slug": "perbaiki-grub-rescue",
  "title": "Cara Memperbaiki GRUB Rescue Tanpa LiveCD/USB",
  "category": "ðŸ§ Linux & Open Source",
  "published_at": "2025-06-02T23:20:38.200+00:00",
  "url": "https://dalam.web.id/artikel/perbaiki-grub-rescue.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjkDL4vht__Sph6vdoIQAkW_R8nyo7jxNm34uZncj4Y_ZqcZDPuZmnLpcATemu6ZBtp6utOQ66ySSvKOf2dGu3_l2lX1CxHCvPnFawcZcw8p1lbWmWVkx80M-mI4kq-h5SqkFueS82AeeRZ/s800/grub-rescue.jpg",
  "content": {
    "text": "Cara Memperbaiki GRUB Rescue Tanpa LiveCD/USB Saat konfigurasi partisi salah atau setelah menghapus Windows dari dual-boot, Anda mungkin akan disambut dengan layar `grub rescue>`. Jangan panik! Berikut adalah panduan untuk memperbaikinya langsung dari prompt tersebut. Langkah 1: Cari Partisi Linux Anda Pertama, kita perlu menemukan di partisi mana instalasi Linux Anda berada. Gunakan perintah ls untuk melihat daftar disk dan partisi. ls Outputnya akan terlihat seperti (hd0) (hd0,msdos1) (hd0,msdos2). Coba periksa isi setiap partisi sampai Anda menemukan yang berisi direktori /boot/grub. ls (hd0,msdos1)/boot/grub Ulangi perintah di atas untuk setiap partisi (misalnya, `(hd0,msdos2)`, `(hd0,msdos3)`, dst.) sampai Anda menemukan yang benar. Langkah 2: Boot Manual ke Linux Setelah menemukan partisi yang benar (misalnya, (hd0,msdos1)), jalankan serangkaian perintah berikut untuk melakukan boot manual. Gunakan tombol `Tab` untuk auto-complete nama file kernel dan initrd. # Ganti (hd0,msdos1) dengan partisi Anda set prefix=(hd0,msdos1)/boot/grub set root=(hd0,msdos1) insmod linux insmod normal normal # Jika 'normal' tidak berhasil, coba cara yang lebih detail: linux /boot/vmlinuz-linux root=/dev/sda1 initrd /boot/initrd.img-linux bootSalin Ganti `vmlinuz-linux` dan `initrd.img-linux` dengan nama file yang sesuai di sistem Anda. Ganti juga `/dev/sda1` dengan nama partisi yang benar. Langkah 3: Perbaiki GRUB Secara Permanen Setelah berhasil masuk ke desktop Linux Anda, buka terminal dan jalankan perintah berikut untuk memperbaiki GRUB secara permanen. sudo update-grub sudo grub-install /dev/sdaSalin Ganti `/dev/sda` jika disk utama Anda memiliki nama yang berbeda (misalnya, `/dev/nvme0n1`). Setelah itu, reboot komputer Anda. Masalah GRUB Rescue seharusnya sudah teratasi."
  },
  "meta": {
    "summary": "Panduan lengkap memperbaiki GRUB Rescue tanpa LiveCD/USB. Tutorial ini membahas langkah detail agar Linux bisa booting normal kembali.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Panduan lengkap memperbaiki GRUB Rescue tanpa LiveCD/USB. Tutorial ini membahas langkah detail agar Linux bisa booting normal kembali."
  }
}