{
  "id": "pijat-sakit-kepala",
  "slug": "pijat-sakit-kepala",
  "title": "Sakit Kepala? Jangan Buru-Buru Minum Obat, Coba Pijat Relaksasi Ini!",
  "category": "🍜 Kuliner, Gaya Hidup & Kesehatan",
  "published_at": "2025-02-12T00:31:19.961+00:00",
  "url": "https://dalam.web.id/artikel/pijat-sakit-kepala.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEimOPCZ0reQuY_6QTC63V_fsSBK5psMYaH_A1kADCtULkoHermpGjvxhN_9R7i4UFQiUqgEexBDCJZ93nPvq5j0EoHNuCC_Cr4CVmH5JIBwSWkx83zPE8NUwMl47XOAOAMMkQGvt6C-ogmA/s1600/pijat1.jpg",
  "content": {
    "text": "Duduk terlalu lama di depan komputer sering bikin otot kaku dan kepala jadi tegang. Yuk, luangkan waktu sejenak untuk rileks dengan mengikuti 5 langkah pijat sederhana ini. 01 Pijat Area Pelipis Dengan posisi kepala tegak, letakkan jari-jari di pelipis kiri dan kanan. Beri tekanan lembut selama 5 detik, lalu lepaskan. Ulangi 3-4 kali untuk meredakan ketegangan. 02 Relaksasi Mata Pejamkan mata, lalu tutup dengan kedua telapak tangan (jangan ditekan). Tahan selama 5 detik. Lepaskan tangan, buka mata perlahan sambil menarik napas dalam. Ulangi 3-4 kali agar penglihatan lebih jernih. 03 Tekan Belakang Telinga Tengadahkan kepala. Letakkan telapak tangan di kening dan selipkan ibu jari di belakang telinga. Beri tekanan ke arah dalam selama 5 detik. Lakukan 3-4 kali. 04 Pijat Sisi Kepala Tundukkan kepala. Tempelkan telapak tangan di sisi kiri dan kanan kepala. Beri tekanan lembut menggunakan ujung jari dan telapak tangan selama 5 detik. Ulangi 3-4 kali. 05 Kendurkan Otot Leher Gunakan ibu jari dan telunjuk untuk menekan (seperti mencubit) bagian belakang pangkal leher. Tahan selama 5 detik untuk mengendurkan otot-otot yang tegang. Ulangi 3-4 kali."
  },
  "meta": {
    "summary": "Cara mudah dan efektif meredakan sakit kepala dan ketegangan dengan teknik pijat sederhana yang bisa kamu lakukan sambil duduk di depan komputer.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Cara mudah dan efektif meredakan sakit kepala dan ketegangan dengan teknik pijat sederhana yang bisa kamu lakukan sambil duduk di depan komputer."
  }
}