{
  "id": "pip-cache-bersih",
  "slug": "pip-cache-bersih",
  "title": "Mengecilkan Folder pip Cache dan http-v2 di Linux",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-10-03T11:14:59.083+00:00",
  "url": "https://dalam.web.id/artikel/pip-cache-bersih.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi4JBNXR0K4uep0d1msBv7MsBXfdp5CGgEZPzweC04lXbvrLo7yh1L_kX2ZyKninBx5e-53LRmQGyuc8O4pt7dIsKC9hAlKZPI3RknL1LoWM5MfvgJ-tT_A5ZcrldxTV68vCWKwBFa1V0A7YmwIUiTvy3P1ullp8UwZQiBOoGSrYEiP8Vx9-JfDLleGpVg/s1600/du1.png",
  "content_plain": "🔍 1. Cek ukuran dan isi cache pip Sebelum membersihkan, kamu bisa lihat dulu seberapa besar cache pip di sistemmu: pip cache info Ini akan menampilkan lokasi dan ukuran folder cache, termasuk bagian http-v2 dan wheels. 🧹 2. Bersihkan cache pip secara otomatis Untuk membersihkan semua isi cache pip (termasuk http-v2 dan wheels), gunakan: pip cache purge Perintah ini akan menghapus semua file cache yang disimpan pip, termasuk file index dan paket yang pernah diunduh. 🧼 3. Hapus cache pip secara manual (opsional) Kalau kamu ingin kontrol penuh atau pip versi lama tidak mendukung cache purge, kamu bisa hapus folder cache langsung: rm -rf ~/.cache/pip Atau jika kamu hanya ingin hapus bagian tertentu: rm -rf ~/.cache/pip/http rm -rf ~/.cache/pip/http-v2 rm -rf ~/.cache/pip/wheels 🧠 4. Cegah cache membesar di masa depan Kalau kamu ingin pip tidak menyimpan cache saat menginstal paket, tambahkan opsi --no-cache-dir: pip install nama-paket --no-cache-dir ⚠️ Catatan penting Membersihkan cache tidak akan menghapus paket yang sudah terinstal, hanya file cache. Setelah cache dibersihkan, pip akan mengunduh ulang paket dari internet jika kamu instal ulang. Tidak ada risiko merusak sistem Python kamu selama kamu hanya menghapus cache. 🖼️ Galeri Ilustrasi Tempat terbatas Boros",
  "meta": {
    "summary": "Panduan santai dan lengkap untuk membersihkan folder pip cache dan http-v2 di Linux agar tidak membengkak.",
    "prompt_hint": "Panduan santai dan lengkap untuk membersihkan folder pip cache dan http-v2 di Linux agar tidak membengkak.",
    "keywords": [],
    "topics": []
  }
}