{
  "id": "pph-pasal-23-atas-bunga-pinjaman",
  "slug": "pph-pasal-23-atas-bunga-pinjaman",
  "title": "PPh Pasal 23 atas Bunga Pinjaman: Tarif, Pengecualian, dan Contoh Perhitungan",
  "category": "🔆 Lainnya",
  "published_at": "2025-12-04T03:26:40.457+00:00",
  "url": "https://dalam.web.id/artikel/pph-pasal-23-atas-bunga-pinjaman.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjvbWjwygbjL3lMrUDfB-FGEKJ0ql8TYgYf70Yr9Isrg7NBc4eoL10OreRR4MymHM8S3dTKWcyeuJeR0AxenRyK8xbtaF4fVD0F7EGj-WX8hvTPkyPvuGf9xhJJXEmwMkHIVoZj7ihZyTSXwNXaE-4rV7rz7GsYlceGCkA5w7H_rzitRyKBvyb-Tgyie_A/s1600/1001014873.jpg",
  "content_plain": "PPh Pasal 23 atas bunga pinjaman adalah pajak yang dipotong atas pembayaran bunga pinjaman (baik rupiah maupun valas) dari peminjam kepada pemberi pinjaman yang merupakan Wajib Pajak Dalam Negeri (badan atau orang pribadi dalam negeri) atau Bentuk Usaha Tetap. Tarif PPh Pasal 23 atas bunga pinjaman = 15% × jumlah bruto bunga (Tidak ada pengurangan biaya apapun) Siapa yang Wajib Memotong dan Menyetor? Peminjam (badan usaha atau orang pribadi tertentu) Wajib memotong saat melakukan pembayaran bunga Menyetor paling lambat tanggal 10 bulan berikutnya Melaporkan di SPT Masa PPh Pasal 23/26 Kapan TIDAK Dikenakan PPh Pasal 23? KasusPajak yang Berlaku Bunga dari bank (konvensional/syariah)PPh Final Pasal 4 ayat (2) Bunga obligasi yang diperdagangkan di bursaPPh Final Bunga kepada pemerintahDikecualikan Bunga kepada Wajib Pajak Luar NegeriPPh Pasal 26 (20% atau P3B) Contoh Perhitungan Sederhana PT Maju Jaya meminjam Rp1 miliar dari PT Sejahtera (bukan bank) dengan bunga 12% per tahun. Bunga per bulan = Rp1.000.000.000 × 12% ÷ 12 = Rp10.000.000 PPh 23 = 15% × Rp10.000.000 = Rp1.500.000 Bunga yang diterima PT Sejahtera = Rp10.000.000 – Rp1.500.000 = Rp8.500.000 Dasar Hukum (per 2025) UU No. 7 Tahun 2021 (Harmonisasi Peraturan Perpajakan) PMK-231/PMK.03/2019 PER-25/PJ/2018 jo. PER-61/PJ/2009 Kesimpulan: Jika pinjaman bukan dari bank dan pemberi pinjaman adalah WP dalam negeri (badan/OP pengusaha), maka bunga pinjamannya wajib dipotong PPh Pasal 23 sebesar 15%.",
  "meta": {
    "summary": "Penjelasan lengkap PPh Pasal 23 atas bunga pinjaman: tarif 15%, siapa yang wajib memotong, pengecualian (bunga bank, obligasi, dll), contoh perhitungan, dan dasar hukum terbaru 2025.",
    "prompt_hint": "Penjelasan lengkap PPh Pasal 23 atas bunga pinjaman: tarif 15%, siapa yang wajib memotong, pengecualian (bunga bank, obligasi, dll), contoh perhitungan, dan dasar hukum terbaru 2025.",
    "keywords": [],
    "topics": []
  }
}