{
  "id": "presto-yum",
  "slug": "presto-yum",
  "title": "YUM Presto: Hemat Bandwidth Saat Update",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-06-02T23:20:38.201+00:00",
  "url": "https://dalam.web.id/artikel/presto-yum.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNzKz5Gj7d8z-8VXjuRT9arEpa3TbPfhOySjcoRIaMzv2HjQdaZ9SBdIw4Ur52ioqJVy2r27WjeKu9_t9Mrw9o4VMK_ujeaD_2xdEY0k6DMmTlSVwD3HW_mJ8ScRwmwQ2LinZYessDnG5I/s1600/Untitled.jpg",
  "content": "🚀 Jaga Data Pribadi Tetap Aman YUM Presto: Hemat Bandwidth Saat Update Bagi pengguna distro Linux berbasis YUM, ada cara mudah untuk menghemat kuota internet saat melakukan pembaruan sistem, yaitu dengan menggunakan plugin YUM Presto. Apa itu YUM Presto? YUM Presto adalah plugin untuk manajer paket YUM yang mengaktifkan fitur Delta RPM. Alih-alih mengunduh seluruh paket baru setiap kali ada pembaruan, sistem hanya akan mengunduh bagian yang berubah (delta) dari versi lama ke versi baru. Hasilnya, ukuran unduhan bisa jauh lebih kecil, sehingga menghemat waktu dan kuota internet. Info Modern: Pada distro-distro baru yang menggunakan DNF (penerus YUM), fitur delta RPM umumnya sudah terintegrasi secara bawaan. Namun, jika Anda masih menggunakan sistem lama berbasis YUM, plugin ini tetap sangat berguna. Cara Pasang dan Aktifkan Buka terminal Anda, lalu jalankan perintah berikut untuk memasang plugin YUM Presto. sudo yum install yum-prestoSalin Setelah terpasang, Anda bisa melanjutkan proses pembaruan seperti biasa. YUM akan secara otomatis mencoba menggunakan delta RPM jika tersedia di repositori. sudo yum update -ySalin Tips Praktis Dukungan Repositori: Tidak semua mirror menyediakan delta RPM. Jika ukuran unduhan tidak berkurang, coba ganti mirror repositori Anda. CPU vs Kuota: Proses \"menyusun ulang\" paket dari delta memerlukan sedikit lebih banyak kerja CPU. Namun, ini adalah trade-off yang sepadan untuk penghematan kuota yang signifikan.",
  "meta": {
    "summary": "Buat update di distro YUM jadi lebih hemat bandwidth dengan YUM Presto (delta RPM). Panduan mudah: apa itu Presto, cara pasang, dan tips.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Buat update di distro YUM jadi lebih hemat bandwidth dengan YUM Presto (delta RPM). Panduan mudah: apa itu Presto, cara pasang, dan tips."
  }
}