{
  "id": "queen-annes-revenge",
  "slug": "queen-annes-revenge",
  "title": "Queen Anne’s Revenge: Kisah La Concorde & Blackbeard",
  "category": "🔆 Lainnya",
  "published_at": "2025-09-24T03:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/queen-annes-revenge.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjiY3ksXIHpzt-yBzIxp3kKyI1-z0BudgsyfW7TKC3-1PUY4S9yiZtkjxUb7Ny7-qnSM4QP6VPXmv7znA2HWkPUaJOW22y-F_-TVqp4-otHwMNDVWIg6HB5hBd-8_rnkK-M5Iq6Ufw3tzoX7FtkmbRg1gq9LWi17XSJGxqYujAYb-3ZDjbX16eEOmWDdSc/s1600/budak.jpg",
  "content": {
    "text": "Pada November 1717, kapal dagang budak Prancis La Concorde berlayar dari Afrika Barat menuju Karibia. Namun, dekat pulau Martinique, kapal itu dicegat oleh bajak laut legendaris Edward Teach, yang lebih dikenal sebagai Blackbeard. Lahirnya Sebuah Legenda Blackbeard tidak melanjutkan perjalanan kapal itu dalam perdagangan manusia. Sebaliknya, ia membalikkan nasibnya, melengkapinya dengan puluhan meriam, dan mengubahnya menjadi kapal perang dahsyat bernama Queen Anne’s Revenge. Kapal ini menjadi permata armadanya dan salah satu yang terkuat di Karibia. Sejarah bukan sekadar daftar peristiwa—ia adalah denyut manusia yang mencari makna dan peluang di tengah badai. Beberapa catatan sejarah menyebutkan bahwa banyak orang Afrika yang diperbudak di kapal tersebut memperoleh kebebasan, dan sebagian memilih bergabung dengan kru Blackbeard. Di atas geladak kapal bajak laut, tercipta semacam kesetaraan di mana harta rampasan dibagi rata tanpa memandang warna kulit. Takdir yang Berbalik Perebutan La Concorde mengangkat Blackbeard menjadi legenda. Kapal yang lahir dari penderitaan itu berubah menjadi simbol perlawanan dan salah satu kapal bajak laut terbesar pada zamannya, melahirkan kisah paling menakjubkan dari zaman keemasan perompakan.",
    "html": "<p>Pada November 1717, kapal dagang budak Prancis <em>La Concorde</em> berlayar dari Afrika Barat menuju Karibia. Namun, dekat pulau Martinique, kapal itu dicegat oleh bajak laut legendaris Edward Teach, yang lebih dikenal sebagai <strong>Blackbeard</strong>.</p>\n\n            <section class=\"gallery\">\n                <img loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjiY3ksXIHpzt-yBzIxp3kKyI1-z0BudgsyfW7TKC3-1PUY4S9yiZtkjxUb7Ny7-qnSM4QP6VPXmv7znA2HWkPUaJOW22y-F_-TVqp4-otHwMNDVWIg6HB5hBd-8_rnkK-M5Iq6Ufw3tzoX7FtkmbRg1gq9LWi17XSJGxqYujAYb-3ZDjbX16eEOmWDdSc/s1600/budak.jpg\" alt=\"Ilustrasi perdagangan budak dan kapal maritim\">\n                <img loading=\"lazy\" src=\"https://images.unsplash.com/photo-1505839673365-e3971f8d6a30?q=80&amp;w=1200&amp;auto=format&amp;fit=crop\" alt=\"Laut Karibia di senja hari\">\n                <img loading=\"lazy\" src=\"https://images.unsplash.com/photo-1459292414180-1e4ee09b29e8?q=80&amp;w=1200&amp;auto=format&amp;fit=crop\" alt=\"Meriam kapal tua\">\n            </section>\n\n            <section>\n                <h2>Lahirnya Sebuah Legenda</h2>\n                <p>Blackbeard tidak melanjutkan perjalanan kapal itu dalam perdagangan manusia. Sebaliknya, ia membalikkan nasibnya, melengkapinya dengan puluhan meriam, dan mengubahnya menjadi kapal perang dahsyat bernama <strong>Queen Anne’s Revenge</strong>. Kapal ini menjadi permata armadanya dan salah satu yang terkuat di Karibia.</p>\n                <div class=\"hook\">\n                    Sejarah bukan sekadar daftar peristiwa—ia adalah denyut manusia yang mencari makna dan peluang di tengah badai.\n                </div>\n                <p>Beberapa catatan sejarah menyebutkan bahwa banyak orang Afrika yang diperbudak di kapal tersebut memperoleh kebebasan, dan sebagian memilih bergabung dengan kru Blackbeard. Di atas geladak kapal bajak laut, tercipta semacam kesetaraan di mana harta rampasan dibagi rata tanpa memandang warna kulit.</p>\n            </section>\n\n            <section>\n                <h2>Takdir yang Berbalik</h2>\n                <p>Perebutan La Concorde mengangkat Blackbeard menjadi legenda. Kapal yang lahir dari penderitaan itu berubah menjadi simbol perlawanan dan salah satu kapal bajak laut terbesar pada zamannya, melahirkan kisah paling menakjubkan dari zaman keemasan perompakan.</p>\n            </section>\n            <section class=\"social-sharing\">\n               \n            </section>"
  },
  "meta": {
    "summary": "Kisah La Concorde yang direbut Blackbeard lalu menjadi Queen Anne’s Revenge. Dari tragedi perdagangan budak ke legenda bajak laut Karibia.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Kisah La Concorde yang direbut Blackbeard lalu menjadi Queen Anne’s Revenge. Dari tragedi perdagangan budak ke legenda bajak laut Karibia."
  }
}