{
  "id": "rekor-ddos-29tbps-aisuru-botnet",
  "slug": "rekor-ddos-29tbps-aisuru-botnet",
  "title": "Rekor Serangan DDoS Terbesar di Dunia: 29,7 Tbps dari Botnet AISURU dengan 4 Juta Perangkat Zombie!",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-12-05T18:44:39.214+00:00",
  "url": "https://dalam.web.id/artikel/rekor-ddos-29tbps-aisuru-botnet.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgF59hge_kQ1cKDtFbkWE359GYZcnrmSgmAGPLa4s-BN8md0YIwgyxQSXPwemGCYhOsSwnX2lEp2xzgzc-XVxx7zSII2X44RduTaYu4pgNn7Ab-3LtPYBjjQbC8wIE7G2tDd5kzf594DGf1RSuR4VNzFl5C4v3kQtFltZZbKyvYGEsDqOkheOVkk4Gp7AKQ/s1600/LARGEST-DDOS.jpg",
  "content": {
    "text": "Rekor Serangan DDoS Terbesar Sepanjang Sejarah: 29,7 Tbps dari Botnet AISURU! 4 Desember 2025 • 7 menit baca • Cybersecurity Bro, bayangin aja… baru kemarin Cloudflare ngumumin kalau mereka berhasil ngeblok serangan DDoS terbesar yang pernah tercatat di dunia: 29,7 Terabit per detik! Iya, 29,7 Tbps! Bukan Gbps lagi, tapi tera! Ini rekor baru yang bikin semua orang di dunia cybersecurity pada geleng-geleng kepala. Serangan ini berlangsung cuma 69 detik doang, tapi dalam waktu segitu udah bisa bikin server-server besar ketar-ketir. Pelakunya? Botnet sewaan (DDoS-for-hire) yang namanya AISURU. Botnet ini diperkirakan mengendalikan 1 sampai 4 juta perangkat terinfeksi di seluruh dunia. Gila nggak tuh? Jutaan router, IoT, server lama, sampe mungkin CCTV kamu (kalau passwordnya masih “admin”) bisa aja jadi bagian dari pasukan zombie ini. Teknik yang dipakai namanya UDP carpet-bombing: mereka ngebom rata ke 15.000 port berbeda setiap detiknya, sambil ngerandom semua atribut paket biar susah dideteksi sama sistem pertahanan. Pokoknya licik banget lah! Sepanjang tahun 2025 ini, Cloudflare udah ngeblok 2.867 serangan dari AISURU, dan di kuartal 3 aja ada 1.304 serangan hyper-volumetric (yang di atas 1 Tbps). Total serangan DDoS yang mereka tangkal tahun ini udah nyampe 36,2 juta serangan! Naik gila-gilaan dari tahun sebelumnya. Fakta-fakta menarik dari laporan Cloudflare Q3 2025: Serangan di atas 100 juta paket/detik naik 189% dibanding kuartal sebelumnya 71% serangan HTTP DDoS dan 89% serangan layer jaringan selesai dalam <10 menit 7 dari 10 negara sumber serangan terbanyak ada di Asia (termasuk Indonesia!) Industri otomotif jadi yang paling kena peningkatan serangan (naik ke peringkat 6 dunia) Serangan ke perusahaan AI naik 347% cuma di bulan September Hampir 70% serangan HTTP berasal dari botnet yang udah dikenal Intinya, dunia cybersecurity sekarang udah masuk era baru. Serangan DDoS nggak lagi soal “banyak request”, tapi kecil-kecilan”. Sekarang udah masuk level terabit, cepet, canggih, dan murah buat disewa. Siapa aja bisa nyewa botnet segila ini dengan harga miring di dark web. Jadi, buat kamu yang punya website, VPS, atau layanan online: pakai mitigasi DDoS itu wajib. Cloudflare, Akamai, Imperva, Sucuri, dll — pilih salah satu. Kalau nggak, suatu saat bisa aja tiba-tiba situs kamu down karena jadi korban “collateral damage” dari serangan segila ini. Stay safe di dunia maya ya temen-temen! Jangan lupa update router, ganti password default, dan matiin UPnP kalau nggak dipakai. Biar nggak jadi bagian dari 4 juta zombie berikutnya.",
    "html": "<header>\n            <h1> Rekor Serangan DDoS Terbesar Sepanjang Sejarah: <span class=\"highlight\">29,7 Tbps</span> dari Botnet AISURU!</h1>\n\n            <div class=\"meta\">\n                <span><i class=\"fa-regular fa-calendar\"></i> 4 Desember 2025</span> •\n                <span><i class=\"fa-regular fa-clock\"></i> 7 menit baca</span> •\n                <span><i class=\"fa-solid fa-shield-halved\"></i> Cybersecurity</span>\n            </div>\n        </header>\n\n        <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi1uVFOoC-TzuWi5Bb4KrNtzUoUwXcRYquCvI_r7-6qu1622KSN6NMDm7YV17AdFd0FF7NIko4bfmivUTNFnBkvumQvYR5Qv0VX4AUVBIQb6jSEM0ARDcEpYw2DU53Ew8dx0zQjm1kfrlBoOlrBn2NWnc3oNeyEgyGC-1pEVkF5-8tmYU4gJIciT6sopGgX/s1600/massive-ddos-attack.jpg\" alt=\"Ilustrasi serangan DDoS besar-besaran\" class=\"article-img\" loading=\"lazy\">\n\n        <div class=\"content\">\n            <p><span class=\"emoji\"></span>Bro, bayangin aja… baru kemarin <strong>Cloudflare</strong> ngumumin kalau mereka berhasil ngeblok <strong>serangan DDoS terbesar yang pernah tercatat di dunia</strong>: <strong>29,7 Terabit per detik</strong>! Iya, 29,7 Tbps! Bukan Gbps lagi, tapi <em>tera</em>! Ini rekor baru yang bikin semua orang di dunia cybersecurity pada geleng-geleng kepala.</p>\n\n            <p>Serangan ini berlangsung cuma <strong>69 detik</strong> doang, tapi dalam waktu segitu udah bisa bikin server-server besar ketar-ketir. Pelakunya? Botnet sewaan (DDoS-for-hire) yang namanya <strong>AISURU</strong>. Botnet ini diperkirakan mengendalikan <strong>1 sampai 4 juta perangkat terinfeksi</strong> di seluruh dunia. Gila nggak tuh? Jutaan router, IoT, server lama, sampe mungkin CCTV kamu (kalau passwordnya masih “admin”) bisa aja jadi bagian dari pasukan zombie ini.</p>\n\n            <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgF59hge_kQ1cKDtFbkWE359GYZcnrmSgmAGPLa4s-BN8md0YIwgyxQSXPwemGCYhOsSwnX2lEp2xzgzc-XVxx7zSII2X44RduTaYu4pgNn7Ab-3LtPYBjjQbC8wIE7G2tDd5kzf594DGf1RSuR4VNzFl5C4v3kQtFltZZbKyvYGEsDqOkheOVkk4Gp7AKQ/s1600/LARGEST-DDOS.jpg\" alt=\"Grafik serangan DDoS terbesar 2025\" class=\"article-img\" loading=\"lazy\">\n\n            <p>Teknik yang dipakai namanya <strong>UDP carpet-bombing</strong>: mereka ngebom rata ke <strong>15.000 port berbeda setiap detiknya</strong>, sambil ngerandom semua atribut paket biar susah dideteksi sama sistem pertahanan. Pokoknya licik banget lah!</p>\n\n            <p>Sepanjang tahun 2025 ini, Cloudflare udah ngeblok <strong>2.867 serangan dari AISURU</strong>, dan di kuartal 3 aja ada <strong>1.304 serangan hyper-volumetric</strong> (yang di atas 1 Tbps). Total serangan DDoS yang mereka tangkal tahun ini udah nyampe <strong>36,2 juta serangan</strong>! Naik gila-gilaan dari tahun sebelumnya.</p>\n\n            <h2><span class=\"emoji\"></span>Fakta-fakta menarik dari laporan Cloudflare Q3 2025:</h2>\n            <ul>\n                <li>Serangan di atas 100 juta paket/detik naik <strong>189%</strong> dibanding kuartal sebelumnya</li>\n                <li>71% serangan HTTP DDoS dan 89% serangan layer jaringan selesai dalam &lt;10 menit</li>\n                <li>7 dari 10 negara sumber serangan terbanyak ada di Asia (termasuk Indonesia!)</li>\n                <li>Industri otomotif jadi yang paling kena peningkatan serangan (naik ke peringkat 6 dunia)</li>\n                <li>Serangan ke perusahaan AI naik <strong>347%</strong> cuma di bulan September</li>\n                <li>Hampir 70% serangan HTTP berasal dari botnet yang udah dikenal</li>\n            </ul>\n\n            <p><span class=\"emoji\"></span>Intinya, dunia cybersecurity sekarang udah masuk era baru. Serangan DDoS nggak lagi soal “banyak request”, tapi kecil-kecilan”. Sekarang udah masuk level <strong>terabit</strong>, cepet, canggih, dan murah buat disewa. Siapa aja bisa nyewa botnet segila ini dengan harga miring di dark web.</p>\n\n            <p>Jadi, buat kamu yang punya website, VPS, atau layanan online: <strong>pakai mitigasi DDoS itu wajib</strong>. Cloudflare, Akamai, Imperva, Sucuri, dll — pilih salah satu. Kalau nggak, suatu saat bisa aja tiba-tiba situs kamu down karena jadi korban “collateral damage” dari serangan segila ini.</p>\n\n            <p>Stay safe di dunia maya ya temen-temen! Jangan lupa update router, ganti password default, dan matiin UPnP kalau nggak dipakai. Biar nggak jadi bagian dari 4 juta zombie berikutnya.</p>\n        </div>\n\n        <!-- Kolom Komentar Disqus -->"
  },
  "meta": {
    "summary": "Cloudflare baru saja memblokir serangan DDoS terbesar sepanjang sejarah: 29,7 Tbps dari botnet AISURU yang punya hingga 4 juta perangkat terinfeksi. Serangan ini cuma bertahan 69 detik tapi bikin dunia cybersecurity heboh!",
    "prompt_hint": "Cloudflare baru saja memblokir serangan DDoS terbesar sepanjang sejarah: 29,7 Tbps dari botnet AISURU yang punya hingga 4 juta perangkat terinfeksi. Serangan ini cuma bertahan 69 detik tapi bikin dunia cybersecurity heboh!",
    "keywords": [],
    "topics": []
  }
}