{
  "id": "remove-old-kernels",
  "slug": "remove-old-kernels",
  "title": "Hapus Kernel Lama di Linux: Simpan yang Penting, Bersihkan yang Aman",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-06-10T23:20:38.203+00:00",
  "url": "https://dalam.web.id/artikel/remove-old-kernels.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjsm8B5iwfRk-ZAI63qTT5l77StE0dacWDWJZ_W3J0lyi8L20RpY8Sh0w-Zr6L0U_tsnep5VX8MuNX7dNoMau6Cb8vlw9TdbsYDt9I1gZ3cgRAtfkkZ1GBnj6_jNl0TwHy48Rlo8Fuljm8rjfW9A8d1XBGrHBpcbebXq07JdWMKeZ-h-GCz1pc91WkBUdI/s1600/linux-kernel-updates-upgrades-security.jpg",
  "content": {
    "text": "Hapus Kernel Lama di Linux: Simpan yang Penting, Bersihkan yang Aman Kernel lama yang menumpuk bisa dibersihkan untuk menghemat ruang disk. Namun, penting untuk melakukannya dengan aman. Panduan ini menunjukkan cara praktis untuk mengelola kernel di sistem berbasis Debian/Ubuntu. Langkah-langkah Membersihkan Kernel 1. Lihat Daftar Kernel yang Terpasang Gunakan perintah dpkg untuk melihat semua paket kernel (image dan headers) yang ada di sistem Anda. dpkg -l \"linux-image*\" \"linux-headers*\"Salin Perhatikan outputnya. Baris yang diawali dengan \"ii\" menandakan paket terpasang, sedangkan \"rc\" berarti sudah dihapus tapi konfigurasinya masih ada. 2. Hapus Kernel Secara Spesifik (Opsional) Jika Anda tahu persis versi mana yang ingin dihapus, gunakan apt purge. Perintah ini akan menghapus paket beserta file konfigurasinya. sudo apt purge linux-image-6.1.0-10-amd64Salin 3. Gunakan Cara Otomatis (Direkomendasikan) Cara yang lebih aman dan mudah adalah menggunakan apt autoremove. Perintah ini secara cerdas akan menghapus semua kernel lama, kecuali dua versi terbaru (kernel yang sedang berjalan dan satu versi sebelumnya sebagai cadangan). sudo apt autoremove --purgeSalin Opsi --purge memastikan file konfigurasi juga ikut dibersihkan. Tips Terbaik: Biasakan menyimpan minimal dua kernel terakhir. Jika kernel terbaru menyebabkan masalah (misalnya, WiFi tidak berfungsi), Anda bisa boot menggunakan kernel sebelumnya dari menu GRUB.",
    "html": "<h1>Hapus Kernel Lama di Linux: Simpan yang Penting, Bersihkan yang Aman</h1>\n\n                    <p class=\"lead\">Kernel lama yang menumpuk bisa dibersihkan untuk menghemat ruang disk. Namun, penting untuk melakukannya dengan aman. Panduan ini menunjukkan cara praktis untuk mengelola kernel di sistem berbasis Debian/Ubuntu.</p>\n                    <figure>\n                        <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjsm8B5iwfRk-ZAI63qTT5l77StE0dacWDWJZ_W3J0lyi8L20RpY8Sh0w-Zr6L0U_tsnep5VX8MuNX7dNoMau6Cb8vlw9TdbsYDt9I1gZ3cgRAtfkkZ1GBnj6_jNl0TwHy48Rlo8Fuljm8rjfW9A8d1XBGrHBpcbebXq07JdWMKeZ-h-GCz1pc91WkBUdI/s1600/linux-kernel-updates-upgrades-security.jpg\" alt=\"Ilustrasi update kernel Linux\">\n                    </figure>\n                    <h2>Langkah-langkah Membersihkan Kernel</h2>\n                    <h3>1. Lihat Daftar Kernel yang Terpasang</h3>\n                    <p>Gunakan perintah <code>dpkg</code> untuk melihat semua paket kernel (image dan headers) yang ada di sistem Anda.</p>\n                    <pre class=\"language-bash\"><code id=\"code1\">dpkg -l \"linux-image*\" \"linux-headers*\"</code><button class=\"copy-btn\" data-target=\"code1\">Salin</button></pre>\n                    <p class=\"muted\">Perhatikan outputnya. Baris yang diawali dengan \"ii\" menandakan paket terpasang, sedangkan \"rc\" berarti sudah dihapus tapi konfigurasinya masih ada.</p>\n                    <h3>2. Hapus Kernel Secara Spesifik (Opsional)</h3>\n                    <p>Jika Anda tahu persis versi mana yang ingin dihapus, gunakan <code>apt purge</code>. Perintah ini akan menghapus paket beserta file konfigurasinya.</p>\n                    <pre class=\"language-bash\"><code id=\"code2\">sudo apt purge linux-image-6.1.0-10-amd64</code><button class=\"copy-btn\" data-target=\"code2\">Salin</button></pre>\n                    <h3>3. Gunakan Cara Otomatis (Direkomendasikan)</h3>\n                    <p>Cara yang lebih aman dan mudah adalah menggunakan <code>apt autoremove</code>. Perintah ini secara cerdas akan menghapus semua kernel lama, kecuali dua versi terbaru (kernel yang sedang berjalan dan satu versi sebelumnya sebagai cadangan).</p>\n                    <pre class=\"language-bash\"><code id=\"code3\">sudo apt autoremove --purge</code><button class=\"copy-btn\" data-target=\"code3\">Salin</button></pre>\n                    <p class=\"muted\">Opsi <code>--purge</code> memastikan file konfigurasi juga ikut dibersihkan.</p>\n                    <div class=\"tip-box\">\n                        <strong>Tips Terbaik:</strong> Biasakan menyimpan minimal <strong>dua kernel terakhir</strong>. Jika kernel terbaru menyebabkan masalah (misalnya, WiFi tidak berfungsi), Anda bisa boot menggunakan kernel sebelumnya dari menu GRUB.\n                    </div>"
  },
  "meta": {
    "summary": "Cara melihat dan menghapus kernel lama di Linux dengan aman. Perintah dpkg, apt purge, autoremove, dan alasan menyimpan minimal dua kernel terakhir.",
    "prompt_hint": "Cara melihat dan menghapus kernel lama di Linux dengan aman. Perintah dpkg, apt purge, autoremove, dan alasan menyimpan minimal dua kernel terakhir.",
    "keywords": [],
    "topics": []
  }
}