{
  "id": "revolusi-dapur-dme",
  "slug": "revolusi-dapur-dme",
  "title": "Revolusi Dapur: Indonesia Siap Ganti LPG dengan DME Batu Bara!",
  "category": "📢 Catatan & Opini Sosial",
  "published_at": "2025-10-27T03:00:00.000+00:00",
  "url": "https://dalam.web.id/artikel/revolusi-dapur-dme.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjRUhSySbQSwj8_-Brf6pxQQh5JcPL9x5rojrtBaOHKQGqImGbb6s0xH-MSBA2u_H65JzQYadLnpKEHB6nrKA0xNSYRBc8zHenQZJBR26MYsDoYc_kNVd3PewYL2U3MTD652hQnVOH2kp5PQSOpO-h72HgavdTUuWUpm0El4EQKwfNSmXfxux7kpIqkzTk/s1600/dme.webp",
  "content": {
    "text": "Revolusi Dapur: Indonesia Siap Ganti LPG dengan DME Batu Bara! Era tabung gas melon akan segera berakhir. Pemerintah finalisasi proyek ambisius penggantian LPG impor dengan Dimethyl Ether (DME). Siap-siap, ini dia faktanya! Ilustrasi tabung DME yang disiapkan sebagai pengganti LPG. Bersiaplah untuk sebuah revolusi besar-besaran yang akan terjadi di dapur-dapur seluruh Indonesia. Kayaknya nggak berlebihan deh nyebut ini 'revolusi'. Soalnya, energi yang kita pakai masak sehari-hari bakal ganti total! Pemerintah, melalui Menteri Energi dan Sumber Daya Mineral (ESDM) Bahlil Lahadalia, secara resmi mengonfirmasi bahwa proyek ambisius untuk menggantikan Liquified Petroleum Gas (LPG) yang selama ini kita gunakan dengan Dimethyl Ether (DME) kini sedang dalam tahap finalisasi. Artinya, era tabung gas biru dan melon yang ikonik itu mungkin akan segera berakhir. Gantinya? Energi baru yang sumbernya dari kekayaan alam Indonesia sendiri, yaitu batu bara. Langkah drastis ini didorong oleh dua alasan utama yang sangat krusial dan mendesak. 1. Memutus Kecanduan Impor LPG Ini masalah utamanya. Indonesia ternyata sangat bergantung, alias 'kecanduan', impor LPG. Menteri Bahlil membeberkan angka yang bikin kaget: dari total konsumsi nasional sebesar 8,5 juta ton per tahun, kapasitas produksi dalam negeri kita cuma mampu menyumbang 1,3 juta ton. Sisanya? Sekitar 6,5 hingga 7 juta ton, harus didatangkan dari luar negeri. Ini tentu saja menguras devisa negara dalam jumlah besar. Boros banget! Dengan memanfaatkan batu bara yang melimpah (yang diubah jadi DME), pemerintah berharap bisa melahirkan substitusi impor dan akhirnya mencapai kemandirian energi. Nggak perlu jajan gas ke negara lain lagi. 2. Menuju Dapur yang Lebih Hijau Selain alasan ekonomi, DME yang dihasilkan melalui proses gasifikasi batu bara (mengubah batu bara padat menjadi gas) diklaim lebih ramah lingkungan dibandingkan LPG murni. Ini sejalan dengan upaya global untuk menekan emisi gas rumah kaca. Jadi, sambil hemat devisa, kita juga ikut berkontribusi buat lingkungan. Kenalan Yuk, Apa Itu DME? Bagi yang belum familiar, DME ini seperti kembaran tapi tak sama dengan LPG. Biar nggak bingung, ini dia beberapa karakteristik utamanya: Mirip secara Fisik & Kimia: Sifat DME sangat mirip dengan LPG. Kabar baiknya, infrastruktur yang sudah ada seperti tabung, tempat penyimpanan (storage) dan handling-nya berpotensi besar bisa digunakan kembali tanpa modifikasi besar-besaran. Jadi nggak perlu ganti semua alat dari nol. Kalori Lebih Rendah (Masak Sedikit Lebih Lama): Nah, ini bedanya. Kandungan panas (calorific value) DME (7.749 Kcal/Kg) memang lebih rendah dibandingkan LPG (12.076 Kcal/Kg). Artinya, waktu memasak menggunakan DME akan sedikit lebih lama, diperkirakan sekitar 1,1 hingga 1,2 kali lipat dibandingkan menggunakan LPG. Jadi kalau biasa masak nasi 20 menit, nanti bisa jadi 22-24 menit. Lebih Ramah Lingkungan: Ini keunggulan signifikannya. DME mudah terurai di udara sehingga tidak merusak lapisan ozon. Selain itu, diklaim mampu meminimalisir emisi gas rumah kaca hingga 20% dibandingkan LPG (dari 930 kg CO2/tahun menjadi 745 kg CO2/tahun). Hasil pembakarannya juga lebih bersih: nyala api biru stabil, tidak menghasilkan particulate matter (pm) atau jelaga hitam di panci, tidak menghasilkan NOx, dan tidak mengandung sulfur. Dapur jadi lebih bersih! Poin Penting! Nah ini yang perlu dicatat: untuk bisa memanfaatkan DME 100%, masyarakat membutuhkan kompor khusus DME. Kita tidak bisa langsung menggunakan kompor LPG yang ada saat ini. Bukan Cuma Wacana, Sudah Diuji Coba! Rencana ambisius ini bukanlah sekadar wacana di atas kertas, lho. Kementerian ESDM melalui Balitbang ESDM telah melakukan serangkaian uji coba pemakaian DME (termasuk DME 100%) kepada ratusan kepala keluarga. Uji coba ini dilakukan di Palembang dan Muara Enim (Desember 2019 - Januari 2020) serta di Jakarta (Kecamatan Marunda tahun 2017). Hasilnya? Secara umum, masyarakat dapat menerima penggunaan DME, meskipun mereka mengakui adanya perbedaan waktu memasak yang sedikit lebih lama tadi. Proyek konversi DME ini merupakan salah satu dari 18 proyek hilirisasi strategis nasional yang saat ini sedang dalam tahap finalisasi oleh Badan Pengelola Investasi Daya Anagata Nusantara (Danantara). Menteri Bahlil memastikan bahwa Pra Studi Kelayakan (pra-Feasibility Study) untuk proyek ini telah rampung dan kini sedang dipelajari lebih lanjut oleh konsultan sebelum implementasi penuh. Kini, Indonesia bersiap menyambut era baru energi di dapurnya. Transisi dari LPG impor ke DME berbasis batu bara ini diharapkan menjadi langkah besar menuju kemandirian energi sekaligus kontribusi nyata dalam upaya global mencapai target energi bersih.",
    "html": "<header>\n                <h1>Revolusi Dapur: Indonesia Siap Ganti LPG dengan DME Batu Bara!</h1>\n\n                <p class=\"subtitle\">Era tabung gas melon akan segera berakhir. Pemerintah finalisasi proyek ambisius penggantian LPG impor dengan Dimethyl Ether (DME). Siap-siap, ini dia faktanya!</p>\n            </header>\n            <figure>\n                <img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjRUhSySbQSwj8_-Brf6pxQQh5JcPL9x5rojrtBaOHKQGqImGbb6s0xH-MSBA2u_H65JzQYadLnpKEHB6nrKA0xNSYRBc8zHenQZJBR26MYsDoYc_kNVd3PewYL2U3MTD652hQnVOH2kp5PQSOpO-h72HgavdTUuWUpm0El4EQKwfNSmXfxux7kpIqkzTk/s1600/dme.webp\" alt=\"Ilustrasi tabung DME (Dimethyl Ether) sebagai pengganti LPG\">\n                <figcaption>Ilustrasi tabung DME yang disiapkan sebagai pengganti LPG.</figcaption>\n            </figure>\n            <section class=\"content-body\">\n                <p>Bersiaplah untuk sebuah revolusi besar-besaran yang akan terjadi di dapur-dapur seluruh Indonesia. Kayaknya nggak berlebihan deh nyebut ini 'revolusi'. Soalnya, energi yang kita pakai masak sehari-hari bakal ganti total!</p>\n                <p>Pemerintah, melalui Menteri Energi dan Sumber Daya Mineral (ESDM) Bahlil Lahadalia, secara resmi mengonfirmasi bahwa proyek ambisius untuk menggantikan <em>Liquified Petroleum Gas</em> (LPG) yang selama ini kita gunakan dengan <em>Dimethyl Ether</em> (DME) kini sedang dalam tahap finalisasi.</p>\n                <p>Artinya, era tabung gas biru dan melon yang ikonik itu mungkin akan segera berakhir. Gantinya? Energi baru yang sumbernya dari kekayaan alam Indonesia sendiri, yaitu batu bara.</p>\n                <p>Langkah drastis ini didorong oleh dua alasan utama yang sangat krusial dan mendesak.</p>\n                <h2>1. Memutus Kecanduan Impor LPG</h2>\n                <p>Ini masalah utamanya. Indonesia ternyata sangat bergantung, alias 'kecanduan', impor LPG. Menteri Bahlil membeberkan angka yang bikin kaget: dari total konsumsi nasional sebesar 8,5 juta ton per tahun, kapasitas produksi dalam negeri kita cuma mampu menyumbang 1,3 juta ton.</p>\n                <p>Sisanya? Sekitar 6,5 hingga 7 juta ton, harus didatangkan dari luar negeri. Ini tentu saja menguras devisa negara dalam jumlah besar. Boros banget!</p>\n                <p>Dengan memanfaatkan batu bara yang melimpah (yang diubah jadi DME), pemerintah berharap bisa melahirkan substitusi impor dan akhirnya mencapai kemandirian energi. Nggak perlu jajan gas ke negara lain lagi.</p>\n                <h2>2. Menuju Dapur yang Lebih Hijau</h2>\n                <p>Selain alasan ekonomi, DME yang dihasilkan melalui proses gasifikasi batu bara (mengubah batu bara padat menjadi gas) diklaim lebih ramah lingkungan dibandingkan LPG murni.</p>\n                <p>Ini sejalan dengan upaya global untuk menekan emisi gas rumah kaca. Jadi, sambil hemat devisa, kita juga ikut berkontribusi buat lingkungan.</p>\n                <h2>Kenalan Yuk, Apa Itu DME?</h2>\n                <p>Bagi yang belum familiar, DME ini seperti kembaran tapi tak sama dengan LPG. Biar nggak bingung, ini dia beberapa karakteristik utamanya:</p>\n                <ul>\n                    <li>\n                        <strong>Mirip secara Fisik &amp; Kimia:</strong> Sifat DME sangat mirip dengan LPG. Kabar baiknya, infrastruktur yang sudah ada seperti tabung, tempat penyimpanan (storage) dan <em>handling</em>-nya berpotensi besar bisa digunakan kembali tanpa modifikasi besar-besaran. Jadi nggak perlu ganti semua alat dari nol.\n                    </li>\n                    <li>\n                        <strong>Kalori Lebih Rendah (Masak Sedikit Lebih Lama):</strong> Nah, ini bedanya. Kandungan panas (<em>calorific value</em>) DME (7.749 Kcal/Kg) memang lebih rendah dibandingkan LPG (12.076 Kcal/Kg). Artinya, waktu memasak menggunakan DME akan sedikit lebih lama, diperkirakan sekitar 1,1 hingga 1,2 kali lipat dibandingkan menggunakan LPG. Jadi kalau biasa masak nasi 20 menit, nanti bisa jadi 22-24 menit.\n                    </li>\n                    <li>\n                        <strong>Lebih Ramah Lingkungan:</strong> Ini keunggulan signifikannya. DME mudah terurai di udara sehingga tidak merusak lapisan ozon. Selain itu, diklaim mampu meminimalisir emisi gas rumah kaca hingga 20% dibandingkan LPG (dari 930 kg CO2/tahun menjadi 745 kg CO2/tahun). Hasil pembakarannya juga lebih bersih: nyala api biru stabil, tidak menghasilkan <em>particulate matter</em> (pm) atau jelaga hitam di panci, tidak menghasilkan NOx, dan tidak mengandung sulfur. Dapur jadi lebih bersih!\n                    </li>\n                </ul>\n                <div class=\"poin-penting\">\n                    <p>Poin Penting! <span>Nah ini yang perlu dicatat: untuk bisa memanfaatkan DME 100%, masyarakat membutuhkan <strong>kompor khusus DME</strong>. Kita tidak bisa langsung menggunakan kompor LPG yang ada saat ini.</span></p>\n                </div>\n                <h2>Bukan Cuma Wacana, Sudah Diuji Coba!</h2>\n                <p>Rencana ambisius ini bukanlah sekadar wacana di atas kertas, lho. Kementerian ESDM melalui Balitbang ESDM telah melakukan serangkaian uji coba pemakaian DME (termasuk DME 100%) kepada ratusan kepala keluarga.</p>\n                <p>Uji coba ini dilakukan di Palembang dan Muara Enim (Desember 2019 - Januari 2020) serta di Jakarta (Kecamatan Marunda tahun 2017). Hasilnya? Secara umum, masyarakat dapat menerima penggunaan DME, meskipun mereka mengakui adanya perbedaan waktu memasak yang sedikit lebih lama tadi.</p>\n                <p>Proyek konversi DME ini merupakan salah satu dari 18 proyek hilirisasi strategis nasional yang saat ini sedang dalam tahap finalisasi oleh Badan Pengelola Investasi Daya Anagata Nusantara (Danantara). Menteri Bahlil memastikan bahwa Pra Studi Kelayakan (pra-Feasibility Study) untuk proyek ini telah rampung dan kini sedang dipelajari lebih lanjut oleh konsultan sebelum implementasi penuh.</p>\n                <p>Kini, Indonesia bersiap menyambut era baru energi di dapurnya. Transisi dari LPG impor ke DME berbasis batu bara ini diharapkan menjadi langkah besar menuju kemandirian energi sekaligus kontribusi nyata dalam upaya global mencapai target energi bersih.</p>\n            </section>"
  },
  "meta": {
    "summary": "Era tabung gas melon akan berakhir! Pemerintah finalisasi proyek penggantian LPG impor dengan DME (Dimethyl Ether) dari batu bara. Simak alasannya, plus minusnya, dan apa dampaknya bagi dapur kita.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Era tabung gas melon akan berakhir! Pemerintah finalisasi proyek penggantian LPG impor dengan DME (Dimethyl Ether) dari batu bara. Simak alasannya, plus minusnya, dan apa dampaknya bagi dapur kita."
  }
}