{
  "id": "sejarah-singkat-yogyakarta",
  "slug": "sejarah-singkat-yogyakarta",
  "title": "Sejarah Singkat & Perkembangan Kota Yogyakarta — Ngayogyakarta Hadiningrat",
  "category": "🔆 Lainnya",
  "published_at": "2025-10-14T18:15:06.421+00:00",
  "url": "https://dalam.web.id/artikel/sejarah-singkat-yogyakarta.html",
  "image": "https://dalam.web.id/img/sejarah-singkat-yogyakarta.webp",
  "content_plain": "Diperbarui: — Penulis: SejarahYogya.id Awal Mula — Perjanjian Gianti dan Pembagian Mataram (13 Februari 1755) Sejarah Kota Yogyakarta bermula ketika Perjanjian Gianti ditandatangani pada 13 Februari 1755. Dalam perjanjian itu wilayah Kerajaan Mataram dibagi: sebagian menjadi hak keraton Surakarta dan sebagian lagi menjadi kekuasaan Pangeran Mangkubumi yang kemudian diakui sebagai Sultan Hamengku Buwono I. Pangeran Mangkubumi menerima gelar Sultan Hamengku Buwono I dan pengakuan atas kekuasaan atas daerah-daerah pedalaman Mataram (termasuk Yogyakarta) serta sejumlah wilayah mancanegara pada masa itu. Pendirian Ngayogyakarta Hadiningrat & Kraton Pada 13 Maret 1755 Sultan Hamengku Buwono I menetapkan nama Ngayogyakarta Hadiningrat untuk daerah yang berada dalam kekuasaannya dan memilih lokasi di sebuah hutan bernama Beringin sebagai pusat pemerintahan. Pembangunan Kraton dimulai tidak lama setelahnya; pada 9 Oktober 1755 Sultan secara sementara menempati pesanggrahan Ambarketawang sembari mengawasi pembangunan kraton. Peresmian resmi Kraton dan pemindahan pusat pemerintahan tercatat pada 7 Oktober 1756. Yogyakarta dalam Periode Kolonial hingga Kemerdekaan Sepanjang masa penjajahan Belanda dan pendudukan Jepang, Yogyakarta menjadi salah satu pusat politik dan budaya di Pulau Jawa. Peran Yogyakarta semakin penting pada masa pergerakan nasional dan proses kemerdekaan Indonesia. Peran setelah Proklamasi 1945 dan Status Daerah Istimewa Setelah Proklamasi 17 Agustus 1945, Sri Sultan Hamengku Buwono IX beserta Paku Alam VIII mengambil keputusan politik yang menentukan: mereka menerima posisi sebagai Gubernur dan Wakil Gubernur Propinsi Daerah Istimewa Yogyakarta dan mengukuhkan dukungan Kesultanan terhadap Republik Indonesia. Melalui serangkaian amanat dan peraturan pada akhir 1945, daerah Kesultanan dan Pakualaman menyatakan statusnya sebagai Daerah Istimewa bagian dari Republik. Perkembangan pemerintahan lalu berlanjut sampai diundangkannya UU yang mengatur otonomi daerah — dari UU No.17/1947, UU No.22/1999 hingga pembaruan-pembaruan berikutnya — yang menempatkan Kota Yogyakarta sebagai entitas pemerintahan modern dengan pemerintahan kota dan tetap mempertahankan status spesial DI Yogyakarta pada tingkat provinsi. Identitas Modern: Kota Pelajar, Budaya, Pariwisata, dan Perjuangan Hingga abad ke-21, Yogyakarta dikenal luas sebagai: Kota Pelajar — pusat pendidikan tinggi yang menarik pelajar dari seluruh Nusantara. Kota Budaya — pelestarian seni tradisional, kerajinan, dan warisan keraton. Kota Pariwisata — destinasi utama setelah Bali, dengan candi, wisata alam, dan budaya. Kota Perjuangan — tokoh dan peristiwa penting dalam sejarah kemerdekaan turut menempatkan Yogya pada posisi strategis dalam narasi nasional. Catatan Administratif & Hukum Secara administratif, Daerah Istimewa Yogyakarta tetap memiliki mekanisme pengangkatan gubernur yang istimewa bagi Sri Sultan dan wakilnya. Dalam praktek pemerintahan modern, peraturan tentang desentralisasi, otonomi daerah, dan hubungan antara pemerintah pusat dan daerah terus berkembang sesuai dinamika hukum nasional. Untuk tulisan yang lebih mendalam (dokumen sumber primer, arsip kerajaan, atau penelitian akademis terbaru), penelusuran arsip, jurnal sejarah, dan publikasi lokal direkomendasikan. URL halaman saat ini: —",
  "meta": {
    "summary": "Ringkasan sejarah berdirinya Yogyakarta sejak Perjanjian Gianti 1755, pendirian Kraton, hingga status Daerah Istimewa dan peran modernnya sebagai kota pelajar, budaya, pariwisata, dan perjuangan.",
    "prompt_hint": "Ringkasan sejarah berdirinya Yogyakarta sejak Perjanjian Gianti 1755, pendirian Kraton, hingga status Daerah Istimewa dan peran modernnya sebagai kota pelajar, budaya, pariwisata, dan perjuangan.",
    "keywords": [],
    "topics": []
  }
}