{
  "id": "sejarah-blankon",
  "slug": "sejarah-blankon",
  "title": "Sejarah Linux BlankOn: Distro Kebanggaan Indonesia",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-06-10T23:20:38.203+00:00",
  "url": "https://dalam.web.id/artikel/sejarah-blankon.html",
  "image": "https://dalam.web.id/img/sejarah-blankon.webp",
  "content": {
    "text": "Sejarah Linux BlankOn: Distro Kebanggaan Indonesia BlankOn adalah cerminan semangat gotong royong komunitas sumber terbuka di Indonesia. Distro ini dirancang khusus untuk memenuhi kebutuhan pengguna komputer di tanah air, mulai dari dukungan bahasa hingga tampilan yang bernuansa budaya. Desktop Manokwari, lingkungan desktop khas yang dikembangkan oleh tim BlankOn. Awal Mula: Semangat Kemandirian Proyek BlankOn digagas pada tahun 2007 oleh Yayasan Penggerak Linux Indonesia (YPLI) bekerja sama dengan Komunitas Ubuntu Indonesia. Tujuannya adalah menciptakan distro Linux yang benar-benar sesuai dengan karakteristik masyarakat Indonesia. Nama \"BlankOn\" sendiri diambil dari nama penutup kepala khas Jawa, melambangkan identitas dan kemandirian. Evolusi Basis: Dari Ubuntu ke Debian Rilis-rilis awal BlankOn dibangun di atas fondasi Ubuntu. Namun, dimulai dari rilis BlankOn X \"Tambora,\" tim pengembang beralih ke basis \"induk\"-nya, yaitu Debian. Langkah ini memberikan kontrol yang lebih besar atas paket-paket dasar dan siklus rilis yang lebih stabil. Karena kini berbasis Debian, perintah untuk memutakhirkan sistem menggunakan manajer paket `apt`: sudo apt update && sudo apt upgradeSalin Fitur Khas Cita Rasa Indonesia Desktop Manokwari: Lingkungan desktop yang dikembangkan sendiri, dibangun dengan GTK+ dan HTML5 untuk tampilan yang modern dan intuitif. Konten Lokal: Menyertakan wallpaper keindahan alam dan budaya Indonesia, serta ikon-ikon yang unik. Dukungan Aksara Nusantara: Salah satu fitur penting adalah dukungan bawaan untuk aksara-aksara daerah di Indonesia. Bagaimana Nasib BlankOn Saat Ini? Dalam beberapa tahun terakhir, pengembangan BlankOn memang mengalami perlambatan. Rilis stabil terakhir adalah BlankOn XI \"Uluwatu\" pada tahun 2018. Meskipun pengembangan versi selanjutnya telah dimulai, rilis stabil final belum kunjung tiba. Masa depan BlankOn sangat bergantung pada partisipasi aktif dari para pengembang dan komunitasnya. Walaupun menghadapi tantangan, BlankOn tetap menjadi simbol penting dari kemampuan dan semangat gotong royong komunitas teknologi di Indonesia.",
    "html": "<h1>Sejarah Linux BlankOn: Distro Kebanggaan Indonesia</h1>\n\n                    <p class=\"lead\">BlankOn adalah cerminan semangat gotong royong komunitas sumber terbuka di Indonesia. Distro ini dirancang khusus untuk memenuhi kebutuhan pengguna komputer di tanah air, mulai dari dukungan bahasa hingga tampilan yang bernuansa budaya.</p>\n                    <figure>\n                        <img src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgGchJ_3G7p7c7v7Q8g8H8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g8g/s1600/manokwari-desktop.jpg\" alt=\"Tampilan Desktop Manokwari khas BlankOn\">\n                        <figcaption style=\"font-size: 0.9em; color: var(--muted); margin-top: 0.5rem;\">Desktop Manokwari, lingkungan desktop khas yang dikembangkan oleh tim BlankOn.</figcaption>\n                    </figure>\n                    <h2>Awal Mula: Semangat Kemandirian</h2>\n                    <p>Proyek BlankOn digagas pada tahun <strong>2007</strong> oleh <strong>Yayasan Penggerak Linux Indonesia (YPLI)</strong> bekerja sama dengan Komunitas Ubuntu Indonesia. Tujuannya adalah menciptakan distro Linux yang benar-benar sesuai dengan karakteristik masyarakat Indonesia. Nama \"BlankOn\" sendiri diambil dari nama penutup kepala khas Jawa, melambangkan identitas dan kemandirian.</p>\n                    <h2>Evolusi Basis: Dari Ubuntu ke Debian</h2>\n                    <p>Rilis-rilis awal BlankOn dibangun di atas fondasi <strong>Ubuntu</strong>. Namun, dimulai dari rilis <strong>BlankOn X \"Tambora,\"</strong> tim pengembang beralih ke basis \"induk\"-nya, yaitu <strong>Debian</strong>. Langkah ini memberikan kontrol yang lebih besar atas paket-paket dasar dan siklus rilis yang lebih stabil.</p>\n                    <p>Karena kini berbasis Debian, perintah untuk memutakhirkan sistem menggunakan manajer paket `apt`:</p>\n                    <pre class=\"language-bash\"><code id=\"code1\">sudo apt update &amp;&amp; sudo apt upgrade</code><button class=\"copy-btn\" data-target=\"code1\">Salin</button></pre>\n                    <h2>Fitur Khas Cita Rasa Indonesia</h2>\n                    <ul>\n                        <li><strong>Desktop Manokwari:</strong> Lingkungan desktop yang dikembangkan sendiri, dibangun dengan GTK+ dan HTML5 untuk tampilan yang modern dan intuitif.</li>\n                        <li><strong>Konten Lokal:</strong> Menyertakan wallpaper keindahan alam dan budaya Indonesia, serta ikon-ikon yang unik.</li>\n                        <li><strong>Dukungan Aksara Nusantara:</strong> Salah satu fitur penting adalah dukungan bawaan untuk aksara-aksara daerah di Indonesia.</li>\n                    </ul>\n                    <h2>Bagaimana Nasib BlankOn Saat Ini?</h2>\n                    <p>Dalam beberapa tahun terakhir, pengembangan BlankOn memang mengalami perlambatan. Rilis stabil terakhir adalah <strong>BlankOn XI \"Uluwatu\"</strong> pada tahun 2018. Meskipun pengembangan versi selanjutnya telah dimulai, rilis stabil final belum kunjung tiba.</p>\n                    <p>Masa depan BlankOn sangat bergantung pada partisipasi aktif dari para pengembang dan komunitasnya. Walaupun menghadapi tantangan, BlankOn tetap menjadi simbol penting dari kemampuan dan semangat gotong royong komunitas teknologi di Indonesia.</p>"
  },
  "meta": {
    "summary": "Mengupas tuntas sejarah Linux BlankOn, distro asli Indonesia. Dari awal berdiri, basis sistem operasi yang digunakan, hingga perkembangannya di masa depan.",
    "prompt_hint": "Mengupas tuntas sejarah Linux BlankOn, distro asli Indonesia. Dari awal berdiri, basis sistem operasi yang digunakan, hingga perkembangannya di masa depan.",
    "keywords": [],
    "topics": []
  }
}