{
  "id": "smkn7-samarinda-linux-community",
  "slug": "smkn7-samarinda-linux-community",
  "title": "Semangat Open Source: Menghidupkan Kembali Komunitas Linux di SMKN 7 Samarinda",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-03-05T12:38:48.564+00:00",
  "url": "https://dalam.web.id/artikel/smkn7-samarinda-linux-community.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMGU6qnArrsCEF_V1VP3RbLIlQChjf1oflie22AvMBfrZV3Nx0gkmce7FouMa-kN4szTlNk_pUf0EsIW-QVTZ1npXzEh83qzGzb_IRbSjfOoHPyfQJQ7yuewKcCrQK4pIcpMfzxMSuHClu/s1600/6.resized.JPG",
  "content_plain": "Berawal dari sebuah undangan yang tulus dari rekan-rekan penggiat teknologi di SMKN 7 Samarinda, saya merasa terpanggil untuk ikut serta. Bukan sekadar memenuhi undangan, tetapi juga sebagai bentuk dedikasi dan kepedulian terhadap perkembangan komunitas teknologi, khususnya di dunia Open Source. Tujuan utama dari pertemuan ini sangat mulia: untuk menghidupkan kembali Komunitas GNU/Linux yang pernah ada di sekolah ini. Komunitas adalah jantung dari ekosistem Open Source. Tanpa adanya wadah untuk berbagi, belajar, dan berkolaborasi, semangat untuk berkembang bisa meredup. Inilah yang coba kami nyalakan kembali. Suasana Penuh Antusiasme Kegiatan ini menjadi ajang berbagi pengetahuan dan pengalaman seputar GNU/Linux dan FOSS (Free and Open Source Software). Para siswa menunjukkan antusiasme yang luar biasa, membuktikan bahwa minat terhadap teknologi alternatif yang gratis dan terbuka ini masih sangat besar. Diskusi berjalan hangat, dari pertanyaan dasar tentang instalasi hingga topik yang lebih mendalam mengenai kustomisasi dan pemrograman. Harapan untuk Masa Depan Dengan aktifnya kembali komunitas ini, besar harapan kami agar perkembangan dan pemanfaatan Sistem Operasi Sumber Terbuka bisa semakin eksis dan maju, khususnya di Kota Samarinda. Semoga ini menjadi langkah awal bagi para siswa untuk lebih dalam mengenal dunia teknologi, berkontribusi, dan menciptakan inovasi-inovasi baru. Sukses selalu untuk SMKN 7 Samarinda! Teruslah menjadi pelopor dan inspirasi bagi sekolah-sekolah lainnya.",
  "meta": {
    "summary": "Catatan kegiatan dalam upaya menghidupkan kembali komunitas GNU/Linux di SMKN 7 Samarinda. Momen kebersamaan dan semangat untuk memajukan penggunaan Open Source di kalangan pelajar.",
    "prompt_hint": "Catatan kegiatan dalam upaya menghidupkan kembali komunitas GNU/Linux di SMKN 7 Samarinda. Momen kebersamaan dan semangat untuk memajukan penggunaan Open Source di kalangan pelajar.",
    "keywords": [],
    "topics": []
  }
}