{
  "id": "sosialisasi-oss-kutai-kartanegara",
  "title": "Sosialisasi Open Source Software di Kutai Kartanegara | Kementerian Riset dan Teknologi",
  "slug": "sosialisasi-oss-kutai-kartanegara.html",
  "url": "https://dalam.web.id/artikel/sosialisasi-oss-kutai-kartanegara.html",
  "datePublished": "2025-03-05T12:38:48.564+00:00",
  "summary": "",
  "category": "🐧 Linux & Open Source",
  "promptHint": "",
  "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi1UyeLmW3xXbYWK52wxfAaWeToDtM6BVqNXGyDjNQ2LMtvfVSHZVOk5D3t29vj5NncO6vnF7fZzwBXwtl-mqwcXGBuiuEOBuO2ZEVWS8MfQbMo5uBD-jVHeVjZgWK3b4get9paJmAQAxRU_w4CneNqCnIj-wtGfS0RnEd2Ni11bhgcYKMP0QU-owOo914/s1600/Gemini_Generated_Image_rar5ysrar5ysrar5.png",
  "content_plain": "Sosialisasi Open Source Software Kabupaten Kutai Kartanegara, Kalimantan Timur 4-8 Oktober 2010 Dalam rangkaian kegiatan penerapan software legal berbasis Open Sources Software, Kementerian Riset dan Teknologi pada tanggal 4 oktober 2010 mengadakan Kegiatan Sosialisasi Pemanfataan Perangkat Lunak Legal dan Open Source Software di lingkungan Pemda Kabupaten Kutai Kartanegera. Acara sosialisasi ini dibuka resmi oleh Wakil Bupati Kutai Kartanegara yang didampingi oleh Kepala Dinas Komunikasi dan Informatika Kabupaten Kutai Kartanegara sebagai Penyelenggara Lokal. Kegiatan Sosialisasi ini dilanjutkan dengan Kegiatan Migrasi dan Pelatihan OSS di seluruh SKPD Kabupaten Kartanegara yang dimulai tanggal 5 – 8 Oktober 2010 yang dipandu oleh Tim Teknis dari Makara UI serta Komunitas OSS - KPLI Balikpapan dan POSS Universitas Mulawarman Samarinda. Acara sosialisasi ini dihadiri oleh Kepala SKPD, guru-guru, mahasiswa dan serta Komunitas OSS di Kutai Kartanegara. Adapun narasumber yang hadir pada acara sosialisasi ini adalah selain dari Kementerian Riset dan Teknologi, yang dalam hal ini diwakili oleh Kasubid Promosi IPTEK Industri Strategis, juga dari Depkominfo yang diwakili Kasubdit Interoperabilitas, POSS ITB dan pakar IT Onno Purbo . Diharapkan dengan model migrasi ini di kabupaten Kutai Kartanegara dapat mengimplementasikan software legal berbasis OSS sekaligus tindaklanjut dari surat edaran MenPan tentang Penggunaan Perangkat Lunak Legal dan OSS."
}