{
  "id": "ubah-suara-ubuntu-stereo",
  "slug": "ubah-suara-ubuntu-stereo",
  "title": "Ubah Suara Sistem Ubuntu: Panduan Kustomisasi Audio",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-10-16T23:20:38.207+00:00",
  "url": "https://dalam.web.id/artikel/ubah-suara-ubuntu-stereo.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjGhw5w-3S9kqFPG3RLJtFVZsx-4N4vpKMINcTd7Kvsg4-7n6ewAEV_HRX6aTfFUXaI4DbSzWEfOaLK67wtmhoClHTG4rWq2Q3T4f_VJ6EAKzdx-fl8OAxdyMEUhsOVNUAmoboKos_13Yhf/s16000/Batu-Ampar_007.jpeg",
  "content": "🔊 dalam.web.id Ubah Suara Sistem Ubuntu dengan Audio Buatan Sendiri Bosan dengan suara notifikasi bawaan Ubuntu? Anda bisa menggantinya dengan file audio Anda sendiri. Prosesnya mudah dan hanya memerlukan beberapa langkah di terminal. Langkah Aman Mengganti Suara Sistem 1. Temukan Folder Tema Suara File suara sistem disimpan di dalam direktori tema. Lokasi umumnya adalah /usr/share/sounds/. Anda bisa melihat tema yang tersedia dengan perintah: ls /usr/share/sounds/Salin File audio spesifik biasanya ada di dalam subfolder stereo, misalnya: /usr/share/sounds/Yaru/stereo. 2. Cadangkan File Asli Sebelum melakukan perubahan, selalu buat cadangan file suara asli agar mudah dikembalikan jika diperlukan. sudo mkdir -p ~/backup-sounds/stereo sudo cp /usr/share/sounds/Yaru/stereo/*.oga ~/backup-sounds/stereo/Salin 3. Siapkan File Audio Pengganti Gunakan file audio dengan format OGG atau OGA. Jika file Anda masih dalam format lain (misalnya WAV), Anda bisa mengonversinya menggunakan ffmpeg. ffmpeg -i input.wav -c:a libvorbis bell.oggSalin 4. Ganti File dan Muat Ulang Sesi Salin file audio baru Anda ke direktori tema suara dengan nama yang sama seperti file asli (misalnya, bell.oga). sudo cp bell.ogg /usr/share/sounds/Yaru/stereo/bell.ogaSalin Terakhir, logout dan login kembali, atau restart sound server agar perubahan diterapkan. systemctl --user restart pipewire pipewire-pulseSalin",
  "meta": {
    "summary": "Masih suka suara Ubuntu atau ingin menggantinya dengan audio buatan sendiri? Panduan mudah: lokasi folder stereo, langkah aman mengganti bunyi, dan contoh.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Masih suka suara Ubuntu atau ingin menggantinya dengan audio buatan sendiri? Panduan mudah: lokasi folder stereo, langkah aman mengganti bunyi, dan contoh."
  }
}