{
  "id": "ubuntu-jogja-gcos-2009-celana-batik",
  "slug": "ubuntu-jogja-gcos-2009-celana-batik",
  "title": "Tampil Beda di GCOS 2009: Komunitas Ubuntu Jogja, Celana Batik, dan Penghargaan FOSS Terbaik 🏆",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-12-07T04:11:03.512+00:00",
  "url": "https://dalam.web.id/artikel/ubuntu-jogja-gcos-2009-celana-batik.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiWcq_1adHfumE95UtmzUZ956ODbUgoDP8oM7vS6PbsrR2nfhWymQY_3I0R8FDt2JBMlexdsMb8Gc3ncKqDa3ZAsNo3CcOKo169TqtXfWh6tixGudO_PBaOwHovGKxFY-Ywa72b/s320/screenshot_006.png",
  "content": {
    "text": "Budaya Bertemu Teknologi: Celana Batik di GCOS 2009 Komunitas Ubuntu Jogja: Juara Komunitas FOSS Terbaik Dalam rapat penentuan kostum dalam **GCOS 2009** cukup *alot*. Akhirnya diputuskan bahwa hari pertama menggunakan **celana batik**. Celana batik dinilai cukup unik dan mewakili Jogja. **Komunitas Ubuntu Jogja** dalam **GCOS 2009** dinyatakan sebagai komunitas FOSS terbaik. Oleh sebab itu **Komunitas Ubuntu Jogja** diundang untuk menghadiri **GCOS 2009** serta mendapat kesempatan untuk mengisi stand bersama Komunitas Blender Indonesia. **GCOS (Government Computer Open Source)** pada tahun 2009 merupakan salah satu ajang paling bergengsi bagi pegiat FOSS (Free/Open Source Software) di Indonesia. Pemerintah kala itu aktif mendorong penggunaan perangkat lunak bebas di instansi-instansi. Kehadiran **Komunitas Ubuntu Jogja** sebagai perwakilan FOSS terbaik di tengah acara formal kementerian ini adalah bukti pengakuan atas kontribusi mereka di kancah teknologi nasional. Keberanian mengenakan celana batik jelas memberikan sentuhan personal dan budaya yang kuat, yang membedakan mereka dari kelompok teknis lainnya. Selama 1 hari penuh dari awal acara dimulai sampai pulang ke hotel **Komunitas Ubuntu Jogja** tetap mengenakan celana Batik. Kami bangga menggunakan Batik tidak sekedar acara formalitas saja. Saya pada awalnya tidak percaya diri mengenakan celana batik ini. Setelah saya fikir lagi saya justru harusnya bangga mengenakan celana batik. Kostum dengan celana batik ini memang beda dari peserta **GCOS 2009**. Bahkan saya tidak malu mengenakan celana batik saat menerima penghargaan komunitas terbaik dari Menkominfo Tifatul Sembiring. Peserta **GCOS 2009** rata-rata mengenakan kemeja batik dan membawa tas batik yang merupakan *conference kit* dari **GCOS 2009**. Bahkan menurut informasi yang beredar bahwa tas batik **GCOS 2009** dipesan dari Jogja. Semua orang boleh mengenakan kemeja batik dan tas batik tapi **Komunitas Ubuntu Jogja** mengenakan **celana batik**. Ini memang beda!!! Kami bangga mengenakan batik bahkan celana batik. 🇮🇩 **Filosofi Celana Batik:** Ketika mayoritas audiens mengenakan kemeja batik (sebagai busana resmi atas), celana batik justru memberikan kesan santai, kreatif, dan berani mendobrak formalitas—semangat yang sangat sejalan dengan filosofi Open Source (kebebasan, transparansi, dan kolaborasi). Pilihan ini berhasil mencuri perhatian dan menjadi ciri khas yang melekat pada delegasi dari Yogyakarta, kota budaya dan pendidikan. Dokumentasi Kegiatan di Stand Komunitas Mendekorasi Stand Komunitas Ubuntu Jogja Bercanda dengan Komunitas Blender Indonesia Komunitas Ubuntu Jogja bersama Ketua Ubuntu-ID dan Ruth Marya Detik-detik Penerimaan Penghargaan Foto bersama Menkominfo Tifatul Sembiring dan Ketua AOSI Keberanian tampil beda dengan celana batik ini memberikan pesan penting: **Teknologi canggih (seperti Ubuntu) dapat bersinergi harmonis dengan kekayaan budaya lokal Indonesia.** **Komunitas Ubuntu Jogja** tidak hanya mempromosikan *open source*, tetapi juga mempromosikan identitas budaya mereka. Sebuah langkah yang patut diacungi jempol dan dikenang sebagai momen unik dalam sejarah komunitas FOSS di Indonesia. Selamat untuk **Komunitas Ubuntu Jogja**! Sumber asli: www.milisdad.blogspot.com/2009/10/tampil-beda-pada-gcos-2009-dengan.html"
  },
  "meta": {
    "summary": "Kisah Komunitas Ubuntu Jogja (KUJ) yang tampil unik di Government Computer Open Source (GCOS) 2009 dengan celana batik, meraih penghargaan sebagai Komunitas FOSS terbaik dari Menkominfo Tifatul Sembiring.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Kisah Komunitas Ubuntu Jogja (KUJ) yang tampil unik di Government Computer Open Source (GCOS) 2009 dengan celana batik, meraih penghargaan sebagai Komunitas FOSS terbaik dari Menkominfo Tifatul Sembiring."
  }
}