{
  "id": "ubuntu-jogja-juara-foss-gcos-2009",
  "slug": "ubuntu-jogja-juara-foss-gcos-2009",
  "title": "Juara 1 Komunitas FOSS Terbaik: Kisah Ubuntu Jogja di GCOS 2009, Jakarta 🏆",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-12-07T04:11:03.513+00:00",
  "url": "https://dalam.web.id/artikel/ubuntu-jogja-juara-foss-gcos-2009.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgghkB7Y8an0qGjNM-4fAHLvnt8VOqfrvA3fSKQzv5SzfHtRHmuovZC93o3EclL8BvTgYAupfBbYDo16HQ2BPyJgKdzvgVtNS7VIbSkKO_huQRL9BQhY5bx9GTiY3B1jF-lJfkE_-EoAy4/s320/terima-penghargaan.png",
  "content": "Komunitas Ubuntu Jogja: Juara FOSS Terbaik di **GCOS 2009** Global Conference on Open Source, Hotel Shangri-La Jakarta | 26-27 Oktober 2009 Detik-detik menerima penghargaan dari Menkominfo Tifatul Sembiring. **Global Conference on Open Source (GCOS)** yang diselenggarakan di Hotel Sharing-La Jakarta dari tanggal 26-27 Oktober 2009 menjadi suatu acara yang membanggakan bagi bangsa Indonesia. Dalam acara ini banyak berkumpulnya pakar-pakar Open Source dari beberapa belahan dunia. Peserta yang menghadiri sekitar 500 orang baik dari dalam maupun dari luar negeri. **GCOS** dibuka oleh Menkominfo Tifatul Sembiring. Sebelum membuka acara Tifatul Sembiring dalam pidato menyempatkan berpantun. *Sayang sekali saya tidak bisa mengingat pantun yang disampaikan oleh Menkominfo periode 2009-2014.* Pengumuman Pemenang Kompetisi Komunitas FOSS **Komunitas Ubuntu Jogja** diundang untuk menghadiri **GCOS** karena memenangkan kompetisi komunitas FOSS. Komunitas Ubuntu Jogja meraih juara pertama. Untuk juara kedua diraih oleh Komunitas Blender Indonesia. Berikut kutipan email dari panitia yang menyatakan bahwa Komunitas Ubuntu Jogja sebagai pemenang dalam kompetisi komunitas FOSS: Yth. Alvonsius Albert Nainupu Koordinator Ubuntu Jogja Saya mewakili panitia kompetisi komunitas FOSS dalam rangka **GCOS 2009** menyampaikan ucapan selamat atas terpilihnya Ubuntu Jogja sebagai penerima penghargaan dan berhak mengikuti pameran dalam acara **GCOS**, 26-27 Oktober di Jakarta. Perjalanan ke Jakarta Kami berangkat hari minggu, 25 Oktober 2009 mengggunakan bis **Rosalia Indah**. Perjalanan yang cukup panjang karena waktunya sekitar 15 jam. Jam 06.00 kami turun di Mampang Prapatan. Anggota Komunitas Ubuntu yang dikenal dengan **SPG Ubuntu Jogja** yang berangkat menggunakan jalur bis sebanyak 6 orang. 4 orang lainnya menggunakan kereta dan pesawat. Delegasi SPG Ubuntu Jogja di GCOS 2009 (10 Orang) Albert Alvonsius A. Frans Setiawan Hendra Phalita (Nawa) Kosha Ismed Darmanto Didin Jamaludin Wira F.Rijal Milisdad Kebanggaan dan Pemicu Kontribusi Sebagai komunitas yang bergerak dibidang sosialisasi dan advokasi penggunaan Ubuntu di Jogja dan sekitarnya, tentunya kami sangat bangga dapat memenangkan kompetisi komunitas FOSS. Semua ini tidak terlepas dari dukungan dan doa dari rekan-rekan FOSS lainnya. Pertama kali baca email tentang kemenangan ini saya sangat senang sekali. Tentunya ini menjadi pemicu buat kami untuk tetap berkontribusi kebangsa ini melalui sosialisasi dan advokasi Linux, Ubuntu, FOSS. Penyerahan penghargaan pemenang kompetisi langsung oleh Menkominfo Tifatul Sembiring. Berhubung koordinator SPG Ubuntu Jogja dalam perjalanan akhirnya saya sendiri yang langsung menerima. Selain itu juga ada penyerahan penghargaan kepada pemenang olimpiade ODF. Bapak Menkominfo menyarankan untuk mengganti nama Komunitas Ubuntu Jogja menjadi bahasa jawa. Saya pun menjawab \"Paguyuban Pak :)\". Mungkin Komunitas Ubuntu Jogja bisa menjadi *Paguyuban Ubuntu Ngayogyakarto*. 😅 Kami Mewakili *Paguyuban Ubuntu Ngayogyakarto* menyampaikan terimakasih atas dukungan dan doa kepada semua pihak, termasuk masyarakat Jogja. *Foto oleh Arman Satary.* sumber dari: www.milisdad.blogspot.com/2009/10/ubuntu-jogja-sebagai-juara-1-kompetisi.html",
  "meta": {
    "summary": "Komunitas Ubuntu Jogja (KUJ) meraih juara pertama dalam Kompetisi Komunitas FOSS di GCOS 2009, Jakarta. Simak perjalanan mereka, penerimaan penghargaan dari Menkominfo Tifatul Sembiring, dan semangat Paguyuban Ubuntu Ngayogyakarto.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Komunitas Ubuntu Jogja (KUJ) meraih juara pertama dalam Kompetisi Komunitas FOSS di GCOS 2009, Jakarta. Simak perjalanan mereka, penerimaan penghargaan dari Menkominfo Tifatul Sembiring, dan semangat Paguyuban Ubuntu Ngayogyakarto."
  }
}