{
  "id": "ubuntu-25-10-beta",
  "slug": "ubuntu-25-10-beta",
  "title": "Ubuntu 25.10 Beta: Kernel 6.17, GNOME 49, Wayland-only, dan Enkripsi TPM",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-10-16T23:20:38.207+00:00",
  "url": "https://dalam.web.id/artikel/ubuntu-25-10-beta.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjOArWwQS6HpTl3b_IJ3gwIgNSUWWm5-9hZ-lRD8OLwFYoagDpinerazkMOFuNjub7RDSPCAuMWv9s1yWZMITIeYAg9jbB8j97DTarfmIi9BbgO6W_rYOCh8f8qlrhBoRhG9O3Wk4-KIxDDcRZNrmoX8fp-jWWcJB4OGyxRi2Ckj9ouQZzU24Teb3N5WgM/s1600/ubuntu2510-beta.jpg",
  "content": {
    "text": "Ubuntu 25.10 Beta Dirilis dengan Kernel 6.17 dan GNOME 49 Canonical telah merilis Ubuntu 25.10 \"Questing Quokka\" Beta. Edisi ini menandai langkah berani dengan menjadikan Wayland sebagai satu-satunya sesi desktop, memodernisasi aplikasi bawaan, dan memperkuat lapisan keamanan dengan enkripsi berbasis TPM. Sorotan Utama Pembaruan Kernel 6.17: Memberikan dukungan perangkat keras yang lebih luas untuk platform Intel, AMD, ARM, dan RISC-V. GNOME 49: Pengalaman desktop yang lebih halus dengan kontrol media di layar kunci dan slider kecerahan per-monitor di Pengaturan Cepat. Aplikasi Bawaan Baru: Penampil gambar Eye of GNOME digantikan oleh Loupe (berbasis Rust/GTK4), dan Ptyxis menggantikan GNOME Terminal. Desktop Wayland-only: Sesi Xorg kini telah dihapus. Aplikasi X11 lama tetap berjalan mulus melalui kompatibilitas XWayland. Peningkatan Keamanan: Installer menawarkan enkripsi disk penuh yang didukung TPM, termasuk indikator entropi untuk frasa sandi dan dukungan PIN. Dracut sebagai Default: Menggantikan initramfs-tools sebagai generator initramfs bawaan. Ketersediaan Ubuntu 25.10 Beta sudah dapat diunduh untuk dicoba. Namun, perlu diingat bahwa ini adalah versi beta dan tidak disarankan untuk penggunaan produksi. Rilis final dijadwalkan pada 9 Oktober. Jika Anda mencari stabilitas, tunggulah rilis final tersebut.",
    "html": "<h1>Ubuntu 25.10 Beta Dirilis dengan Kernel 6.17 dan GNOME 49</h1>\n\n                    <p class=\"lead\">Canonical telah merilis Ubuntu 25.10 \"Questing Quokka\" Beta. Edisi ini menandai langkah berani dengan menjadikan Wayland sebagai satu-satunya sesi desktop, memodernisasi aplikasi bawaan, dan memperkuat lapisan keamanan dengan enkripsi berbasis TPM.</p>\n                    <div class=\"gallery\">\n                        <figure><img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjOArWwQS6HpTl3b_IJ3gwIgNSUWWm5-9hZ-lRD8OLwFYoagDpinerazkMOFuNjub7RDSPCAuMWv9s1yWZMITIeYAg9jbB8j97DTarfmIi9BbgO6W_rYOCh8f8qlrhBoRhG9O3Wk4-KIxDDcRZNrmoX8fp-jWWcJB4OGyxRi2Ckj9ouQZzU24Teb3N5WgM/s1600/ubuntu2510-beta.jpg\" alt=\"Poster Ubuntu 25.10 Beta\"></figure>\n                        <figure><img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiwVd-72MJz6z0TIMIOqbE24fdqnoHT01QnmHO299zzGDU0i-DEfP-OiD4-U223Bbuj7JeT9VsTiqLTFyORhFDihQVi5RwPbIOp1KOVRV72BPSFdtvDjzWatemjiGp4_wh_v_jhlwCYwdbIPYmTc253tiE9BCafLnnLxtOJgk3mzCbgXM2P32OEiNQGPig/s1600/ubuntu2510-beta-desktop.jpg\" alt=\"Tampilan desktop Ubuntu 25.10\"></figure>\n                    </div>\n                    <h2>Sorotan Utama Pembaruan</h2>\n                    <ul>\n                        <li><strong>Kernel 6.17:</strong> Memberikan dukungan perangkat keras yang lebih luas untuk platform Intel, AMD, ARM, dan RISC-V.</li>\n                        <li><strong>GNOME 49:</strong> Pengalaman desktop yang lebih halus dengan kontrol media di layar kunci dan slider kecerahan per-monitor di Pengaturan Cepat.</li>\n                        <li><strong>Aplikasi Bawaan Baru:</strong> Penampil gambar Eye of GNOME digantikan oleh <strong>Loupe</strong> (berbasis Rust/GTK4), dan <strong>Ptyxis</strong> menggantikan GNOME Terminal.</li>\n                        <li><strong>Desktop Wayland-only:</strong> Sesi Xorg kini telah dihapus. Aplikasi X11 lama tetap berjalan mulus melalui kompatibilitas XWayland.</li>\n                        <li><strong>Peningkatan Keamanan:</strong> Installer menawarkan enkripsi disk penuh yang didukung <strong>TPM</strong>, termasuk indikator entropi untuk frasa sandi dan dukungan PIN.</li>\n                        <li><strong>Dracut sebagai Default:</strong> Menggantikan <code>initramfs-tools</code> sebagai generator initramfs bawaan.</li>\n                    </ul>\n                    <h2>Ketersediaan</h2>\n                    <p>Ubuntu 25.10 Beta sudah dapat diunduh untuk dicoba. Namun, perlu diingat bahwa ini adalah versi beta dan tidak disarankan untuk penggunaan produksi. Rilis final dijadwalkan pada 9 Oktober. Jika Anda mencari stabilitas, tunggulah rilis final tersebut.</p>"
  },
  "meta": {
    "summary": "Ubuntu 25.10 Beta membawa Linux kernel 6.17, GNOME 49, Loupe, Ptyxis, desktop Wayland-only, enkripsi TPM yang lebih kuat, dan banyak pembaruan toolchain.",
    "prompt_hint": "Ubuntu 25.10 Beta membawa Linux kernel 6.17, GNOME 49, Loupe, Ptyxis, desktop Wayland-only, enkripsi TPM yang lebih kuat, dan banyak pembaruan toolchain.",
    "keywords": [],
    "topics": []
  }
}