{
  "id": "ubuntu-25-10-startup-applications",
  "slug": "ubuntu-25-10-startup-applications",
  "title": "Ubuntu 25.10 Menghapus Startup Applications: Cara Autostart Sekarang",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-10-16T23:20:38.207+00:00",
  "url": "https://dalam.web.id/artikel/ubuntu-25-10-startup-applications.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhHbiPnd5HxRovWtbvFEviirmRGFZ263-qATuBD_rR49BmKw2c7rdTxZSWnph26A8bLnW8jquoMc0oecqhE0UNpJPC6NHI5zxUBg7fwq_F0UBG0NaWS6ptW05lq-0nDia4jGd-lximCW0q6rK7QUJVRzn7ylOWn14CyrQ6JiwuuJcSpNDZDSy4QhEDOZCY/s1600/trash.jpg",
  "content": {
    "text": "Ubuntu 25.10 Menghapus Startup Applications: Cara Autostart Sekarang Ingin aplikasi favoritmu otomatis berjalan saat login ke Ubuntu? Dulu ada alat Startup Applications, tapi di Ubuntu 25.10, alat itu sudah tidak ada lagi. Mari kita bedah perubahannya. Ubuntu 25.10 hadir dengan GNOME 49, yang membawa banyak perubahan dalam cara sesi ditangani, termasuk integrasi lebih dalam dengan systemd. Akibatnya, antarmuka grafis gnome-startup-applications yang dulu biasa kita gunakan kini telah dihapus. Namun, hilangnya antarmuka ini tidak berarti kemampuan autostart aplikasi ikut hilang. Masih ada dua cara utama untuk mengaturnya. Tampilan GUI lama yang kini dihapus Cara manual via folder autostart Perbandingan Cepat: Dulu vs Sekarang Fitur Ubuntu 24.xx (Lama) Ubuntu 25.10 (Baru) GUI Bawaan Aplikasi Startup Applications Dihapus Menambah Aplikasi Klik Add di GUI Gunakan toggle di Settings → Applications Menambah Skrip Kustom Bisa langsung di GUI Harus manual membuat file .desktop Cara Manual: Membuat File .desktop Untuk fleksibilitas penuh, seperti menjalankan skrip atau menambahkan argumen, Anda harus membuat file .desktop di direktori ~/.config/autostart/. Berikut contohnya: [Desktop Entry] Type=Application Version=1.0 Name=Jalankan Skrip Login Comment=Menjalankan skrip kustom saat masuk Exec=/home/<user>/scripts/startup.sh --verbose StartupNotify=false Terminal=false X-GNOME-Autostart-enabled=trueSalin Tip: Pastikan skrip Anda memiliki izin eksekusi (chmod +x nama_skrip.sh) dan gunakan path absolut untuk baris Exec."
  },
  "meta": {
    "summary": "Ubuntu 25.10 menghapus GUI Startup Applications. Autostart masih bisa via Settings → Applications dan file .desktop di ~/.config/autostart.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Ubuntu 25.10 menghapus GUI Startup Applications. Autostart masih bisa via Settings → Applications dan file .desktop di ~/.config/autostart."
  }
}