{
  "id": "uji-kecepatan-internet-dari-terminal",
  "slug": "uji-kecepatan-internet-dari-terminal",
  "title": "Uji Kecepatan Internet dari Terminal: Panduan Santai",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-10-16T23:20:38.208+00:00",
  "url": "https://dalam.web.id/artikel/uji-kecepatan-internet-dari-terminal.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh6z6_M-x_agbooaxeVfyZp5K-yLD33q8xTsW9iQmQR1QdHZQGtgcqaLA6oCv3QhyphenhyphenLzJwahDYes-DTBNShwq0dwLCbju8v7r4dkmfvyrup993r6QFoFr5QRVBBCgk03LQnipZk44WvcMg_c/w1200-h630-p-k-no-nu/image2993.png",
  "content_plain": "Uji Kecepatan Internet dari Terminal Penasaran dengan kecepatan internet Anda tanpa harus membuka browser? Ada cara keren untuk melakukannya langsung dari terminal menggunakan `speedtest-cli`. Cara Pemasangan speedtest-cli Di Linux (Debian/Ubuntu) sudo apt update && sudo apt install speedtest-cliSalin Di Linux (Fedora/CentOS) sudo dnf install speedtest-cliSalin Di Windows (via Python) Pastikan Python sudah terinstal, lalu jalankan perintah ini di PowerShell atau CMD: pip install speedtest-cliSalin Mulai Uji Kecepatan Setelah terpasang, cukup ketik perintah berikut di terminal: speedtest-cliSalin Hasilnya akan langsung ditampilkan, lengkap dengan informasi ping, kecepatan unduh (download), dan kecepatan unggah (upload). Fitur Tambahan yang Keren Memilih Server Tertentu: Gunakan speedtest-cli --list untuk melihat daftar server, lalu speedtest-cli --server [ID] untuk menguji ke server spesifik. Hasil dalam Bytes: Gunakan opsi --bytes untuk menampilkan hasil dalam MB/s, bukan Mbit/s. Hasil Berbentuk JSON: Tambahkan opsi --json untuk output yang mudah diolah oleh skrip.",
  "meta": {
    "summary": "Pelajari cara mengukur kecepatan internet langsung dari terminal dengan speedtest-cli. Panduan mudah untuk Linux dan Windows.",
    "prompt_hint": "Pelajari cara mengukur kecepatan internet langsung dari terminal dengan speedtest-cli. Panduan mudah untuk Linux dan Windows.",
    "keywords": [],
    "topics": []
  }
}