{
  "id": "ventoy-install-linux",
  "slug": "ventoy-install-linux",
  "title": "Cara Instal & Pakai Ventoy untuk Bootable USB di Linux 💽",
  "category": "🐧 Linux & Open Source",
  "published_at": "2025-10-16T23:20:38.208+00:00",
  "url": "https://dalam.web.id/artikel/ventoy-install-linux.html",
  "image": "https://dalam.web.id/img/ventoy-install-linux.webp",
  "content": {
    "text": "Cara Instal & Pakai Ventoy untuk Bootable USB di Linux Ventoy adalah tool open-source yang memungkinkan Anda membuat flashdisk menjadi multi-boot USB. Cukup instal Ventoy sekali, lalu Anda bisa menyalin banyak file ISO, WIM, atau IMG ke dalamnya dan memilih OS mana yang akan di-boot dari menu. Langkah 1: Unduh dan Ekstrak Ventoy Kunjungi halaman unduh Ventoy dan dapatkan file untuk Linux. Setelah itu, ekstrak arsipnya. tar xvf ventoy-*.tar.gz cd ventoy-*/Salin Langkah 2: Instal Ventoy ke USB Gunakan perintah lsblk untuk menemukan nama device USB Anda (misalnya, /dev/sdb). Hati-hati, jangan salah pilih disk! Kemudian, jalankan skrip instalasi. sudo sh Ventoy2Disk.sh -i /dev/sdXSalin Ganti /dev/sdX dengan nama device USB Anda. Anda akan diminta konfirmasi dua kali karena proses ini akan menghapus semua data di USB. Mode GUI: Menggunakan VentoyWeb Jika Anda lebih suka antarmuka grafis, Ventoy menyediakan mode web. Jalankan skrip berikut, lalu buka http://127.0.0.1:24680 di browser Anda. sudo sh VentoyWeb.shSalin Fitur Persistence (Menyimpan Perubahan) Ingin menyimpan perubahan pada Live OS? Ventoy mendukung fitur persistence. Anda bisa membuat file data terpisah yang akan digunakan oleh Live OS untuk menyimpan pengaturan, file, dan aplikasi yang diinstal. Kesimpulan Ventoy adalah alat yang sangat praktis bagi siapa saja yang sering bekerja dengan banyak sistem operasi. Kemudahan penggunaan dan fleksibilitasnya menjadikannya pilihan utama untuk membuat multi-boot USB. Selamat mencoba!",
    "html": "<h1>Cara Instal &amp; Pakai Ventoy untuk Bootable USB di Linux</h1>\n<div id=\"iposbrowser\"></div>\n                    <p class=\"lead\">Ventoy adalah tool open-source yang memungkinkan Anda membuat flashdisk menjadi multi-boot USB. Cukup instal Ventoy sekali, lalu Anda bisa menyalin banyak file ISO, WIM, atau IMG ke dalamnya dan memilih OS mana yang akan di-boot dari menu.</p>\n\n                    <h2>Langkah 1: Unduh dan Ekstrak Ventoy</h2>\n                    <p>Kunjungi <a href=\"https://www.ventoy.net/en/download.html\" target=\"_blank\">halaman unduh Ventoy</a> dan dapatkan file untuk Linux. Setelah itu, ekstrak arsipnya.</p>\n                    <pre class=\"language-bash\"><code id=\"code1\">tar xvf ventoy-*.tar.gz\ncd ventoy-*/</code><button class=\"copy-btn\" data-target=\"code1\">Salin</button></pre>\n                    <h2>Langkah 2: Instal Ventoy ke USB</h2>\n                    <p>Gunakan perintah <code>lsblk</code> untuk menemukan nama device USB Anda (misalnya, <code>/dev/sdb</code>). Hati-hati, jangan salah pilih disk! Kemudian, jalankan skrip instalasi.</p>\n                    <pre class=\"language-bash\"><code id=\"code2\">sudo sh Ventoy2Disk.sh -i /dev/sdX</code><button class=\"copy-btn\" data-target=\"code2\">Salin</button></pre>\n                    <p class=\"muted\">Ganti <code>/dev/sdX</code> dengan nama device USB Anda. Anda akan diminta konfirmasi dua kali karena proses ini akan menghapus semua data di USB.</p>\n                    <h2>Mode GUI: Menggunakan VentoyWeb</h2>\n                    <p>Jika Anda lebih suka antarmuka grafis, Ventoy menyediakan mode web. Jalankan skrip berikut, lalu buka <code>http://127.0.0.1:24680</code> di browser Anda.</p>\n                    <pre class=\"language-bash\"><code id=\"code3\">sudo sh VentoyWeb.sh</code><button class=\"copy-btn\" data-target=\"code3\">Salin</button></pre>\n                    <figure><img src=\"https://blogger.googleusercontent.com/img/a/AVvXsEhQvs0sWh4Qu6UXaiNWYskGXzt9ZHqrKuGwDLPh9OsVK7QuXsvzQ-URUpBvKIvulF55y-qcAUgxKtfsRsipjCJuV0uKXiqogHFqmKuygdUm2HtEuzn48n7w3CBWllF_2AA7kJmpCAWjBeGL4AbRuhpU2G4ejtcb8Kpta_S3lEuwY7V8WPukyW4gGIvzHf0\" alt=\"Tampilan VentoyWeb GUI\"></figure>\n                    <h2>Fitur Persistence (Menyimpan Perubahan)</h2>\n                    <p>Ingin menyimpan perubahan pada Live OS? Ventoy mendukung fitur <em>persistence</em>. Anda bisa membuat file data terpisah yang akan digunakan oleh Live OS untuk menyimpan pengaturan, file, dan aplikasi yang diinstal.</p>\n                    <h2>Kesimpulan</h2>\n                    <p>Ventoy adalah alat yang sangat praktis bagi siapa saja yang sering bekerja dengan banyak sistem operasi. Kemudahan penggunaan dan fleksibilitasnya menjadikannya pilihan utama untuk membuat multi-boot USB. Selamat mencoba!</p>\n                         <div id=\"pesbukdiskus\"></div>"
  },
  "meta": {
    "summary": "Panduan mudah, interaktif & santai cara instal dan pakai Ventoy di Linux. Bikin multi-boot USB tanpa ribet! Support persistence, mode GUI, dan lainnya.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Panduan mudah, interaktif & santai cara instal dan pakai Ventoy di Linux. Bikin multi-boot USB tanpa ribet! Support persistence, mode GUI, dan lainnya."
  }
}