{
  "id": "waspada-kejahatan-phishing",
  "slug": "waspada-kejahatan-phishing",
  "title": "Apa Itu Kejahatan Phishing dan Cara Mencegahnya?",
  "category": "🖥️ Teknologi Web, AI & Umum",
  "published_at": "2025-10-16T23:20:38.208+00:00",
  "url": "https://dalam.web.id/artikel/waspada-kejahatan-phishing.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiVHkObjiTPqhlkCa-m4gLhedgCnS1ErHjwQ9Avm6UUrDw7acLRjePYi96EMpcxYQKUd5OjuWCkoep4Tvd33ZqRslrJ5v9g-Wl4fsXQahX1ub3wyY4iq1DnCAYzUC34MjsVAKD6oMb1sSwL/s1600/golput.jpg",
  "content": {
    "text": "Waspada Phishing: Jaga Data Pribadi Anda Tetap Aman! Penipuan online bisa datang dari mana saja. Yuk, kenali modusnya dan pelajari cara menghindarinya agar data pribadi dan finansial Anda tetap aman. Apa Itu Phishing? Singkatnya, phishing adalah aksi pencurian data. Pelaku akan mencoba mengambil informasi pribadi dan sensitif Anda, seperti User ID, PIN, nomor rekening, atau nomor kartu kredit, secara ilegal. Tujuannya jelas: untuk menipu atau melakukan kejahatan finansial. Bagaimana Phishing Dilakukan? Para penipu memiliki banyak cara untuk menjebak korban. Modus yang paling sering digunakan antara lain: Mengirim email palsu yang tampilannya mirip dengan email resmi dari bank, meminta data dengan alasan \"verifikasi akun\". Membuat website palsu yang desainnya menjiplak situs aslinya. Begitu Anda memasukkan data, informasi tersebut langsung dicuri. Mengirimkan formulir isian lewat email yang memaksa Anda untuk mengisi data-data sensitif. Cara Mudah Mencegah Phishing Jangan panik! Ada beberapa langkah sederhana yang bisa Anda lakukan untuk melindungi diri: Selalu periksa alamat website di address bar browser. Pastikan alamatnya benar dan menggunakan HTTPS. Jangan pernah berikan User ID atau PIN Anda kepada siapa pun, termasuk staf bank. Pihak bank tidak akan pernah meminta data tersebut. Jangan langsung percaya pada tawaran hadiah undian yang meminta Anda melakukan transfer ke rekening tertentu. Jika ada email yang mencurigakan, jangan klik tautan atau lampiran di dalamnya. Langsung hapus saja."
  },
  "meta": {
    "summary": "Kenali apa itu phishing, cara kerjanya, dan tips santai untuk menjaga data pribadi dan finansial kamu dari penipuan online.",
    "keywords": [],
    "topics": [],
    "prompt_hint": "Kenali apa itu phishing, cara kerjanya, dan tips santai untuk menjaga data pribadi dan finansial kamu dari penipuan online."
  }
}