{
  "id": "watermark-imagemagick",
  "slug": "watermark-imagemagick",
  "title": "Memberi Watermark pada Gambar dengan ImageMagick di Linux",
  "category": "📸 Multimedia & Editing",
  "published_at": "2025-10-16T23:20:38.208+00:00",
  "url": "https://dalam.web.id/artikel/watermark-imagemagick.html",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiZfd7lBezHxJd1AZq0NAtIDxU1yLmHgZMPDEB6_Z_d9CbQXDilSGRra1cNlZ_RnZSJV6GReo4oIlqaHa-mbQrO9BGSXtSM6aK9Z9QRK-0LenuEmQ9CSQMjER-8CaFJ49gFTFr4Oqe3Kgf_/s1600/Logo_Imagemagick.png",
  "content_plain": "Memberi Watermark pada Gambar dengan ImageMagick di Linux Banyak instansi memerlukan watermark pada gambar sebelum dipublikasikan untuk melindungi hak cipta. Dengan GNU/Linux, kita bisa memanfaatkan ImageMagick untuk melakukan ini secara massal, sebagai alternatif dari fitur \"Action\" di Photoshop. Skrip Bash untuk Watermark Massal Skrip berikut akan menambahkan watermark ke semua file gambar di dalam direktori saat ini. Skrip ini akan menimpa (overwrite) file asli, jadi pastikan Anda sudah memiliki backup jika diperlukan. #!/bin/bash # Skrip untuk memberi watermark pada semua gambar di direktori saat ini. # Dependensi: ImageMagick # --- KONFIGURASI --- # Lokasi file watermark Anda (ganti sesuai kebutuhan) WM_FILE=\"$HOME/watermark.png\" # Skala ukuran watermark dalam persen (misal: 50%) SCALE=\"25\" # Tingkat transparansi watermark (0-100) DISSOLVE=\"50\" # Posisi watermark (center, north, southeast, dll.) GRAVITY=\"southeast\" # --- EKSEKUSI --- echo \"Skrip ini akan menambahkan watermark ke semua gambar di folder ini.\" read -p \"Lanjutkan? (Y/n): \" REPLY if [[ $REPLY =~ ^[Yy]$ ]] || [[ -z $REPLY ]]; then for IMAGE in *.jpg *.jpeg *.png *.gif; do if [ -f \"$IMAGE\" ]; then echo \"Memberi watermark pada: $IMAGE\" composite -dissolve ${DISSOLVE}% -gravity ${GRAVITY} -quality 100 \\( \"$WM_FILE\" -resize ${SCALE}% \\) \"$IMAGE\" \"$IMAGE\" fi done echo \"Selesai!\" else echo \"Dibatalkan.\" exit 0 fi exit 0Salin Cara Menggunakan Skrip Simpan kode di atas sebagai file, misalnya watermark.sh. Ubah bagian \"KONFIGURASI\" di dalam skrip sesuai kebutuhan Anda, terutama `WM_FILE`. Letakkan skrip ini di dalam folder yang berisi gambar-gambar yang ingin Anda beri watermark. Buka terminal di folder tersebut, lalu berikan izin eksekusi pada skrip: chmod +x watermark.shSalin Jalankan skrip dengan perintah: ./watermark.shSalin",
  "meta": {
    "summary": "Panduan lengkap cara memberi watermark pada gambar menggunakan ImageMagick di Linux. Dilengkapi script bash otomatis, tutorial, dan contoh interaktif.",
    "prompt_hint": "Panduan lengkap cara memberi watermark pada gambar menggunakan ImageMagick di Linux. Dilengkapi script bash otomatis, tutorial, dan contoh interaktif.",
    "keywords": [],
    "topics": []
  }
}