{
  "id": "workflow-backup-ke-server-remote-menggunakan-rsync-via-SSH-cron",
  "title": "Tutorial rsync: Sejarah, Manfaat, dan Cara Menggunakan",
  "slug": "workflow-backup-ke-server-remote-menggunakan-rsync-via-SSH-cron.html",
  "url": "https://dalam.web.id/artikel/workflow-backup-ke-server-remote-menggunakan-rsync-via-SSH-cron.html",
  "datePublished": "2025-10-14T18:15:06.430+00:00",
  "summary": "",
  "category": "ðŸ§ Linux & Open Source",
  "promptHint": "",
  "customPromptHintManuallySet": false,
  "imageUrl": "https://dalam.web.id/img/workflow-backup-ke-server-remote-menggunakan-rsync-via-SSH-cron.webp",
  "content_plain": "Sejarah Singkat rsync rsync adalah utilitas sinkronisasi file yang diperkenalkan pertama kali pada tahun 1996 oleh Andrew Tridgell dan Paul Mackerras. Tool ini dibuat untuk memudahkan transfer file antar komputer dengan cepat dan efisien. Keunggulannya terletak pada algoritma delta-transfer, yang hanya mengirimkan perbedaan (delta) dari file, bukan keseluruhan file. Hingga kini, rsync menjadi salah satu alat favorit sysadmin di dunia Linux/Unix. Manfaat rsync ðŸ”„ Sinkronisasi file dan folder antar server atau direktori lokal. âš¡ Transfer data lebih cepat karena hanya mengirim perubahan. ðŸ›¡ï¸ Bisa digunakan untuk backup rutin dengan keamanan tinggi (via SSH). ðŸ’¾ Menghemat bandwidth dan waktu transfer data. ðŸ“‚ Mendukung copy dengan hak akses, timestamp, dan symbolic link. Cara Menggunakan rsync Format umum perintah rsync adalah: Copyrsync [opsi] sumber tujuan 1. Sinkronisasi Direktori Lokal Copyrsync -avh /home/user/Documents/ /backup/Documents/ 2. Transfer ke Server via SSH Copyrsync -avz /home/user/ username@server:/home/username/backup/ 3. Mirror Server ke Lokal Copyrsync -avz username@server:/var/www/ /home/user/backup-www/ 4. Backup dengan Exclude Copyrsync -av --exclude=\"*.tmp\" /project/ /backup/project/ Penjelasan opsi umum: -a : archive mode (menyimpan izin, symlink, timestamp, dll) -v : verbose (menampilkan detail proses) -h : human-readable (ukuran file lebih mudah dibaca) -z : compress (lebih hemat bandwidth saat transfer) Workflow Backup Otomatis dengan cron + rsync (Lokal) Kita bisa menggabungkan rsync dengan cron agar backup berjalan otomatis setiap hari. 1. Buat Skrip Backup Lokal Copy#!/bin/bash\n# backup-rsync-local.sh\n# Backup folder Documents ke /backup harian\nSRC=\"/home/user/Documents/\"\nDEST=\"/backup/Documents/\"\nLOGFILE=\"/var/log/rsync-backup-local.log\"\nrsync -avh --delete \"$SRC\" \"$DEST\" >> \"$LOGFILE\" 2>&1 2. Tambahkan ke Cron Copy0 2 * * * /home/user/backup-rsync-local.sh Artinya: jalankan backup setiap hari pukul 02:00 dini hari. Workflow Backup Otomatis ke Server Remote (SSH + cron) Untuk backup jarak jauh, kita bisa menggunakan rsync via SSH dan menjadwalkannya dengan cron. 1. Setup SSH Key (Opsional tapi Disarankan) Buat SSH key di client: Copyssh-keygen -t ed25519 -C \"user@client\" Lalu salin ke server: Copyssh-copy-id username@server 2. Buat Skrip Backup Remote Copy#!/bin/bash\n# backup-rsync-remote.sh\n# Backup Documents ke server remote\nSRC=\"/home/user/Documents/\"\nDEST=\"username@server:/home/username/backup/Documents/\"\nLOGFILE=\"/var/log/rsync-backup-remote.log\"\nrsync -avz --delete -e ssh \"$SRC\" \"$DEST\" >> \"$LOGFILE\" 2>&1 3. Tambahkan ke Cron Copy30 2 * * * /home/user/backup-rsync-remote.sh Artinya: jalankan backup ke server remote setiap hari pukul 02:30 dini hari. Dengan kombinasi ini, Anda bisa menjaga backup baik di mesin lokal maupun server remote secara otomatis dan terjadwal."
}